{
  "posts": [
    {
      "title": "حول هذه المدونة",
      "lastModified": "2022-07-22",
      "tags": [],
      "id": "about",
      "content": "«ركني الصغير في الإنترنت»، كما يجري على لسان المدونين.\n\nأنوي الكتابة هنا عن بعض ما يجول في خاطري وعن اهتماماتي.\nبخصوص اهتماماتي، فهي تتغير مع تغير الفصول، وهي الآن تتمحور غالبًا حول التكنولوجيا،\nخصوصًا استخدامها لتعزيز التعلم والتذكر.\n\nأنظر لنفسي  على أن لدي فضولًا مَرَضيًا يدفعني للرغبة في تعلم كل شيء وعدم تفويت أي شيء.\nقررت إنشاء هذه المدونة كمحاولة لإنقاذ نفسي من متاهة تلقي المعلومات السلبي في عصر الضخ المعرفي هذا\nحيث يقبل كثير منا معلومات أو يرفضها بشكل سلبي بدون الوقوف لتحليلها وبلورتها من خلال الكتابة أو البحث.\nهدف المدونة هو دفعي لأن أنتج شيئا ولو بسيطا.\n\nلدي أيضا \"ويكي شخصية\" مخصصة لتدوين أي فكرة مشتتة تخطر ببالي لا تناسب مقالة كاملة أو لتدوين شروحات قصيرة لأفكار تهمني على شكل ويكي:\n[الويكي](https://www.abdnh.net/curious/)\n"
    },
    {
      "title": "تعريف ببرنامج Anki لتذكر أي معلومة",
      "date": "2021-02-19",
      "tags": [
        "anki",
        "memory",
        "computer"
      ],
      "uuid": "43212f57-3915-45c7-9b85-a6289249de50",
      "lastModified": "2022-07-22",
      "id": "anki-intro",
      "content": "\n## مقدمة\n\nكلنا تقريبا يشكو من ضعف ذاكرته وعدم قدرته على تذكر معلومات مهمة له.\nمع أن النسيان قد يكون أمرا طبيعيا وحتميا في النهاية، إلا أن هناك طرقا يمكن للجميع استغلالها لتحسين تذكره.\nسأتكلم هنا عن تطبيق عملي لطرق تعلم فعالة يتمثل في برنامج يدعى Anki (أنكي).\nيمكن التفكير ببرنامج أنكي كدفتر لتدوين الملحوظات، لكن عكس دفاتر الملحوظات التي تسوّدها وتنسى أمرها كليا بعد فترة وجيزة،\nأنكي مخصص لمساعدتك على مراجعة ما تتعلمه بطريقة تسهل تذكر المعلومات لأطول فترة ممكنة.\nيكون استخدامك للبرنامج عموما عبارة عن إدخال للمعلومات التي تريد تذكرها (غالبا على شكل سؤال-جواب)\nثم مراجعة هذه المعلومات من خلال واجهة البرنامج بشكل متكرر.\nإذن، ما الجديد هنا والمختلف عن أي دفتر ملحوظات أو برنامج تدوين مذكرات مثلا؟\nالفرق الأكبر هنا أن البرنامج نفسه هو من يحدد متى ستراجع ما تتعلمه. يحدد البرنامج الوقت المناسب لمراجعة كل معلومة بناء\nعلى مدى تذكرك لها. لكن كيف يعرف البرنامج مدى تذكرك؟ ببساطة تخبره أنت بذلك من خلال عدة أزرار مخصصة لتقيم أداءك بنفسك.\nالضغط على أي من هذه الأزرار سيجعل البرنامج يجدول المعلومة لتراجعها في أوقات مستقبلية مختلفة.\n\n## استعراض أنكي\n\nلتوضيح استخدام شائع جدا لبرامج مثل أنكي، لنقل إنك تريد تعلم بعض المفردات الإنجليزية.\nفمثلا، تريد أن يعرض لك البرنامج كلمة إنجليزية ويطلب منك تذكر مقابلها العربي.\nلنأخذ مثالا مرفقا بالصور يوضح كيف يمكننا تحقيق هذا في أنكي.\n\nسأوضح هنا نسخة الكمبيوتر من البرنامج (تتوفر نسخ للأندرويد والأيفون أيضا تعمل بشكل مشابه).\nأنصح بتنزيل أنكي من خلال <https://apps.ankiweb.net/#download> قبل المتابعة بالقراءة\nوتطبيق الخطوات معي.\n\nبعد تنزيل البرنامج وفتحه، ستظهر لك نافذة كالتالي:\n\n:img{src=\"anki-main-window.png\" caption=\"نافذة أنكي الرئيسية\"}\n\nاضغط على زر **إضافة** في الأعلى لكي تظهر لك نافذة إدخال المعلومات التالية:\n\n:img{src=\"anki-add-window.png\" caption=\"نافذة إضافة البطاقات في أنكي\"}\n\nهذه هي نافذة إضافة البطاقات. «بطاقة» هنا تشير إلى كل معلومة مستقلة تضيفها إلى البرنامج وتريد تعلمها.\nسترى أن هناك حقلين معنونين بعناوين **أمام** و**خلف**. تحدد هذه الحقول المعلومات التي ستظهر في البطاقة،\nوكما تدل اسماؤها، فإن هذه الحقول تحدد ما سيظهر في أمام البطاقة وخلفها. تسمية بطاقة أتت من البطاقات الورقية\nالمستخدمة للغرض نفسه، التذكر، حيث تحمل سؤالا في جانب، وجواب هذا السؤال في الجانب الآخر.\nتدعى هذه البطاقات المستخدمة للتذكر -سواء الورقية أم الإلكترونية-\n[بطاقات الاستذكار](https://ar.wikipedia.org/wiki/%D8%A8%D8%B7%D8%A7%D9%82%D8%A9_%D8%A7%D8%B3%D8%AA%D8%B0%D9%83%D8%A7%D8%B1) (flashcards).\n\nحسنا، ماذا سندخل في حقلي أمام وخلف؟ تذكر أننا نريد تعلم مفردات إنجليزية ومقابل كل كلمة في العربية،\nلذلك سندخل كلمة إنجليزية في حقل أمام، ومقابلها العربي في حقل خلف. لندخل مثلا كلمة melancholy.\n\n:img{src=\"anki-filled-add-window.png\" caption=\"نافذة إضافة البطاقات في أنكي مع معلومات مدخلة\"}\n\nبعد أن تعبئ الحقول، اضغط على زر **إضافة**. ستبقى نافذة الإضافة مفتوحة إذا كنت تريد إضافة بطاقات أخرى.\nأضف كلمة أخرى من ذهنك ثم أغلق النافذة.\n\nفي النافذة الرئيسية، ستجد أن هناك قائمة بالـ*رزم* الموجودة لدينا. الرزم هي ببساطة\nأوعية تخزن فيها بطاقاتك بشكل منظم حسب الموضوع مثلا. لدينا هنا فقط رزمة باسم «افتراضية».\nستلاحظ أعلى قائمة الرزم كلمات مثل جديدة ومستحقة، وعدد 2 بالأزرق تحت عنوان «جديدة».\n\n:img{src=\"anki-main-window-with-new-cards.png\" caption=\"نافذة أنكي الرئيسية بعد إضافة بطاقتين\"}\n\nلننقر على «افتراضية» يظهر لنا التالي:\n\n:img{src=\"anki-overview-screen.png\" caption=\"شاشة موجز الرزمة في أنكي\"}\n\nلننقر على «ادرس الآن» لنرى ما سيحصل.\n\n:img{src=\"anki-review-front.png\" alt=\"جانب بطاقة أمامي في أنكي\"}\n\nظهر لنا الجانب الأمامي من البطاقة التي أضفناها منذ قليل.\nهنا مهمتنا هي بالطبع محاولة تذكر مقابل الكلمة في العربية.\nبعد أن نعصر أمخاخنا لبعض الوقت ونتذكر الكلمة (أو نستسلم)، سنجد زر «إظهار الجواب»\nفي الأسفل ونضغط عليه.\n\n:img{src=\"anki-review-back.png\" alt=\"جانب بطاقة خلفي في أنكي\"}\n\nظهر لدينا الجواب (مفاجأة!). سنلاحظ أربع أزرار في الأسفل عليها كلمات «مجددًا»، «صعب»،\n«جيد»، «سهل»؛ ورموز غريبة فوق هذه الأزرار مثل \"<1 د\"، \"<6 د\"، \"<10 د\"، \"<4 ي\".\nيمكن القول بأن الضغط على هذه الأزرار هو أهم فعل تجريه في البرنامج. هذه الأزرار مخصصة\nلكي تقيم مدى تذكرك للإجابة الصحيحة: «سهل» يعني أنك وجدت السؤال سهلا طبعا،\nو«جيد» يعني أن تذكرك للجواب كان مرضيا لكن لا يمكنك أن تقول إنه سهل،\nو«صعب» تعني أنك تذكرت الجواب بصعوبة، بينما «مجددًا» تعني أنك فشلت بتذكر الجواب.\nبخصوص الرموز فوق كل زر، فهي تشير إلى الوقت الذي يجب أن تراجع فيه البطاقة مجددا\nلتعزز من رسوخها في ذاكرتك (البرنامج «يخفي» البطاقات ويظهرها في الشاشة الرئيسية حسب هذه الأوقات).\nفـ \"4 ي\" مثلا تعني أن عليك مراجعة البطاقة مجددا بعد أربع أيام\nإذا وجدت البطاقة سهلة وضغطت على زر «سهل»، بينما تعني \"<10 د\" عند الضغط على زر «جيد» أن عليك\nمراجعة البطاقة بعد عشر دقائق وسيظهر البرنامج البطاقة بعد عشر دقائق أو يزيد بقليل.\nلاحظ أن الأوقات تزداد حسب الصعوبة (سنتكلم عن سبب هذا لاحقا).\n\nلنقل إننا وجدنا السؤال سهلا جدا وأجبنا عنه فوريا. عندها سنضغط بطبيعة الحال على زر «سهل».\n\nستظهر لنا البطاقة الثانية التي أضفناها:\n\n:img{src=\"anki-review-front-2.png\" alt=\"مراجعة بطاقة ثانية في أنكي\"}\n\nلنقل إننا وجدنا هذه الكلمة سهلة أيضا لذلك أجبنا عنها فورا وضغطنا على زر «سهل»، لتظهر لنا الشاشة التالية:\n\n:img{src=\"anki-congrats-screen.png\" caption=\"شاشة التهنئة في أنكي\"}\n\nانتهينا من دراسة هذه الرزمة المكونة من بطاقتين. إذا عدنا إلى الشاشة الرئيسية بالضغط\nعلى زر «رزم» في الأعلى فسنرى التالي:\n\n:img{src=\"anki-main-window-after-studying-new-cards.png\" caption=\"شاشة قائمة الرزم في أنكي بعد دراسة بطاقتين\"}\n\nلم يعد لدينا شيء لندرسه اليوم. لنأخذ استراحة 4 أيام ونعد للبرنامج. أنصح بالانتظار لكامل المدة\nإذا كنت تريد عيش التجربة كاملة، لكن إذا كنت عديم الصبر مثلي فيمكنك متابعة القراءة بدون تطبيق ما تقرؤه،\nأو تستطيع استخدام الخدعة التي استخدمتها [^1].\n\n(بعد 4 أيام)\n\nعدنا بعد 4 أيام وفتحنا البرنامج ووجدنا التالي في الشاشة الرئيسية:\n\n:img{src=\"anki-main-window-with-due-cards.png\" caption=\"شاشة أنكي الرئيسية بعد 4 أيام\"}\n\nلاحظ أن هناك عدد \"2\" بالأخضر تحت عنوان «مستحقة». يشير هذا العدد كما تكون قد توقعت\nإلى عدد البطاقات التي حان وقت مراجعتها اليوم.\n\nسندخل إلى الرزمة الافتراضية الآن ونبدأ الدراسة كما فعلنا سابقا.\nسنقابل بطاقة كلمة melancholy التي درسنا منذ أيام، لنضغط على إظهار الجواب لكي نرى التالي:\n\n:img{src src=\"anki-review-back-after-4-days.png\" caption=\"مراجعة بطاقة مجددا بعد 4 أيام\"}\n\nأول شيء يجب أن يلفت الانتباه هو تغير الأوقات الظاهرة فوق أزرار الإجابة. ما نوع هذا التغيير؟\nلقد ازدادت أوقات كل زر، فمثلا أصبح وقت جيد 12 يوما بدلا من 10 دقائق،\nوأصبح وقت زر سهل 16 يوما بدلا من 4 أيام. لاحظنا سابقا أن الأوقات تزداد حسب الصعوبة،\nلكن ما سبب هذا؟ هنا نأتي لأهم مبدأ يقوم عليه برنامج أنكي، وهو مبدأ المباعدة بين المراجعات،\nأو التكرار المتباعد. يقوم التكرار المتباعد على فكرة أن ذاكرتنا حول معلومة ما تقوى وتترسخ\nمع كل مراجعة وتتلاشى عندما لا نراجعها. معدل تلاشي أو اضمحلال الذاكرة يخف بعد كل مراجعة ناجحة،\nلذلك فقد يأتي وقت نراجع فيه معلومة ما ثم لا نفكر فيها أبدا إلا بعد سنة لكن نجد أن استذكارنا لها ما زال جيدا،\nوهذا ما يفسر تباعد فترات المراجعة في أنكي وتقاربها حسب الصعوبة: مهمة أنكي هي _جدولة_ المراجعات لك\nبحيث لا تحتاج إلى التفكير بما ستراجعه كل يوم وإنما تعتمد على قرار البرنامج حول ما أنت على وشك نسيانك وعليك مراجعته،\nوفي هذا توفير كبير للوقت مقارنة بطريقة الدراسة التقليدية (المعتمدة عموما على الدراسة المكثفة على جلسة واحدة).\n\nفعالية التكرار المتباعد مدّعمة بأكثر من قرن من الدراسات العلمية في مجال الذاكرة[^2].\n\nيمكن تمثيل فكرة تلاشي الذكريات مع الوقت بما يسمى _بمنحنى النسيان_، أو منحنى إبنجهاوس،\nنسبة إلى مكتشفه [هيرمان إبنجهاوس](https://ar.wikipedia.org/wiki/%D9%87%D9%8A%D8%B1%D9%85%D8%A7%D9%86_%D8%A5%D8%A8%D9%86%D8%AC%D9%87%D8%A7%D9%88%D8%B3).\n\n:img{src=\"ltm/Ebbinghaus.png\" caption=\"رسم بياني يظهر منحنى النسيان في حال تعلم معلومة وعدم مراجعتها بعد ذلك\"}\n\n:img{src=\"ltm/Ebbinghaus_repeat.png\" caption=\"رسم بياني يظهر انخفاض انحدار معدل النسيان مع كل مراجعة\"}\n\nلنكمل رحلتنا مع أنكي، ولنقل إننا ما زلنا نتذكر كلمة melancholy بشكل جيد، لذلك\nفسنضغط على زر «جيد» لكي يصبح وقت المراجعة القادمة بعد 12 يوما.\n\nنأتي الآن للبطاقة الثانية، بطاقة كلمة catastrophic (أو أي كلمة أخرى أضفتها بنفسك).\n\n:img{src=\"anki-review-back-2-after-4-days.png\" caption=\"مراجعة البطاقة الثانية بعد 4 أيام\"}\n\nسنلاحظ أن الأوقات فوق كل زر تقييم هي نفسها التي رأيناها في بطاقة melancholy،\nلأننا قيمنا كلا البطاقتين بالطريقة نفسها قبل أيام.\nلنقل إننا هذه المرة نسينا معنى catastrophic تماما، لذلك فسنضغط على «مجددًا»\nلكي تظهر البطاقة مجددا بعد حوال 10 دقائق...\n\nلكن سنتفاجأ بأن البطاقة نفسها ظهرت مجددا فوريا بدون انتظار مدة 10 دقائق! لم هذا؟\nتفسير هذا هو ببساطة أن أنكي بشكل افتراضي يتجاهل الفترات الزمنية الأقل من 20 دقيقة\nولا ينتظرها، بل يظهر البطاقات فورا. سبب هذا هو لكي لا تحتاج إلى فتح البرنامج مجددا بعد\nكل مدة قصيرة. يمكن تغيير هذا الخيار لكن لن نشرح هذا في هذه المقالة التعريفية.\n\nستكون أوقات المراجعة هذه المرة كالتالي:\n\n:img{src=\"anki-card-2-after-failed-review.png\" caption=\"أوقات مراجعة البطاقة الثانية بعد مراجعة فاشلة\"}\n\nنلاحظ أن هذه الأوقات متقاربة أكثر وأقصر من أوقات بطاقة melancholy التي نجحنا في تذكرها.\n\nلنضغط على زر جيد وننهي مراجعتنا لليوم.\n\n:img{src=\"anki-congrats-screen.png\" alt=\"شاشة التهنئة في أنكي\"}\n\nكانت هذه جولة مرئية قصيرة مع أنكي. لننتقل الآن لبعض التفاصيل المهمة.\n\n## المفاهيم الكامنة خلف أنكي\n\nيقوم برنامج أنكي وبرامج مشابهة عموما على فكرتين رئيسيتين:\n\n1. [التكرار المتباعد](https://ar.wikipedia.org/wiki/%D8%AA%D9%83%D8%B1%D8%A7%D8%B1_%D9%85%D8%AA%D8%A8%D8%A7%D8%B9%D8%AF) (spaced repetition):\n   إنه، كما ذكرنا سابقا، مراجعة المعلومات بشكل متكرر على فترات متباعدة تطول وتقصر حسب أدائنا في كل مراجعة.\n   التكرار المتباعد هو تطبيق لمبدأ يدعى [تأثير التباعد](https://ar.wikipedia.org/wiki/%D8%AA%D8%A3%D8%AB%D9%8A%D8%B1_%D8%A7%D9%84%D8%AA%D8%A8%D8%A7%D8%B9%D8%AF) والذي يظهر فعالية المباعدة بين جلسات الدراسة.\n   يطبق أنكي مبدأ التكرار المتباعد من خلال توفير أزرار تقييم تستخدمها لتقييم أدائك بنفسك،\n   ثم يأخذ أنكي أجوبتك ويحدد أوقات المراجعة القادمة باستخدامها حسب خوارزمية مخصصة لا تهمنا تفاصيلها هنا.\n2. [الاستحضار النشط](https://ar.wikipedia.org/wiki/%D8%A7%D9%84%D8%A7%D8%B3%D8%AA%D8%B0%D9%83%D8%A7%D8%B1_%D8%A7%D9%84%D9%86%D8%B4%D8%B7) (active recall):\n   هو محاولة تذكر المعلومات بشكل نشط ومركز بدلا من المراجعة السلبية (passive review) حيث لا يكون هناك نية وتركيز للتعلم.\n   مثال عن الاستحضار النشط هو أن تختبر نفسك بأن تطرح على نفسك أسئلة وتحاول الإجابة عنها، ومثال عن المراجعة السلبية هو إعادة قراءة المادة مثلا.\n   يقوم الاستحضار الفعال على مبدأ يدعى [تأثير الاختبار](https://ar.wikipedia.org/wiki/%D8%AA%D8%A3%D8%AB%D9%8A%D8%B1_%D8%A7%D9%84%D8%A7%D8%AE%D8%AA%D8%A8%D8%A7%D8%B1)\n   والذي يشير إلى أن الدراسة التي تتضمن محاولة مراجعة ما تعلمته وتذكره أكثر فعاليا من الطرق السلبية مثل مجرد قراءة كتاب أو مشاهدة فيديو مثلا.\n   يطبق أنكي هذا المبدأ من خلال توظيف فكرة بطاقات الاستذكار، حيث يعرض لك السؤال فقط ويطلب منك استحضار الجواب بشكل نشط قبل إظهار الجواب.\n\n## ملحوظات حول استخدام أنكي\n\nحسنا، لقد استعرضنا استخداما بسيطا لأنكي لتعلم مفردات إنجليزية ثم تكلمنا قليلا عن المفاهيم النظرية المستخدمة في أنكي.\nإذا سحرتك فكرة البرنامج وتحمست لها (كما حصل وما زال يحصل لي)، فلدي بعض الملحوظات التي أظنها مهمة لاستخدام أنكي بشكل فعال:\n\n### أنكي هو برنامج مراجعة\n\nالبرنامج هو برنامج **مراجعة** لما تتعلمه بشكل أولى، بمعنى أنه ليس مخصصا لكي تستخدمه وحده للتعلم.\nاستخدام البرنامج الأمثل يكون بعد أن تقرأ كتابا أو تشاهد سلسلة محاضرات مثلا حول الموضوع الذي تريد تعلمه،\nثم تضيف بطاقات أنكي لترسيخ ما تعلمته بعد تكوين صورة عامة جيدة حول الموضوع. إضافة بطاقات حول أشياء لا تفهمها\nلن يؤدي غالبا إلّا إلى أن تعاني بتذكر البطاقات وتمل سريعا وتترك البرنامج. التعلم عملية معقدة\nلا تكفي فيها أداة واحدة، وأنكي ليس أداة سحرية.\n\n### ليس عليك صنع بطاقاتك بنفسك\n\nتتوفر على الإنترنت رزم كثيرة حول مواضيع كثيرة صنعها مستخدمون وشاركوها.\nيمكنك تحميل رزم جاهزة من [هنا](https://ankiweb.net/shared/decks/) مثلا.\nأجد الرزم الجاهزة مفيدة خصوصا لتعلم المفردات الأجنبية.\n\n### لا تعتمد كليا على الرزم الجاهزة\n\nكإضافة واجبة على النقطة السابقة: لا ينصح بالاعتماد حصريا على الرزم الجاهزة.\nتذكر البطاقات التي تصنعها بنفسك عادة ما يكون أسهل بكثير، وعملية صنع البطاقات نفسها تعد جزءا من التعلم\nلأنها تدفعك إلى التفكير باستخراج المعلومات وصياغتها على شكل أسئلة.\n\n### صياغة الأسئلة بشكل فعال مهمة للغاية\n\nهذا يقودنا إلى التشديد على فكرة أن صياغة الأسئلة بشكل فعال جزء مهم جدا من رحلتك مع أنكي.\nصياغة الأسئلة بشكل سيء سيؤدي غالبا إلى أنك ستواجه صعوبات كبيرة بالتذكر.\nهناك \"قواعد\" ونصائح عديدة لصنع البطاقات يمكننا ذكرها، لكن سأذكر فقط الأساسية منها، وهي:\n\n1. تعلم قبل إضافة بطاقات ومراجعتها: كما ذكرنا سابقا، أنكي هو برنامج مراجعة وليس حلا سحريا يجعلك تتذكر كل شيء.\n2. اجعل بطاقاتك بسيطة: يميل كثير من المبتدئين في استخدام برامج مثل أنكي إلى الوقوع في الخطأ نفسه (كما حصل معي)،\n   هو حشو البطاقات بأكبر قدر ممكن من المعلومات. هذا سيء للذاكرة والتركيز لأن\n   [الذاكرة قصيرة الأمد](https://ar.wikipedia.org/wiki/%D8%B0%D8%A7%D9%83%D8%B1%D8%A9_%D9%82%D8%B5%D9%8A%D8%B1%D8%A9_%D8%A7%D9%84%D8%A3%D9%85%D8%AF) محدودة جدا لدينا.\n   القاعدة الذهبية تقول إن كل بطاقة يجب أن تسأل سؤالا واحدا محددا يمكنك تقييمه ببساطة.\n   إذا وجدت نفسك تتردد كثيرا في تقييم بطاقة، فقد يكون هناك خطب ما في طريقة صياغتك للبطاقة (ربما معلومات كثيرة أو أسئلة غير واضحة).\n   فائدة أخرى للبطاقات البسيطة هي أنها تجعلك تجزئ المعرفة إلى قطع بسيطة يسهل عليك التعامل معها وتقييمها،\n   حيث يكون لكل «قطعة» معلومات بسيطة جدول مراجعة مختلف حسب صعوبتها، وهذا يعزز من فعالية أنكي ويوفر الوقت.\n\nهاتان القاعدتان هما جزء مما يعرف بالقواعد العشرين لصياغة المعرفة، وهي قواعد مشهورة لدى\nمستخدمي برامج بطاقات الاستذكار والتكرار المتباعد.\nيمكن قراءة القواعد [هنا باللغة الإنجليزية](https://www.supermemo.com/en/archives1990-2015/articles/20rules)،\nأو قراءة [تلخيص عربي لها هنا](./curious/#20%20%D9%82%D8%A7%D8%B9%D8%AF%D8%A9%20%D9%84%D8%B5%D9%8A%D8%A7%D8%BA%D8%A9%20%D8%A7%D9%84%D9%85%D8%B9%D8%B1%D9%81%D8%A9%20-%20%D8%A8%D9%8A%D9%88%D8%AA%D8%B1%20%D9%81%D9%88%D8%B2%D9%86%D9%8A%D8%A7%D9%83).\n\n### أنكي مفيد خصوصا للتذكر على المدى الطويل\n\nتقنية التكرار المتباعد تظهر فعاليتها خصوصا على المدى الطويل، لذلك قد تكون أقل فعالية على المدى القصير\nمن طريقة الدراسة المكثفة (cramming) التي ينتهجها كثير من الطلاب قبل الامتحانات.\nإذا كان لديك امتحان قريب جدا فالدراسة بالطريقة المكثفة الآن قد تعطي نتائج أفضل،\nلكن إذا كنت تهتم بالتعلم الحقيقي على مدى طويل، فالتكرار المتباعد أكثر فعالية.[^3]\n\nخذ هذه الصورة لبطاقة راجعتها اليوم (2021/12/08) وأضفتها في أواخر سنة 2018\nفيها الفاصل الزمني الخاص بزر «سهل» يتعدى العشر سنوات!\n\n:img{src=\"anki-card-with-large-interval.png\" caption=\"بطاقة لها فاصل زمني كبير\"}\n\nراجعت هذه البطاقة حوالي 5 مرات حتى الآن، كانت المراجعة قبل الأخيرة منذ أكثر من سنتين.\n\n## بماذا سيفيدك أنكي؟\n\nاستخدام أنكي لتعلم اللغة هو من أشهر استخدامات البرنامج. يرى البرنامج رواجا كبيرا\nأيضا عند طلاب الكليات الطبية نظرا إلى كم المعلومات التي يحتاجون إلى تعلمها.\nطبعا يمكنك استخدام أنكي لتعلم أي شيء يحتاج تذكر. شخصيا استخدمه لتعلم مواضيع مختلفة\nمن اللغات إلى الرياضيات والبرمجة والمواد المدرسية كلها والقرآن الكريم ومعلومات عامة مشتتة.\nكنت دائما أحب التعلم ولدي فضول واسع من قبل أن أعرف أنكي، لكن أنكي أعطاني نظاما جعل\nالتعلم هوية وأسلوب حياة لي.\n\nأنكي مفيد خصوصا للمعلومات التي تريد تذكرها على المدى الطويل. إنه سلاح ثمين بأيدي\nمن لديه فضول معرفي واسع ويريد التعمق في مواضيع كثيرة وبناء أساس علمي راسخ.\n\n## مصادر تحميل\n\nسأضع هنا روابط تحميل لمختلف نسخ الأنكي الرسمية أو شبه الرسمية:\n\n- برنامج الكمبيوتر مجاني يمكن تحميله من الرابط التالي: <https://apps.ankiweb.net/>\n- تطبيق الأيفون والأيباد الرسمي يدعى AnkiMobile وهو ليس مجانيا ويكلف حوالي 25 دولارا في وقت كتابة هذه الأسطر: <https://apps.apple.com/us/app/ankimobile-flashcards/id373493387>\n- تطبيق الأندرويد يدعى AnkiDroid وهو مجاني: <https://play.google.com/store/apps/details?id=com.ichi2.anki>\n\nهناك تطبيقات تعلم عديدة على مختلف المتاجر تحمل اسم Anki أو ما شابه. أغلب هذه التطبيقات\nغير رسمي ولا علاقة لها بأنكي الذي نتحدث عنه هنا سوى أنها تستغل اسمه.\n\n## استخدام أنكي على منصات مختلفة\n\nاستعرضنا هنا نسخة الكمبيوتر من أنكي، لكن كما قلنا، يتوفر البرنامج أيضا على الأندرويد والأيفون.\nاستخدام هذه التطبيقات لا يختلف كثير من ناحية مراجعة البطاقات وما إلى ذلك، لكن نسخ\nالجوال عموما لا توفر كل الميزات المتقدمة التي توفرها نسخة الكمبيوتر. لن تحتاج إلى هذه الميزات\nإذا كنت ما زلت قد تعرفت على البرنامج على كل حال.\n\nيمكنك نقل بياناتك من بطاقات وبيانات المراجعة بين أجهزتك المختلفة من خلال إنشاء حساب في موقع [AnkiWeb](https://ankiweb.net/)،\nوهو موقع مرافق للنسخ الأخرى يمكن استخدامه للمراجعة أونلاين عند عدم توفر النسخ الأخرى، ويمكن أيضا\nاستخدامه للمزامنة بين الأجهزة المختلفة. انظر [هذه الصفحة](./anki-manual/syncing.html)\nلتعليمات مفصلة حول إنشاء الحساب والمزامنة.\n\n## خاتمة\n\nكانت هذه مقالة تعريفية قصيرة حول أنكي. ما زال هناك طبعا الكثير حول أنكي واستخدامه،\nلكن سأكتفي بهذا القدر لهذه المقالة وسأضع لك مراجع إذا كنت مهتما بالغوص أكثر في الموضوع،\nكما أنوي كتابة مزيد من المقالات حول أنكي في المستقبل.\n\n## مراجع\n\n- [دليل استخدام برنامج أنكي الرسمي (مترجم)](./anki-manual): يحتوي على معلومات مفصلة لاستخدام البرنامج.\n  اقرأ قسم البدء على الأقل.\n- مجتمع أنكي العربي:\n  - [قناة Anki_arabic على يوتيوب](https://www.youtube.com/channel/UC7xKLK_qzrAg6Ue0NNsIasA)\n  - مجموعات أنكي العربية على تلجرام:\n    - <https://t.me/Anki_arabic>\n    - <https://t.me/Ankiarabic_QA>\n  - [مجموعة كتاب «الأسماء كلها» على تلجرام](https://t.me/Asmaae_Kollaha): تناقش موضوعات كثيرة متعلقة بالذاكرة والتعلم وفيها نقاش حول أنكي.\n- [كيف تتذكر أي شيء للأبد -تقريباً-](https://ncase.me/remember/ar.html): مقالة ممتعة مع رسوم تفاعلية حول التعلم الفعال.\n- [تعزيز الذاكرة طويلة الأمد - مايكل نيلسن (مترجم)]({% post_url 2021-07-11-ltm %}): ترجمة لمقالة من أفضل المقالات حول التعلم الفعال،\n  يسرد فيها الكاتب بتفصيل تجاربه مع أنكي.\n- مصادر عربية منوعة:\n  - <https://www.noonpost.com/content/23003>\n  - <https://www.arageek.com/edu/how-to-keep-information-in-memory-for-longer-duration>\n\n[^1]: الخدعة هي استخدام برنامج [RunAsDate](https://www.nirsoft.net/utils/run_as_date.html) لتغيير التاريخ الذي يراه أنكي.\n[^2]: لمراجعة غنية عن الجانب العلمي للتكرار المتباعد، انظر <https://www.gwern.net/Spaced-repetition>\n[^3]: فعالية الدراسة المكثفة على المدى القصير قد تكون من الأسباب التي تجعل كثيرا من الطلاب يفضلونها على التكرار المتباعد، حتى عندما يظهر لهم أفضلة المباعدة للتذكر الطويل. انظر المرجع السابق.\n"
    },
    {
      "title": "الأسماء كلها",
      "date": "2021-02-05",
      "tags": [
        "memory",
        "anki"
      ],
      "uuid": "9b447887-74b9-48e0-9855-f8f6f5ac2d0f",
      "redirect_from": [
        "/alasmaaekolaha"
      ],
      "lastModified": "2022-07-24",
      "id": "books/alasmaaekolaha",
      "content": "\nهذا تلخيص لكتاب «الأسماء كلها» لكاتبه أبو حامد القطان. نص الكتاب متوفر مجانًا على [قناة الكتاب على تلغرام](https://t.me/Asmaae_Kollaha)،\nأو بشكل مدفوع بصيغة PDF على موقع Gumroad من خلال الرابط التالي: <https://gumroad.com/l/RJclH>\n\n## مقدمة\n\nيتحدث الكتاب عن طرق التعلم والتذّكر الفعالة؛ موضوع أصبح لدي اهتمام كبير به مؤخرًا\nوأعتقد أننا بأمس الحاجة إليه في عصر ضخ المعلومات والتشتت المعرفي.\n\nمع كثرة الأبحاث والتجارب في هذا المجال منذ عقود طويلة، أغلب ما يطرحه الكتاب غير معروف تقريبًا بالمنطقة العربية وغير موظف بشكل كافي.\nوأعتقد أنه حتى في الأمم الأخرى بعض تقنيات التعلم الفعالة -بعضها معروف منذ أكثر من 100 سنة- لم تلقَ الرواج والاهتمام الذي تستحقه\nإلا مؤخرًا مع الانتشار النسبي لبعضها نظرًا للضرورة التي شعر بها كثيرون.\n\nمع تركيز الكتاب على توظيف التقنيات التي يتطرق إليها في تعلم العلوم الإسلامية،\nإلا أن الكاتب لم ينسَ أن ينبه أن هذه التقنيات عامة يمكن توظيفها لتعلم أي شيء تقريبًا.\n\n## الفهم أم الحفظ؟ أو لمَ خلق التعارض؟\n\nيبدأ الكتاب بمناقشة جدلية الفهم والحفظ؛ دعامتي البناء المعرفي كما يسميهما،\nويرى أن العلوم تختلف بدرجة اعتمادها على دعامة من الدعامتين على حساب أخرى،\nوأن أبرز التحديات في العملية التعليمية هي تحقيق التوازن بينهما.\n\nيناقش في هذا الصدد المذاهب الثلاث في هذا الموضوع:\nالإفراط (الاتكال على الحفظ بدرجة أكبر)، التفريط (اللامبالاة بالحفظ)، والقصد (الحل الوسط).\nيرجح الكاتب مذهب القصد طبعًا؛ لأنه يرى أن العلاقة بين الفهم والحفظ وطيدة يعضد كل منهما الآخر.\nإلا أنه يعترف بتقدم الفهم على الحفظ، وبكون الحفظ -في النهاية- خادمًا لما يستوعبه العقل يصونه من الضياع.\nثم يضرب الكاتب بعض الأمثلة عن الخلل في الموازنة بين هاتين الدعامتين،\nمثل تقديم الحفظ على الفهم أو حفظ ما يمكن الاستغناء عنه.\n\n## طرق شائعة غير فعالة\n\nيتحدث الكتاب بعدها عن أكثر طرق التعلم شيوعًا وهي تكرار المقروء عدة مرات حتى يحصل الفهم على الأقل.\nمع أن هذه الطريقة تعطي شعورًا بالمعرفة والفهم، إلا أنه شعور زائف يكتشف المرء وعوده الكاذبة\nما أن يُسأل عما تعلمه ويجد ذهنه كصندوق خاوِ في أحيان كثيرة.\nيعطي الكتاب  مثالًا عن تجربة علمية -من سيل التجارب- التي تثبت عدم كفاءة هذه الطريقة.\nويرى أن استراتيجية «القراءة السلبية» هذه فاشلة تسطح المادة المدروسة وتجعلها على مستوى واحد\nمن ناحية الفهم ومتطلباته. لكنه ينبه أيضًا إلى أن هذا لا يعني أن فكرة التكرار بعمومها غير فعالة،\nإنما هو التكرار «السلبي» والذي سيتضح اختلافه عن النوع الآخر قريبًا.\n\nيستمر الكاتب باستعراض بعض الطرق غير الفعالة، مثل طريقة التسطير والتظليل،\nوالتي يُظَن أنها طريقة تعلم! ويضرب مثالًا آخر بطريقة ما يسمى بـ«خرائط العقل»،\nوالتي هي أيضًا غير مثبتتة الفعالية، ولا تعدو كونها طريقة لإنشاء روابط بين المعلومات،\nلكنها لا تغني عن الفهم والممارسة اللتين يجب أن يكون لهما الأولوية والسبق،\nوإلا غدت هذه الطريقة خداعًا للنفس بوهم المعرفة.\n\n## طرق التعلم الفعالة\n\nنأتي الآن للسؤال المثير وهو ما الطرق الفعالة للتعلم؟\n\nيلخص الكاتب التعلم الفعال، «النشط» بثلاث أركان:\n\n1. استخراج العلم\n\n2. المباعدة بين أوقات المراجعة\n\n3. التداخل في مسائل العلم\n\nيعتقد الكاتب أن هذه الطرق صعبة وشاقة، لكن بذل الجهد ضروري لترسيخ المعرفة في العقل\nكما دلت على ذلك أبحاث كثيرة تدحض فكرة أن سهولة عملية التعلم ويسرها تعني فعاليتها.\n\n«الاستخراج» يعني محاولة استدعاء معلومة ما من الذاكرة، ومن صوره الخضوع للاختبار.\nيعطي الكاتب مثالًا عن تجربة علمية تثبت أن الاستخراج ضروري للحفظ والفهم، وأن مجرد إعادة\nالقراءة غير فعال، بل إن التفاعل والاهتمام ومعالجة المعلومة في غاية الأهمية.\nمن مظاهر التفاعل مع ما يراد تعلمه هو إعادة صياغته بصيغتك الخاصة، وهذا قد يعتبر دليلًا على الفهم.\n\nفكرة مهمة يجب أخذها بعين الاعتبار بجانب المراجعة الفعالة هي المباعدة بين أوقات المراجعة،\nوهذا على عكس ما يفعله كثير من المتعلمين (خصوصًا طلاب المدارس والجامعات قبل الامتحانات).\nالمباعدة تعني أن تراجع المادة مرة اليوم، ثم بعد ثلاثة أيام، ثم بعد أسبوع وهكذا.\nيلاحظ الكاتب أن المراجعة هي امتداد للفهم وليست شيئًا منفصلًا، فليس من النادر\nأن تكتشف أشياء جديدة في المادة المدروسة في كل مرة تراجعها فيها. فالمراجعة\nهي إذن توسيع آفاق خصوصًا إذا كانت متباعدة بحيث يكون وقتها قبل أن تنسى ما تعلمته،\nلأن عقلك سيواجه صعوبة في التذكر، ما يجعلك تتفاعل مع المادة أكثر ويقوي الترابطات\nالتي تنشئها حولها.\n\nالفكرة الثالثة، التداخل في مسائل العلم، تعني ممارسة أكثر من مجال في نطاق\nالعلم المراد تعلمه في الوقت نفسه، وعدم التركيز على باب واحد. وهذا عكس السائد.\nقد تعزى فعالية هذه الفكرة إلى أن المداخلة بين العلوم تعطي فرصًا أكثر لخلق الروابط\nبين أمور متنوعة محفزة للعقل أكثر من التركيز الأحادي الضيق على موضوع محدد.\n\nيستطرق الكاتب باختصار بعدها إلى طرق وأفكار فعالة أخرى يمكن استخدامها بجانب\nالأركان الأساسية التي ذكرنها سابقًا، مثل: محاولة الربط بين تعرفه مسبقًا وما تتعلمه الآن،\nالبحث عن أنماط عامة تسهل التعلم، التفكر وطرح الأسئلة،\nأخذ استراحة من التركيز على تعلم شيء أو حل مشكلة ما ثم العودة إليها كطريقة لتوسيع المنظور، إلخ.\n\nيتوسع الكاتب بعدها بمناقشة فكرة الحفظ وعلاقتها بالفهم وأفكار أخرى مثل الإبداع.\nيناقش فكرة أننا يجب ألا نعطي الحفظ قدرًا وأن نركز على أشياء مثل التفكير والتحليل والإبداع،\nويرد على هذا الطرح بأن كل هذه الأشياء تقوم على أساس متين من الإتقان والفهم والحفظ،\nوهي تراكمية لا تأتي بلحظة كما قد يتصور البعض.\n\nعلى صعيد آخر، يناقش الكاتب بعدها فكرة ما يسميه «الحفظ الجائر» وهو الحفظ الذي لا يرجى منه\nفائدة غير الحفظ نفسه، ويعطي مثالًا عن حفظ المتون ذات الطابع الشرعي مثل الأبيات وشروحها،\nوكيف أنها تأخذ من وقت طالب العلم الكثير بدون مردود مكافئ، ويعتقد أنه من الممكن استخراج\nالفائدة من هذه المتون بدون صرف وقت كبير على حفظها.\n\nيدعو الكاتب إلى الاقتصاد في الحفظ وينتقد فكرة تسطيح العلوم وعدم أخذ الفروقات الشخصية بعين الاعتبار عند التعلم،\nكمن يكرر أبيات من الشعر كل بيت بعدد مرات ثابت (100 مثلًا) ولا يراعي حقيقة أن بعض الأبيات قد تكون سهلة\nولا تستدعي كل هذا التكرار. يعطي الكاتب أيضًا أمثلة عملية من تجربته حول حفظ المتون ويحدد طريقتين مخصصتين\nلحفظ المتون ويشرحها بتفصيل لا داعي لتكراره هنا.\n\n## المذكرات\n\nيتطرق الكتاب بعدها إلى فكرة «المذكِّرات» (mnemonics) وهي تقنيات مساعدة على التذكر.\nالمذكرات هي تقنيات عملية قد تُبنى على المبادئ السابقة الي تطرقنا لها، وهي مفيدة خصوصًا على المدى القصير\nوليست بديلًا عن الاستحضار الفعال والمراجعة.\n\nيعطي الكاتب أمثلة عن النوعين الرئيسيين لهذه التقنيات: المذكرات اللفظية والمذكرات البصرية.\n\nباختصار، تقوم المذكرات اللفظية على فكرة استغلال خصائص لغة ما يراد تعلمه، من وزن ونغم وحروف وكلمات،\nوالربط بينها وبين كلمات ومفاهيم أخرى قد تساعد على تذكر المادة المراد تذكرها.\n\nيحشد الكاتب لهذا النوع كثيرًا من الأمثلة القيمة، لكن لنعط مثالًا ذكره الكاتب وأظن أن أغلبنا يعرفه:\n\nحروف الإخفاء مجموعة في بيت:\n\nصف ذا ثنا كم جاد شخص قد سما            دم طيبا زد في تقى ضع ظالما\n\nوهذا مثال عن المذكرات اللفظية طبعًا.\n\nلننتقل إلى المذكرات البصرية وهي أكثر فعالية من اللفظية لقدرة الإنسان المتقدمة\nعلى تذكر الصور والأشياء الملموسة أكثر من الألفاظ والمفاهيم المجردة.\n\nمثال مثير للاهتمام عن المذكرات البصرية هو ما يسمى نظام القصة، والذي يقوم على\nنسج قصة خيالية تربط المعلومة المراد تعلمها بأحداث سهلة التذكر.\nيعطي الكاتب مثالًا مسليًا عن استخدام هذه التقنية لتذكر قائمة كلمات.\nتعزز غرابة القصة والمبالغة فيها من قدرتك على تذكر القصة، لأن الإنسان بطبعه\nيميل إلى الاهتمام بالأشياء غير المألوفة.\n\nيعطي الكاتب أمثلة أخرى عن أنظمة المذكرات البصرية،\nمثل نظام الأماكن (Loci System) والذي يقوم على ربط أماكن مألوفة بالعناصر المراد حفظها،\nونظام المشابك (The Peg System) والذي هو بمثابة مزيج بين الأنظمة البصرية\nواللفظية حيث يتم الربط بين قائمة من عناصر يراد حفظها بترتيب معين مع كلمات لأشياء\nيسهل تذكرها تتناغم مع ألفاظ الأرقام، كمثال أعطاه الكاتب:\n\n```\nصفر : صقر\nواحد : والد\nاثنين : إسفين\nثلاثة : ثلاجة\n....\n```\nمهمتك هنا هي إيجاد رابط سهل التذكر بين كلمة «صقر» والعنصر الأول الذي تريد تذكره،\nونفس الشيء للعناصر الأخرى.\n\nثم يأتي الكاتب لذكر النظام الصوتي (Phonetic System أو Major System)،\nوهو نظام مخصص بحفظ الأرقام، حيث يتم ربط كل رقم أو مجموعة أرقام بحروف ساكنة،\nثم ربط الحروف الساكنة ببعضها بإضافة حروف صوتية استنادًا إلى النغم أو الشكل أو شيء آخر.\nلننقل المثال التالي من جملة الأمثلة التي يعطيها الكاتب:\n\n> مثلا لو ربطنا الرقم 3 : بحرف السين ورقم 9 : بحرف الفاء، فكلمة (سيف)\n> تدلّ عل الرقم (93)، حيث أنّ الياء اللّينة هنا ملغاة. مثلا لو أردتُ أن أحفظ\n> أنّ الصحابي أنس بن مالك -رضي الله عنه - توفّي سنة 93 ه فأتخيّل شخصا\n> أعرفه اسمه أنس يحفر قبرا بسيف. هذه المذكّرة البصريّة فيها 3 رموز:\n> - أنس: لأنس بن مالك\n> - حفر القبر: للوفاة\n> - السيف: لسنة 93 ه \n\nطور الكاتب نظامًا كاملًا لربط الأرقام بكلمات عربية سهلة التذكر نستعرضه باختصار لاحقًا.\n\n## برنامج أنكي (Anki)\n\nيتطرق الكاتب بعدها على تطبيق عملي مهم للأبحاث النظرية في مجال الذاكرة وهو برنامج أنكي.\nأنكي هو برنامج لتسهيل التذكر، مبني بشكل أساسي على فكرة التكرار المتباعد (Spaced repetition).\nالبرنامج هو عبارة عن سبورة فارغة تملؤها بما تريد تذكره، حيث تسجل المعلومات على شكل سؤال-جواب،\nويعرض عليك البرنامج هذه الأسئلة ويعطيك عدة خيارات لتقييم أدائك بنفسك. مهمة البرنامج هي أن يحدد\nالوقت المثالي لمراجعة المعلومة مجددًا بناءً على تقييمك الذاتي.\n\nينقل الكاتب بعدها بتفصيل 20 مبدئًا مهمًا لصياغة الأسئلة بصيغة فعالة.\nهذه [المبادئ](https://www.supermemo.com/en/archives1990-2015/articles/20rules) معروفة خصوصًا لمستخدمي Anki و SuperMemo (برنامج آخر يطبق فكرة التكرار المتباعد).\n\n## أنظمة مذكرات عربية\n\nطبق الكاتب تقنيات المذكرات السابق ذكرها وابتكر أنظمة عربية مفيدة جدًا ننقل أمثلة منها هنا:\n\n![نظام المشابك العربي للأرقام](/assets/images/ar-numbers-peg-system.png)\n\n![النظام الصوتي العربي للأرقام](/assets/images/ar-numbers-major-system.png)\n\n![نظام المشابك للأحرف العربية](/assets/images/ar-letters-peg-system.png)\n\n## أفكار مشاريع\n\nيستعرض الكاتب أخيرًا أفكار يدعو المهتمين للعمل عليها؛\nمثل ترجمة أدبيات الذاكرة وفنونها من اللغة الإنجليزية،\nأو برمجة تطبيق عربي مشابه لأنكي،\nأو برمجة موّلد كلمات للنظام الصوتي الذي طوره الكاتب (الفكرة التي أثارت اهتمامي)[^1].\n\n## خاتمة\n\nموضوع الذاكرة وطرق التعلم هو موضوع زاد اهتمامي به بدرجة كبيرة في السنوات الأخيرة،\nنظرًا لكثرة المجالات التي أحب التعلم عنها، ويسعدني أن هناك اهتمامًا متزايدًا (ولو ما زال ضئيلًا) بهذا الموضوع مؤخرًا في الأوساط العربية الإسلامية.\n\n## مراجع\n\n- قناة الكتاب على تلغرام: <https://t.me/Asmaae_Kollaha>\n\n- قناة أخرى تفاعلية: <https://t.me/Asmaae_Kollaha_Group>\n\n- الكتاب بصيغة PDF (مدفوع): <https://gumroad.com/l/RJclH>\n\n- مدونة عن الكتاب: <https://alasmaaekolaha.blogspot.com/>\n\n- منتديات نقاش: <https://alasmaaekolaha.freeforums.net/>\n\n- صفحة الكتاب على فيسبوك: <https://www.facebook.com/alasmaaekolaha>\n\n[^1]: [كتبت بالفعل مولد كلمات كإضافة لبرنامج أنكي](https://ankiweb.net/shared/info/616438440)."
    },
    {
      "title": "البوصلة القرآنية",
      "date": "2021-06-11",
      "uuid": "fa05828b-2ef2-4117-9d57-0de59167950a",
      "lastModified": "2022-07-21",
      "tags": [],
      "id": "books/quranic-compass",
      "content": "\nتلخيص أفكار كتاب البوصلة القرآنية لأحمد خيري العمري.\n\n## مقدمة\n\nيبحث الكتاب عن أولويات القرآن وعوامل النهضة على ضوئه، متتبعًا أثرها في وعي الأجيال الأولى عند بعثة الرسول،\nثم يدرس أسباب غياب هذه الأولويات -التي كانت بديهية- تدريجيًا من الوعي الإسلامي\nحتى أصبح الخطاب الديني السائد يمشي بعكسها حسب الكاتب.\n\n## كلمة مزلزلة تخرج من الغار\n\nبدأت دعوة الرسول في غار حراء بنزول أول كلمة في القرآن، \"اقرأ\"، كما نعرف. لم تكن اقرأ مجرد كلمة،\nبل هي أول أمر شرعي، ومبدأ ينطوي تحته سائر الخطاب القرآني. يستفيض الكاتب بالتدليل على مدى أهمية\nهذا المبدأ أولًا بتأصيل معنى القراءة الواسع، غير المحصور بالمعنى السطحي من قراءة الكتب الورقية مثلًا،\nبل الممتد إلى قراءة كتاب الكون المنشور بأكمله وسبر أغواره ودراسة الأسباب والمسببات.\nلأمية الرسول -الذي لا يقرأ ولا يكتب- هنا دلالة على هذا المعنى الواسع،\nومعاني القراءة الغنية من الناحية اللغوية أيضًا تقوي هذا الاستدلال.\n\nجاءت اقرأ كتأسيس لعلاقة جديدة بين الله عز وجل\nوالإنسان، علاقة ليست مبنية على المعجزات الحسية الخارقة لقوانين الطبيعة كما الرسائل السابقة،\nبل على تصالح مع هذه القوانين؛ علاقة مناسبة لرسالة خاتمة للبشرية جمعاء.\n\n## كيف استمر الأمر؟\n\nيتساءل الكاتب بطبيعة الحال عن أسباب قيام حضارة الإسلام والنقلة النوعية التي شهدتها جزيرة\nالعرب في فترة قصيرة: هل الأسباب مادية بحتة؟ هل هي معنوية؟ بل إنها مزيج من هذا وذاك كما كل\nظاهرة معقدة. هنا تأتي أهمية البحث التاريخي وربط القرآن -أهم مسبب للنهضة- بالتاريخ والواقع الذي نزل فيه،\nبدون إلغاء صلاحيته للحاضر، حيث القرآن نفسه يأمر بالبحث التاريخي.\n\nكرست معجزة القرآن للعقل غاية ووسيلة.\nبينما اعتمدت المعجزات السابقة على متلازمة التحدي - الإعجاز - التسليم، لم يعتمد القرآن على قود العقل وتعطيله من خلال إعجازه،\nبل اعتمد على زرع أفكار مضادة للمعتقدات الباطلة في ذهون متلقيه، واستنهض العقل مصرًا على مخطابته في ظل مطالبات المشككين بمعجزات حسية تلغيه.\nأعطى هذا طابع الاستمرارية للرسالة الخاتمة.\n\nسيأتي الاعتراض: وماذا عن معجزات الرسول الحسية إذن التي نقلت لنا؟\n\nيجيب الكاتب أن هذه الحوادث لم تكن معجزات أصلًا، إذ يغيب فيها طابع التحدي\nومعظمها حدث على مرأى أشخاص مؤمنين أصلًا. سيادة الخطاب المغيب للعقل جعلت من الضروري وجود\nمعجزات حسية لنبي، لذلك تم توظيف حوادث حقيقية وأخرى موضوعة لهذا الغرض.\n\nبحث الأولون في تحديد ماهية إعجاز القرآن في جوانب ضيقة مثل ألفاظه، لكن\nالمعجزة الحقيقية كانت الإنسان الذي نهض بحضارة بعد تفاعله مع الخطاب القرآني الذي لا يفتأ يحفزه على التفكر.\n\n## كيف فعل هذا القرآن؟\n\n### التساؤل\n\nأهم فكرة عززها القرآن هي فكرة السؤال والتساؤل، نعم التساؤل. عادة لا تكون فكرة السؤال\nبدلًا من الجواب مرتبطة بالأديان، لكن الإسلام مختلف، حيث عمد إلى استثمار طبيعة التساؤل\nفي الإنسان لتوجيهها إلى طريق صائب، على عكس الأديان السابقة التي جاءت بإجابات واضحة مغلقة\nتنهي التساؤل.\n\nأبرز نموذج أصيل يقدمه القرأن عن التساؤل هو نموذج نبي الله إبراهيم عليه السلام، أبي المسلمين،\nوصاحب المكانة العريقة عند العرب وأهل الكتاب عمومًا، في رفضه لمعتقدات قومه الوثنية\nوبحثه عمن يستحق العبادة، بدءًا بعبادته للكواكب والشمس والقمر ثم وصوله إلى فاطر السموات والأرض.\n\nلم ينته مشوار تساؤل إبراهيم هنا، إذ استمرت تساؤلاته بعد إيمانه حيث طلب من الله أن يريه\nكيف يحيي الموتى ليطمئن قلبه.\n\nثم استخدم إبراهيم السؤال كمعول هدم حين دمر تماثيل قومه إلا كبيرهم وطلب من قومه\nسؤال الصنم الكبير عمن فعل هذه الفعلة إذا كان ينطق. لقد نجح إبراهيم في زرع السؤال والشك\nفي عقول قومه.\n\nنموذج آخر هو نموذج موسى عليه السلام وسؤاله الجريء لله لرؤيته.\n\nيقدم القرآن نموذجات للتساؤل والشك الموجه المنتهي باليقين كسلوك الأنبياء، وليس الكفار كما قد يتصور البعض.\n\nكان رسولنا محمد عليه الصلاة والسلام واعيًا بمعنى التساؤل والشك القرآني، كما يظهر في حديث \"نحن أحق بالشك من إبراهيم\"،\nحيث لم يتهرب من الاعتراف بأحقيته وأمته بالشك كما شك إبراهيم.\n\nوظف القرآن أيضًا أساليب مختلفة لتركيز فكرة السؤال، منها ما يتمثل في مشاهد يوم الأسئلة العسيرة، يوم القيامة،\nوالتي لا بد أنها رسخت أهمية التساؤل في عقلية المسلم، تساؤل مع النفس في الدنيا قبل الآخرة وقبل فوات الآوان.\nقوّى من وقع فكرة التساؤل هنا أن عقيدة البعث واليوم الآخر لم تكن موجودة عند الجاهليين كما نعرف،\nولم يكن عليها تركيز كبير حتى عند أهل الكتاب، لكن القرآن أعطاها وزنًا مختلفًا وجعلها من أركان الإيمان.\n\nيقدم الكاتب أمثلة أخرى عديدة عن أساليب القرآن المختلفة في طرح التساؤل، منها ما تجسد\nفي آيات توضح قدرة الله مثل (أفلا ينظرون إلى الإبل كيف خلقت) و (أفرأيتم ما تمنون ‎﴿٥٨﴾‏\nأأنتم تخلقونه أم نحن الخالقون ‎﴿٥٩﴾)، (أفرأيتم ما تحرثون ‎﴿٦٣﴾‏\nأأنتم تزرعونه أم نحن الزارعون ‎﴿٦٤﴾‏)، إلخ، أسئلة منها ما يلفت النظر إلى أشياء معتادة لدى المخاطبين (الإبل)\nلغرض جعلهم ينظرون للأمر بطريقة مختلفة، أو أشياء تمس الجنس البشري بأسره (عملية خلقه) حيث لا مجال\nإلا أن يقف عندها ويسأل نفسه.\n\nكل ما يعج به القرآن من أمثلة تدفع إلى التساؤل تمس كل جوانب الحياة\nلا بد أنه كان له أثر على المسلمين الأوائل شكل نقلة نوعية في تفكيرهم.\n\nكان المجتمع الإسلامي الأول مبنيًا على السؤال، حتى نظام الشورى هو سلوك اجتماعي يجسد\nهذه الفكرة قبل أن يكون سياسيًا كما يتصور عادة. مثل الرسول الكريم هذه الفكرة خير تمثيل\nبما نقل لنا عن استشارته أصحابه في مختلف جوانب الدنيا، والدين حتى!\n\nلكن للأسف، التساؤل والشك أصبحا من الكلمات الممنوعة عند التيار التقليدي،\nالتيار الذي جير النصوص الدينية لخدمة الواقع بدلًا من مسائلته، فلم يستسغ هذا التيار\nأن يكون إبراهيم قد شك فنفى شكه، وذهب إلى تعليق رسولنا على هذا الشك وأوله إلى غير\nمعناه الواضح أيضًا.\n\n### البحث عن الأسباب\n\nمرحلة التساؤل الذي يهدم المعتقدات البالية ليست الأخيرة، فالتساؤل ليس هدفًا لنفسه،\nبل هو تجهيز لمرحلة البناء، مرحلة البحث عن الأسباب.\n\nيعطي القرآن مثالًا عن البحث عن الأسباب بشخصية ذي القرنين، الذي مكنه الله في الأرض\nوآتاه من كل شيء سببًا، فأتبع سببًا. يستدل الكاتب على أن الأسباب التي مكن فيها ذو القرنين هي العلم -التطبيقي-،\nمتمثلًا في استخدامه للحديد والنحاس وعلاقتهما بالمادة وخواصها عمومًا والأسباب والمسببات.\n\nيعطي الكاتب مثالًا عن \"الارتقاء في الأسباب\" في آية (أم لهم ملك السماوات والأرض وما بينهما فليرتقوا في الأسباب ‎﴿١٠﴾) [ص]\nباعتباره تسخيرًا للأسباب لخدمة البشرية والوصول إلى وحدانية الله.\n\nعزز القرآن علاقة الأسباب والمسببات والغايات أيضًا في مواضع كثيرة جدًا في خطابه،\nمنها آية (والله الذي أرسل الرياح فتثير سحابا فسقناه إلى بلد ميت فأحيينا به الأرض بعد موتها ۚ كذلك النشور) [فاطر]،\nدل فيها على علاقة سببية لها أثر على حياة الإنسان، ووضح غايتها ليأكد على الدور الإلهي فيها حيث كل شيء يبدأ عنده.\n\nيذهب الكاتب بعدها إلى مفهوم العقل في القرآن ودلالاته. يلاحظ هنا أن لفظة \"عقل\"\nلم تأت في القرآن إلا في صيغة فعل، ويستدل بهذا على أن مفهوم العقل مختلف عن المفهوم الفلسفي اليوناني\nالذي يتصور العقل كقانون كلي أو كيان مستقل، ومختلف أيضًا عن المفهوم الذي كان سائدًا عند العرب الأقرب من كونه صفة خلقية حميدة\nقريبة للمروءة. بل جاء القرآن ليرسخ مفهومًا جديدًا للعقل معتمدًا على المعنى اللغوي الأصلي لكلمة عقل، وهو الربط.\n\nجاءت لفظة العقل في مواضع تصف آيات خلق الله الطبيعية وغاياتها، وكانت عبارة \"لعلكم تعقلون\"\nالمتكررة دعوة للربط بين الأسباب والمسببات لنفهم الغايات ونصل إلى مآل هذا كله.\nكما جاء في آية (هو الذي خلقكم من تراب ثم من نطفة ثم من علقة ثم يخرجكم طفلا ثم لتبلغوا أشدكم ثم لتكونوا شيوخا ۚ ومنكم من يتوفى من قبل ۖ ولتبلغوا أجلا مسمى ولعلكم تعقلون ‎﴿٦٧﴾‏) [غافر].\n\nالعقل القرآني بجوهره هو أداة تبحث في الظواهر وتربط بين الأسباب والمسببات، ولا ينحصر\nمجال عمل هذه الأداة في الظواهر الطبيعية فقط، بل يمتد إلى ما أسهب الخطاب القرآني في ذكره من\nأحوال الأمم السابقة وزوالها، حيث يعطي دروسًا وعبر عن علاقات سببية تمس المجتمع البشري عن قرب أكثر.\n\nيتمد أيضًا مجال العقل إلى كون آخر، كون أكثر قربًا وغموضًا حتى، وهو النفس البشرية،\nحيث يعج القرآن بآيات تدعو إلى مراقبة النفس ومساءلتها وتوضح سبل الهدى المبنية على\nعلاقات سببية (إن الله لا يغير ما بقوم حتى يغيروا ما بأنفسهم).\n\nأسس القرآن لتسلسل مكون من الطبيعة، والمجتمع، والفرد، تسلسل متداخل بمبدأ السببية،\nحيث لا يكون البحث في أسباب الطبيعة إلا من خلال نفس واعية، ولا تكون هذه النفس إلا نتيجة مجتمع متغير.\n\nلكن كما حدث مع مبدأ التساؤل، فقد تصدت الرؤية السائدة لمبدأ الأسباب عقائديًا وفقهيًا.\nبدأ الأمر من السياسة في التاريخ الإسلامي المبكر وتكريس بعض السلطات لمسألة الفعل الإلهي والجبر\nالذي استغل لتبرير الظلم والاستبداد. لم يقف الأمر عند السياسة، فقد تدرج إلى أن طال\nالحياة الشخصية للأفراد وتغلغل في معتقداتهم وانسحب أيضًا على الطبيعة وظواهرها ونفى\nالبعض مبدأ السببية كليًا.\n\nمن العلماء الذين أنكروا مبدأ السببية هو الإمام أبو حامد الغزالي، حيث أنكر أن تكون\nهناك علاقة ضرورية بين السبب والمسبب، فالنار لا تحرق والماء لا يروي العطش، وإنما\nكل شيء يجري مجرى العادة، كان ممكن أن يكون أو ألا يكون.\nيلاحظ الكاتب أن إنكار السببية يلغي معنى المعجزات التي دافع عنها الغزالي في كتابه\n(تهافت الفلاسفة): \"فما المعجز في كون النار لم تحرق إبراهيم إذا كانت لا تحرق حتى القطن؟\".\nبينما كانت المعجزة في القرآن مرتبطة بمبدأ السببية، حيث هي اختراق وتحدي له.\nيستعرض الكاتب أيضًا اعتراضات ابن رشد وابن تيمية على إنكار السببية، ويلاحظ أن مذهب\nاللاعقل، مذهب إنكار السببية، قد انتصر في النهاية وساد على الأمة.\n\n### الإيجابية\n\nيمكن اختصار ما أحدثه القرآن في نفوس متلقيه في كلمة واحدة: الإيجابية؛\nالرغبة في التفاعل مع العالم المحيط وتغييره بدءًا بالنفس.\n\nنهضة الجزيرة العربية في فترة قصيرة كانت لها أسبابها المادية طبعًا (ضعف القوتين العالميتين\nالمسيطرتين معًا آنذاك؛ الفارسية والرومية) لكنها لا تكفي لتفسير مغزى المعجزة التي حصلت.\n\nأوصل القرآن فكرة الإيجابية من خلال قصة أيضًا، هذه المرة قصة تخاطب رسولنا بصيغة أقرب،\nإنها قصة صاحب الحوت يونس. وردت القصة في فترة مبكرة من دعوة الرسول كأول قصة لنبي لتثبت فؤاده في\nفترة لا بد أنه كان يعاني فيها مما عاناه صاحب الحوت من يأس من تكذيب قومه: (فاصبر لحكم ربك ولا تكن كصاحب الحوت إذ نادى وهو مكظوم ‎﴿٤٨﴾) [القلم].\n\nفر يونس من قومه يأسًا لكنه اصطدم بالقيم الجاهلية نفسها التي كان يحاربها\n(استخدام فكرة مثل القرعة لتحديد الشخص الذي يجب أن يطرح من السفينة)،\nإذ لا مفر من مواجهة الأفكار. وكان الحوت الذي التقمه رمزًا لكل مفاهيم الظلم البشري،\nحيث القوي يأكل الضعيف اليآس المستسلم لواقعه كما يلتهم الحوت السردين.\nتراءى ليونس هنا أنه ليس الجلاد ظالمًا فحسب، بل الضحية ظالمة باستسلامها للجلاد:\n(وذا النون إذ ذهب مغاضبا فظن أن لن نقدر عليه فنادى في الظلمات أن لا إله إلا أنت سبحانك إني كنت من الظالمين ‎﴿٨٧﴾‏) [الأنبياء].\nخرج يونس من بطن الحوت برؤية جديدة فعالة، كيقطين مثمر (وأنبتنا عليه شجرة من يقطين)، جعلته يؤمن\nبجدوى العمل وإمكانية التغيير.\n\nمر رسولنا بما مر به يونس من محاربته مفاهيم قومه الجاهلية، وكان من الممكن أن يلتقمه حوت\nمن نوع آخر أيضًا. كان هذا في فترة مبكرة جدًا من الدعوة وفترات لاحقة. لا بد أن الرسول ربط بين تجربته وتجربة\nيونس، حيث نقل لنا عنه أنه قال مثلًا: (لا يقولن أحدكم إني خير من يونس).\n\nتتعارض هذه النظرة الإنسانية إلى النبي مع الرؤية التقليدية التي تستنكر أن يصدر من الرسول\nما يوحي بالتردد والحيرة.\n\nينتقل الكاتب بعدها إلى تقديم إسقاط معاصر للحوت: حوت العولمة والحضارة الغربية التي\nتفرض نفسها على المجتمعات بقوة الإعلام والسلاح، وتركض مجتمعات أخرى إلى تقليدها، وتفاعل الفرد المسلم\nمع هذا الحوت من أحاسيس يأس من محاولة التصدي والمجابهة.\n\nيتوسع الكاتب بعدها في أسباب نهوض حضارة جزيرة العرب ذات الظروف القاسية ودور الظروف الصعبة في استفزاز البناء\nالحضاري. لكن ما الذي منع العرب من النهوض كل هذا الوقت قبل نزول القرآن؟ إنه سلبيتهم، استسلامهم للظروف.\nتمثلت هذه السلبية في جوانب عدة منها احتقارهم للعمل اليدوي وحصر أنفسهم في عملين: الرعي والتجارة.\nوهي أعمال درت على العرب أرباح كثيرة بدون عمل حقيقي ذي معنى اجتماعي حسب الكاتب. ساعدتهم\nظروف مثل موقع الجزيرة العربية الاستراتيجي في التجارة، ومعجزة حيوان الإبل الصبور في الرعي ونواحِ شتة.\n\nثم استجد شيء ما في جزيرة العرب: إنه القرآن الكريم.\n\nتصدى الخطاب القرآني لسلبية العرب بطريقة دقيقة بتكرار عبارات تبدو عادية لنا لكنها\nقد تكون حملت معنى خاصًا للجاهلي، عبارات مثل \"ما كسبت أيديكم\" مثلًا، أتت في سياق\nالثواب والعقاب بسبب ما عملت هذه الأيدي. كان هذا صادمًا لمجتمع معتمد على مفاهيم مثل\nالمفاخرة بالحسب والنسب. ثم جاء أيضًا كلام القرآن عن تكلم الأيدي (تكلمنا أيديهم) وربطه بضرورة الشكر.\nألفاظ أخرى استخدمت على هذا الصعيد هي \"الفلاح\" (قد أفلح المؤمنون) و\"الحرث\"، والمرتبطتين بالزراعة طبعًا، والتي كان يحتقرها العرب.\nاستخدام الفلاح والحرث وتصوير ثمار الجنة وزرعها كان له أثر في تغيير النظرة للعمل اليدوي تدريجيًا.\n\n#### إيجابية التوحيد\n\nالتوحيد بمفهومه الواسع هو مفهوم إيجابي استخدم لمحاربة السلبية أيضًا، فما يبدو لنا\nكمفهوم مجرد مكون من مجموعة أوامر ونواهي مثل الاعتقاد بالله إلهًا واحدًا وعدم عبادة الأوثان\nوالامتناع عن الذبح لغير الله.. إلخ، استخدم لمحاربة ظواهر اجتماعية  والتحرر منها لإنشاء تغيير\nجذري في بنية المجتمع. فتمسك العرب بعبادة الأوثان لم يكن نابعًا من إيمان وعقيدة، بل عن\nتمسك بقيم اجتماعية واقتصادية. فمثلًا التخلي عن الأصنام المتعددة بتعدد القبائل كان بمثابة\nتخلي عن خضوع العربي لبيئته، وإلغاء نظام القرابين المعقد -المعتمد على مصالح تجارية- كان\nإلغاءً لطبقة الكهنة. لكن أقسى قطيعة أمرت بها عقيدة التوحيد هي إلغاء سلطة الماضي متمثلة\nفي الآباء والإرث والتراث من دم ونسب وتاريخ. ينقل لنا القرآن مشاهد كثيرة من احتجاج الجاهليين\nبما وجدوا عليه آباءهم وتمسكهم به وتصدي القرآن لهذا الفكر، مثّل الرسول هذا في قوله\n\"إن أبي وأباك في النار\" والتي قصد بها القطيعة مع الماضي.\n\n#### متلازمة الإيمان والعمل الصالح\n\nوظف القرآن متلازمة (الذين آمنوا وعملوا الصالحات) المتكررة كثيرًا لرفع مكانة العمل لدرجة تضاهي الإيمان نفسه.\nيستدل الكاتب من نزول معظم مرات ورود هذه المتلازمة في الفترة المكية، فترة اضطهاد المؤمنين ومحاربة إيمانهم قبل عملهم،\nعلى أن هذه المتلازمة هي بمثابة تفسير لماهية الإيمان الحقيقي.\nقدم القرآن مفهومًا جديدًا للعمل الصالح كمجال اجتماعي مفتوح له أجر أخروي مقابل الرؤية\nالجاهلية للعمل من كونه فرديًا وآنيًا ومعتمدًا على مفاهيم الفخر والجاه.\n\n#### يدا الله\n\nأكبر ضربة وجهها الخطاب القرآني لمفاهيم الجاهلية المحتقرة للعمل اليدوي هي إعطاء صورة الإله الذي يعمل بيديه (بعيدًا عن التشبيه):\n(لما خلقت بيدي)، (مما عملت أيدينا)، إلخ.\n\n#### دلالات من هود وأخواتها\n\nيأتي الكاتب هنا إلى استخراج دلالات قول الرسول \"شيبتني هود وأخواتها\" (سور هود ويوسف ويونس).\nنزلت هذه السور في فترة مكية متأخرة زاد فيها ضغط قريش على المؤمنين.\nنقلت لنا سورة هود صورة النبي نوح ومناجاته لابنه الكافر لكي يصعد معه بالسفينة ورؤية نوح لهلاك الآخر.\nلا بد أن رسولنا استشعر هذه الصورة المفجعة على تجربته هو مع تكذيب أقربائه بدعوته.\nكما أنه قارن بين تشابه حالة قومه والأقوام السابقة التي هلكت بعد تكذيبها برسلها،\nوالتي نقلت لنا سورة هود من قصصهم العديد. كان الرسول يتساءل بقلق عن مصير قومه حتى\nجاءت آية (وانتظروا إنا منتظرون [122]) [هود] لتعزز من مخاوفه.\n\nلكن فجأة نزلت سورة يوسف لتقلب المعادلة، سورة ليس فيها وعيد أو شيء من هذا القبيل،\nبل قصة حلم طفولي يتحقق بعد فترة يأس تبعتها إيجابية. غيرت هذه السورة تفكير الرسول\nلكي يؤمن أن هناك طريقا آخر غير العذاب الإلهي، طريق النجاح والتمكين في الأرض، ربما\nفي أماكن أخرى خارج مكة كما حدث ليوسف في مصر.\n\n#### نبتة الصبر القرآنية\n\nالصبر هو أيضًا مفهوم مصبوغ بالإيجابية يمكن استخراجها بدءًا من معناه اللغوي\nالمشتق من نبتة الصبار وتحملها للظروف القاسية إلى سياقاته القرآنية التي تؤسس لهذا\nالمفهوم الإيجابي من خلال قصص أولي العزم من الرسل. إنه صبر العمل والتغيير، وليس صبر الخنوع\nوالاستسلام للواقع كما يروج له.\n\n#### مشيئة الفرد\n\nكان مجتمع الجزيرة العربية مبنيًا على العلاقات القبلية لا مكان للفرد وإرادته فيه.\nحارب الخطاب القرآني مفاهيم تلغي الفردية بتأكيده مرارًا وتكرارًا على مشيئة الفرد وإمكانيته\nالاختيار (من شاء فليؤمن ومن شاء فليكفر).\n\nلكن القرآن أيضًا أكد على مشيئة الله المطلقة المهيمنة على غيرها... هل من تعارض؟\nلا. إنما مشيئة الفرد مرتبطة ومنطوية تحت مشيئة الله لا تتعارض معها (ما تشاؤون إلا أن يشاء الله).\nاستمدت مشيئة الفرد **المؤمن** إيجابية وقوة من صفات الله عز وجل مطلقة الإيجابية من عدل وخير.. إلخ.\n\n#### تعامل الرؤية السائدة مع قول رسولنا حول يونس\n\nتعاملت الرؤية السائدة مع قول رسولنا (لا يقولن أحدكم إني خير من يونس) كتعاملها مع\nتعليقه على شك إبراهيم: بالتأويل وإنكار أن يوحي الرسول أنه ببشريته وإمكانية إظهاره الضعف.\n\nالرؤية السائدة تنفي العصمة عن الأفراد نظريًا لكنها عمليًا تطبق العكس حتى على من\nهم دون الأنبياء من الصحابة والأئمة والعلماء. بينما مثل لنا الرسول صورة مختلفة، صورة\nإنسانية يمكن الاقتداء بها.\n\n#### اختزال الإيمان والعمل الصالح\n\nتعرضت ثنائية الإيمان والعمل الصالح إلى عملية اختزال جعلت مفهوم العمل يركز على\nالشعائر والطقوس والأركان بالذات مجردة من أبعادها الاجتماعية التي رسخها الخطاب القرآني.\nبدأ الأمر من السياسة وتبرير أخطاء الأمراء والسلاطين ما داموا يؤدون الشعائر.\n\n#### الحياد السلبي في مسألة القدر\n\nوسط المذاهب المتطرفة في مسألة القدر (القدرية والجبرية)، حاولت النظرة التقليدية\nاتخاذ موقف وسطي بالتوفيق بين النصوص، وكان هذا صعبًا مع مؤسسة تمارس تأؤيلاتها\nمن نصوص مجتزأة ورؤية غير شاملة.\n\nكان عرب الجاهلية أقرب إلى مذهب الجبرية كما نعرف بشكل صريح من آيات قرآنية (لو شاء الله ما أشركنا ولا آباؤنا ولا حرمنا من شيء).\n\nفهم مسألة القدر في القرآن يجب أن يكون بطريقة شمولية ضمن سياقات الآيات.\nفشلت الرؤية التقليدية بتوفير شرح مفهوم لمسألة في غاية الأهمية تمس كل فرد بسبب\nغرقها وسط مصطلحات وتعريفات فلسفية بعيدة  عن روح القرآن ورغبتها الأساسية في الرد على الفرق الأخرى وليس\nالتحقيق العلمي.\nنتج من هذه الرؤية الغامضة إنسان متواكل يبرر تخلفه بالقدر.\n\n#### ماذا حل بالصبر\n\nتحول الصبر أيضا من مفهوم إيجابي لتغيير الواقع الذي يجب تغييره إلى أداة للاستسلام له وتحمله.\n\n### الحس المقاصدي\n\n#### تشتت مفاهيم جزيرة العرب\n\nكانت جزيرة العرب في حالة تشتت على كافة الأصعدة الاجتماعية والسياسية والعقائدية.\nنشأ من هذا التشتت فرد لا رؤية واضحة له ولا يعرف غاية وجوده. وكان غياب قصة الخلق\nمن عقائد الجاهليين انعكاسًا لهذا التشتت وغياب المعنى.\nلم تكن عقيدة الشرك مجرد عبادة أوثان أو عدة آلهة فقط،\nبل كان لها تداعيات اجتماعية مدمرة كما قص علينا القرآن، جاءت عقيدة التوحيد لتعطي\nالإنسان طريقًا واحدًا يسير عليه.\n\n#### قصة الخلق القرآنية\n\nكانت قصة الخلق القرآنية متميزة عن غيرها حتى مقارنة بالقصة التوراتية، فقد أوردت\nتفاصيل أعادت بناء رؤية الإنسان لنفسه: سجود الملائكة للإنسان وخلافته\nفي الأرض. شكل هذان التفصيلان رؤية جديدة ترفع من قدر الإنسان وتعطي له مكانة مميزة\nعن غيره من خلق الله.\n\nللاستخلاف معانٍ واسعة تقوم على إحقاق الحق وتجسيده في كل فعل.\nقدم القرآن شرطين للاستخلاف في الأرض: الإيمان والعمل الصالح.\nلا تتعارض أهمية الاستخلاف مع كون هدف خلق الله للإنسان هو العبادة (إلا ليعبدون)،\nفالعبادة مفهوم واسع لا يقتصر على الشعائر.\n\n#### بقرتنا التي لا نكاد نذبحها\n\nيرسم الكاتب مقارنة بين بقرة بني إسرائيل التي أمرهم الله بذبحها لكنهم خاضوا في تفاصيل\nغير مهمة وبين وضعنا مع تفاصيل العبادات وكثرة خلافاتنا وجدلنا حولها لدرجة نسيان المقصد.\n\nجاءت قصة البقرة في السورة التي تحمل الاسم نفسه وجاء فيها تشريع لشعائر وحدود عديدة.\nكانت هذه إشارة إلى الاهتمام بالمقاصد وعدم إهمالها مع الغرق بالتفاصيل.\n\n#### مقاصد العبادات\n\nيأخذ الكاتب شعيرة الصلاة كمثال عن مقاصدية العبادات في الإسلام.\nالصلاة عبادة مطبوعة بطابع اجتماعي حتى لو صلاها المرء فردًا (فهو يتحدث بها بصيغة الجمع)،\nإنها عبادة بمواقيت محددة تجعل المجتمع في حالة مراقبة واستحضار دائمة تنهاه عن الفحشاء\nوالمنكر.\n\n#### فقه عمر المقاصدي\n\nيأخذ الكاتب عمر بن الخطاب كمثال عن شخص وعي مقاصد القرآن بشكل ممتاز لدرجة أنه\nوافق حكم القرآن قبل نزوله عدة مرات. كان هذا ناتجًا عن رؤية عمر الشمولية للنصوص ومقاصدها وسياقاتها.\n\n#### القراءة المقاصدية للنصوص\n\nلم يحظ فقه المقاصد بكثير من العناية في الفكر الإسلامي للأسف، وحتى المصادر الأساسية،\nالقرآن والسنة، عوملت بطريقة تعتبر كل نص متساويًا مستقلًا عن الآخر منفصلًا عن الواقع والسياق والمقصد.\nنتج عن هذا أن صار متقبلًا أن تنسخ السنة القرآن مثلًا لغياب الآلية الاستقرائية التي تربط بين النصوص\nحسب سياقاتها ومقاصدها. الفهم المقاصدي ينطلق من أساسيات الخطاب القرآني ويعرض النصوص عليها، سواء\nنصوص قرآنية أخرى أو نصوص نبوية. يقدم الكاتب مثالًا عمليًا عن الفرق بين الرؤيتين حول حكم الاقتصاص\nمن مسلم إذا قتل كافرًا مسالمًا.\n\n#### آلية القياس وتعريف العلة\n\nارتباط آلية القياس المباشر بالرؤية التجزيئية منعه من أن يكون أداة مقاصدية فعالة.\nيمكن تمثيل هذا الارتباط بالخلاف على مسألة العلة وتعريفها وما إذا كانت العلة موجبة للحكم،\nوالذي كان بدوره امتدادًا لخلاف عقائدي مرتبط بعدة مسائل أكبرها مسألة التخيير والتسيير الجدلية بامتياز.\n\nنهاية، تم نفي المقاصد كما تم نفي الأسباب من قبل البعض.\n\n#### ضرورة التجديد\n\nيعطي الكاتب أمثلة عن أحكام شرعية معتمدة على نصوص قد يختلف الحكم فيها\nإذا أسقطناها على واقعنا المعاصر ومقاصد القرآن، دون أن يعني هذا إلغاءها، بل قراءتها\nقراءة شمولية، ويشدد على أن التجديد لا يعني التفلت.\n\n## كيف انتهى الأمر؟\n\n### بداية الانتكاسة\n\nكانت هناك لحظات انتكاسة في تاريخنا الإسلامي ما زال لها تأثير حتى يومنا هذا.\nساعد هذه اللحظات في بسط تأثيرها ضعف المفاهيم الإيجابية المضادة واستمرارها.\nتغلغلت هذا اللحظات السلبية باستغلالها الدين من أجل السياسة.\n\nبدأ هذا كله من \"فكر الطلقاء\"، المرتبط بالمؤلفة قلوبهم الذين عفا عنهم الرسول وأسلموا عند\nفتح مكة. كانت مرتبة الطلقاء في ذيل مراتب المجتمع الإسلامي وكانت سلطتهم ضعيفة إلى\nأن اغتيل الخليفة عمر وحصل الخلاف في موضوع اختيار الخليفة بين علي وعثمان حتى\nوقع الاختيار على عثمان. لم يتم استثمار فكرة الشورى أكثر في عهد عثمان وتمكنت \"القرابة الأموية\"\nمن استغلال صفات عثمان الإيجابية غير الصارمة لزيادة سلطتها. ثم اشتد الأمر وحصلت الفتنة وصعد معاوية بن أبي سفيان إلى الحكم.\n\nيناقش الكاتب هنا الاعتراضات المعتادة عن الخوض في أحداث الفتنة وما حصل بين الصحابة.\nويرى أن الحساسية في هذا الموضوع لا داعي لها، فالقرآن يدعونا لتقصي الحقائق والقوامة بالعدل حتى\nعلى أنفسنا، كما أن البحث في المسألة لا يمكن استغلاله من قبل \"الطرف الآخر\" (الشيعي)\nلانتقاد فترة أبي بكر وعمر ما دام محل المسألة هو الفترة الأموية التي كانت نكسة مقارنة \"بالمعيار\" الذي\nهو الفترة الراشدة عند أهل السنة.\n\nيدخل الكاتب هنا حقل الألغام ويبدأ من فكرة \"الجبر السياسي\" والتي هي امتداد للجبر الجاهلي،\nوالذي أعاد إحياءه فكر الطلقاء متجسدًا في معاوية. يستشهد هنا بعدة أحداث تاريخية معتمدًا على مصادر موثوقة\nمثل صحيح البخاري، منها حادثة لمعاوية مع ابن عمر حيث تكلم معاوية عن \"حق\" له بالخلافة على حساب الجميع،\nوحادثة أخرى عن دعاء نبوي وظفه معاوية لترسيخ فكرة أن سلطته عطية إلهية لا مانع لها.\nتمكنت السلطة من سلب المجتمع المسلم المرهق من الحرب الأهلية من إيجابيته تدريجيًا،\nمن خلال قوة السيف واستغلالها لنصوص مقدسة مجتزئة.\n\nيشدد الكاتب على أن الهدف من نقاش المسألة ليس تجريم شخوص معينة مثل معاوية بالتحديد.\nمجرد الأمر هو أن تلك الفترة كانت آثارها السلبية أكثر من الإيجابية وكانت بداية الانحطاط والاستبداد\nالذي استمر واشتد أكثر بعد فترة معاوية لدرجة أن أغلب من أتى بعده كان أسوأ منه.\nكما أنتجت كل هذه الأحداث، خصوصًا خصومة معاوية وعلي ابن أبي طالب وسب الأخير على منابر الأمويين،\nغلوًا مضادًا تضخم تضخمًا نرى آثاره اليوم.\n\nكانت أكبر انتكاسة لتلك الفترة أنها كانت بداية قتل أسس الخطاب القرآني:\nالتساؤل بالاستبداد، الإيجابية بالجبر، الحس المقاصدي باجتزاء النصوص لغير مقاصدها.\n\n### مشروع النهضة\n\nيقدم الكاتب هنا قراءة لسورة الكهف بوصفها سرد لمراحل مشروع النهضة وتشكل الأفكار\nونموها لتشكل ثورات.\nففتية الكهف هم بمثابة الجيل اليافع الذي يرى أخطاء مجتمعه ويؤمن\nبفكر جديد نقي، لكن هذا الفكر غير مؤهل بعد لمواجهة مؤسسات المجتمع القائمة، لذلك\nعلى أصحابه أخذ قرار الاعتزال إلى حين أن يأتي موعد سطوعه.\n\nيمكن فهم قصة الرجل المؤمن والرجل الكافر أيضا كامتداد لفتية الكهف ومرحلة إيمان أكثر\nنضجًا وتحديدًا للثوابت ومرحلة مواجهة الفكر المضاد.\n\nبعد مرحلة البناء النظري تأتي مرحلة الانطلاق إلى الواقع متجسدة في قصة موسى والعبد الصالح.\nكانت الأحداث التي مروا بها تمثيلًا لرؤيتين مختلفتين: الرؤية التجزيئية التي تأخذ الأمور كما هي،\nوالرؤية الشمولية التي تنظر إلى ما وراء المرئي بالنظرة السطحية.\n\nثم تأتي مرحلة الذروة، مرحلة التمكين متجسدة في ذي القرنين وقوته المستمدة من الأخذ بالأسباب\nورؤيته المتوازنة للواقع. كانت الحضارات التي زارها ذو القرنين أيضا تجسيدات لقيم يمكن إسقاطها\nعلى واقعنا.\nكانت حضارة العين الحمئة رزمًا لكل الحضارات التي قد تكون قوية ماديًا لكنها على حافة الانحطاط الأخلاقي.\nكان محور تواصل ذي القرنين مع هذه الحضارة هو فكرة الثواب والعقاب.\nعلى الجانب الآخر، هناك حضارة مطلع الشمس، رمز الحضارات الناشئة في فترة التكوين، والتي لم يكن هناك\nمحور تواصل لذي القرنين معها لانعدام الاستقرار وعدم تطور آليات الحضارة فيها بعد.\nثم هناك حضارة في المنتصف، حضارة عزلت نفسها عن العالم الخارجي ومعادلة الحضارة، إنهم يأجوج ومأجوج.\nفقدت هذه الحضارة مقومات التواصل مع الحضارات الأخرى لانعزالها على نفسها حفاظًا على ما لديها.\nكانت تسمية \"يأجوج ومأجوج\" إشارة إلى النشاط الداخلي غير المثمر في نفوس أفراد هذه الحضارة.\n\nحكاية ذي القرنين هي تذكير لنا بمبادئ النهضة وما نفتقده منها، مبادئ إنزال الفكر على أرض الواقع\nوإثبات صلاحيته حتى يتم التمكين.\n"
    },
    {
      "title": "خوارزمية الترتيب بالعد",
      "date": "2021-08-19",
      "tags": [
        "computer",
        "algorithms"
      ],
      "uuid": "a60601fa-4103-4573-8d99-d7f57c05009a",
      "lastModified": "2022-07-21",
      "id": "counting-sort",
      "content": "\nخوارزمية الترتيب بالعد هي [خوازمية ترتيب](https://ar.wikipedia.org/wiki/%D8%AE%D9%88%D8%A7%D8%B1%D8%B2%D9%85%D9%8A%D8%A9_%D8%AA%D8%B1%D8%AA%D9%8A%D8%A8)\nللأعداد الصحيحة.\n\nترتّب الخوارزمية مصفوفة أعداد عن طريق إحصاء مرات تكرار كل عدد وتخزن هذه المعلومات\nفي مصفوفة جديدة (لنقل لها مصفوفة الإحصاء). ثم تحسب موضع كل عنصر\nمن مصفوفة المدخلات في مصفوفة المخرجات المرتبة باستخدام مصفوفة الإحصاء.\n\nمع أن الخوارزمية متخصصة بالأعداد الصحيحة، يمكن تكييفها لترتيب مصفوفة من أي نوع من البيانات\nما دام لكل عنصر عدد صحيح متعلق به يمكن استخدامه كـ\"مفتاح\" وترتيبه.\n\n## مثال\n\nلنأخذ مثالا لتوضيح كيفية عمل الخوارزمية بتفصيل أكثر:\nلنقل أننا نريد ترتيب سلسلة الحروف \"the quick brown fox jumps over the lazy dog\"\nتصاعديا حسب قيم [ASCII](https://ar.wikipedia.org/wiki/%D8%A3%D8%B3%D9%83%D9%8A) العددية لحروفها.\n\nسترتب الخوارزمية هذه السلسلة بهذه الخطوات:\n\n1) نبدأ بحساب نطاق المفاتيح (الفرق بين أكبر وأصغر عنصر، لنسمه `range`) في مصفوفة الحروف لكي نستطيع\n  حجز مساحة كافية لمصفوفة الإحصاء (لنسمها `count`). كما نبحث عن أصغر مفتاح أيضا لكي نستخدمه في فهرسة\n  مصفوفة الإحصاء مع السماح بمفاتيح لا تبدأ بالصفر (نستخدم `count[key - offset]`\n  للوصول إلى عدد مرات تكرار العنصر صاحب المفتاح `key` حيث `offset` هو أصغر مفتاح).\n  سنحصل على القيم التالية بعد معالجة سلسلة الحروف: `offset = 32` و `range = 91`.\n  تأكد من أن هذه القيم صحيحة بنفسك باستخدام [جدول ASCII الموجود في هذه الصفحة](https://ar.wikipedia.org/wiki/%D8%A3%D8%B3%D9%83%D9%8A#%D9%82%D8%A7%D8%A6%D9%85%D8%A9_%D8%A7%D9%84%D8%B1%D9%85%D9%88%D8%B2)\n  (لا تنسَ أخذ حرف المسافة بعين الاعتبار).\n\n2) نملأ الآن مصفوفة الإحصاء بمرات تكرار كل مفتاح لنحصل على مصفوفة بهذا الشكل:\n{% highlight plaintext %}\ni:        0 1 2 ...  65  66  67  68  69  70  71  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89  90\ncount[i]: 8 0 0 ...   1   1   1   1   3   1   1   2   1   1   1   1   1   1   4   1   1   2   1   2   2   1   1   1   1   1\n{% endhighlight %}\n\n3) لكل فهرس `i` في مصفوفة الإحصاء، نجري العملية `count[i] += count[i - 1]`.\n  بعد هذا، سيحمل `count[i]` الفهرس الأكبر بواحد من فهرس آخر عنصر بمفتاح `i + offset`\n  في المصفوفة المرتبة النهائية. ستصبح مصفوفة الإحصاء بهذا الشكل الآن:\n{% highlight plaintext %}\ni:        0 1 2 ...  65  66  67  68  69  70  71  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89  90\ncount[i]: 8 8 8 ...   9  10  11  12  15  16  17  19  20  21  22  23  24  25  29  30  31  33  34  36  38  39  40  41  42  43\n{% endhighlight %}\n\n4) نفحص سلسلة الحروف مجددا، لكن هذه المرة من آخرها إلى أولها (لضمان [الثبات](https://ar.wikipedia.org/wiki/%D8%AE%D9%88%D8%A7%D8%B1%D8%B2%D9%85%D9%8A%D8%A9_%D8%AA%D8%B1%D8%AA%D9%8A%D8%A8#%D9%85%D9%85%D9%8A%D8%B2_%D8%A7%D9%84%D8%AB%D8%A8%D8%A7%D8%AA)).\n  نستخرج مفتاح كل عنصر، وننقص عداد العنصر الموجود في مصفوفة الإحصاء بواحد،\n  ثم نخزن العنصر في موقعه الجديد في المصفوفة المرتبة باستخدام عداده في مصفوفة الإحصاء.\n  بـ[السودوكود](https://ar.wikipedia.org/wiki/%D8%B3%D9%88%D8%AF%D9%88%D9%83%D9%88%D8%AF) كما هو معطى في [ويكيبديا الإنجليزية](https://en.wikipedia.org/wiki/Counting_sort#Pseudocode):\n{% highlight plaintext %}\nfor i = length(input) - 1 downto 0 do\n    j = key(input[i])\n    count[j] -= 1\n    output[count[j]] = input[i]\n{% endhighlight %}\n\n5) لقد انتهينا! لدينا الآن سلسلة حروف مرتبة:\n{% highlight plaintext %}\n'        abcdeeefghhijklmnoooopqrrsttuuvwxyz'\n{% endhighlight %}\n\nمن ميزات هذه الخوارزمية أنها لا تعتمد على مبدأ المقارنة بين العناصر المراد ترتيبها المستخدم\nبشيوع في خوارزميات ترتيب عديدة مثل Quicksort و Merge sort وغيرها.\nهذا لأنها مخصصة لترتيب الأعداد الصحيحة والتي يمكن معاملتها كفهارس (indices)\nوإيجاد ترتيبها الصحيح بدون الحاجة للمقارنات. تمنح هذه الميزة للخوارزمية\n[تعقيدا زمنيا خطيا](https://ar.wikipedia.org/wiki/%D8%AA%D8%B9%D9%82%D9%8A%D8%AF_%D8%A7%D9%84%D9%88%D9%82%D8%AA#%D8%A7%D9%84%D9%88%D9%82%D8%AA_%D8%A7%D9%84%D8%AE%D8%B7%D9%8A)\nلا تستطيع الخوارزميات الأخرى المعتمدة على المقارنة تجاوزه لأن حدها السفلي O(n log n) رياضيا.[^1]\n\nتحتاج الخوارزمية لمساحة O(n + k) حيث n عدد العناصر في مصفوفة المدخلات و k نطاق العناصر.\nتأتي n من حقيقة أن الخوارزمية لا تغير البيانات الموجودة في مصفوفة المدخلات بل تنشئ مصفوفة جديدة وتنسخ المدخلات المرتبة إليها.\nهذا ضروري لضمان [الثبات](https://ar.wikipedia.org/wiki/%D8%AE%D9%88%D8%A7%D8%B1%D8%B2%D9%85%D9%8A%D8%A9_%D8%AA%D8%B1%D8%AA%D9%8A%D8%A8#%D9%85%D9%85%D9%8A%D8%B2_%D8%A7%D9%84%D8%AB%D8%A8%D8%A7%D8%AA)،\n(الترتيب النسبي للعناصر المتساوية). يمكن تبسيط الخوارزمية وجعلها لا تحتاج إلّا إلى O(k) مساحة،\nلكن هذا يجعلها غير ثابتة ولا يجعلها مفيدة لأكبر مجال استخدام لها وهو كدالة فرعية في خوارزمية ترتيب\nأخرى تدعى [Radix sort](https://en.wikipedia.org/wiki/Radix_sort).\nتأتي مساحة k من مصفوفة الإحصاء التي نخزن فيها مرات تكرار كل عدد من مصفوفة المدخلات.\nيجب أن تكون هذه المصفوفة كبيرة كفاية لتشمل كل نطاق الأعداد المدخلة فمبدأ عمل الخوارزمية\nيعتمد على ذلك. يُفضَّل استخدام خوارزمية الترتيب بالعد عندما لا تكون قيمة k أكبر من قيمة n بكثير، وإلا قد\nيكون استخدام خوارزميات أخرى أكثر فعالية عندما تكون k أكبر بكثير من n.\n\n## استعراض تفاعلي للخوارزمية\n\nاستخدم هذا البرنامج التفاعلي المضمن لفهم الخوارزمية أكثر . جرب إدخال بعض الأرقام أو الكلمات والضغط على «تشغيل»\nلكي يرتبها البرنامج، ثم اضغط «إيقاف» واستخدم خياري «التقدم بخطوة» و«الرجوع بخطوة» لفحص عمل الخوارزمية خطوة بخطوة.\n\n{::nomarkdown}\n<iframe src=\"https://www.abdnh.net/counting-sort-demo/?lang=ar\" allow=\"fullscreen\"></iframe>\n{:/}\n\nاضغط على هذا الرابط إذا كانت نافذة البرنامج لا تظهر كليا أو هناك مشكلة في عرضها: <https://www.abdnh.net/counting-sort-demo/?lang=ar>\n\n## تطبيق للخوارزمية\n\nفي الأسفل تطبيق للخوارزمية في لغة C:\n\n{% highlight c linenos %}\n{% raw %}\n#include <limits.h>\n#include <stdbool.h>\n#include <stdio.h>\n#include <stdlib.h>\n#include <string.h>\n\nstruct item {\n    void *data;\n    unsigned key;\n};\n\nbool counting_sort(struct item array[], unsigned length) {\n    // احسب النطاق وأصغر مفتاح\n    unsigned offset = UINT_MAX;\n    unsigned end = 0;\n    for (unsigned i = 0; i < length; i++) {\n        unsigned key = array[i].key;\n        if (key < offset)\n            offset = key;\n        if (key > end)\n            end = key;\n    }\n    unsigned range = end - offset + 1;\n\n    // احجز مساحة للمصفوفة المرتبة ومصفوفة الإحصاء\n    struct item *sorted = malloc(sizeof(struct item) * length);\n    if (!sorted)\n        return false;\n    unsigned *count = calloc(range, sizeof(unsigned));\n    if (!count) {\n        free(sorted);\n        return false;\n    }\n\n    // احسب مرات تكرار كل مفتاح\n    for (unsigned i = 0; i < length; i++) {\n        count[array[i].key - offset]++;\n    }\n\n    // احسب موضع عناصر كل مفتاح في المصفوفة المرتبة\n    for (unsigned i = 0; i < range - 1; i++) {\n        count[i + 1] += count[i];\n    }\n\n    // ضع كل عنصر في موضعه في المصفوفة المرتبة\n    for (unsigned i = length - 1; i != UINT_MAX; i--) {\n        unsigned j = array[i].key - offset;\n        count[j]--;\n        sorted[count[j]] = array[i];\n    }\n\n    // انسخ النتيجة النهائية إلى المصفوفة المدخلة وحرر المساحة التي حجزناها مسبقا\n    memcpy(array, sorted, sizeof(*array) * length);\n    free(sorted);\n    free(count);\n\n    return true;\n}\n\nint main(void) {\n    struct item array[] = {{.data = \"foo\"},\n                           {.data = \"bar\"},\n                           {.data = \"ah\"},\n                           {.data = \"spam\"},\n                           {.data = \"oh\"}};\n    unsigned length = sizeof(array) / sizeof(array[0]);\n\n    for (unsigned i = 0; i < length; i++) {\n        array[i].key = ((char *)array[i].data)[0];\n    }\n\n    if (!counting_sort(array, length)) {\n        fputs(\"out of memory\\n\", stderr);\n    }\n\n    for (unsigned i = 0; i < length; i++) {\n        printf(\"key = %u , data = '%s'\\n\", array[i].key, (char *)array[i].data);\n    }\n\n    return 0;\n}\n{% endraw %}\n{% endhighlight %}\n\nلتطبيق أعم وأكثر مرونة، اطلع على هذه المكتبة البسيطة التي كتبتها: <https://github.com/abdnh/counting-sort>\n\n## مصادر\n\n- استعراض مرئي آخر للترتيب بالعد: <https://www.cs.usfca.edu/~galles/visualization/CountingSort.html>\n- شرح آخر للخوارزمية على موسوعة حسوب: <https://wiki.hsoub.com/Algorithms/counting_sort>\n\n[^1]: انظر [Comparison sort](https://en.wikipedia.org/wiki/Comparison_sort#Performance_limits_and_advantages_of_different_sorting_techniques) في ويكيبيديا الإنجليزية.\n"
    },
    {
      "title": "قواميس اللغة الإنجليزية على الإنترنت - فوائد ومقارنات",
      "date": "2021-04-26",
      "description": "قواميس اللغة الإنجليزية الأحادية على الإنترنت - فوائد لمتعلمي اللغة ومقارنات",
      "toc": true,
      "tags": [
        "english",
        "languages"
      ],
      "uuid": "078b7863-defa-4dbd-aada-52dd94295cac",
      "lastModified": "2022-07-24",
      "id": "english-dictionaries",
      "content": "\n## مقدمة\n\nهذه المقالة موجهة لمتعلمي اللغة الإنجليزية،\nوستكون مقارنة لقواميس اللغة الإنجليزية أحادية اللغة (monolingual dictionaries)،\nوهي القواميس التي تشرح مفردات لغة باستخدام اللغة نفسها. يستخدم هذا المصطلح في سياق تعلم اللغة لغير الناطقين بها،\nويقابله مصطلح القواميس الثنائية (bilingual dictionaries) التي تشرح الكلمة بلغة أخرى\nأو تعطي مقابلًا لها في اللغة الأخرى ببساطة («المترجم» بعبارة أبسط، مثل مترجم غوغل).\n\n## لم استخدام القواميس أصلًا؟\n\nعادة استخدام القواميس عمومًا قد لا تكون شائعة حتى عند متعلمي اللغة، لذلك أرى من المناسب أولًا أن\nأسرد ما أراه من فوائد للقواميس كأداة في ترسانة أدوات تعلم اللغة، خصوصًا القواميس الأحادية مقارنة بأدوات الترجمة (القواميس الثنائية).\n\n### أهل مكة أدرى بشعابها\n\nالسبب الأوضح -في نظري- هو أن متحدثي اللغة الأصليين (بمعنى لغتهم الأم) -وهم من يصنع القواميس الأحادية غالبًا-\nعادةً هم أقدر على فهم كلام لغتهم وسياقاته المختلفة وشرحه من المترجمين بطبيعة الحال. [^1]\n\nبينما تشرح التراجم كل مفردة عادةً بالاكتفاء بذكر مقابلها أو مرداف لها في اللغة الأخرى\nوافتراض أن القارئ سيشكل الرابط بين الكلمتين باعتبار أنه يعرف معنى الكلمة المقابلة في لغته،\nتشرح القواميس الأحادية المفردة باستخدام عبارة كاملة مبسطة ولا تكتفي بذكر مرادفات للكلمة.\n\nفي الحقيقة، الكتب التي تكتفي بذكر مرادفات الكلمة يقال لها thesaurus (كتاب مفردات) ولا يطلق عليها اسم dictionary (قاموس) في الإنجليزية.\nللقواميس خاصية أنها تعطي تصورًا أدق للمعاني وتساعد على تمييز الفروق بين المترادفات وأماكن استخدام مفردة مقابل مفردة مرادفة أخرى.\n\nطبعًا يمكن تصور قاموس ثنائي يشرح كل كلمة باستخدام عبارة مفيدة كاملة مكتوبة في اللغة الأخرى بدل الاكتفاء بسرد المترادفات،\nلكن هذا لا يحصل عادة للأسف.\n\n### لكل لغة خصوصياتها\n\nلكل لغة خصوصياتها التي قد يكون من الصعب نقلها بأمانة وبدون الإخلال بالمعنى إلى لغة أخرى.\n\nتشبه هذه النقطة النقطة السابقة من حيث أن مجرد سرد المفردات والكلمات المقابلة في اللغة الأخرى قد لا يكفي،\nحيث يمكن أن يعطي تصورًا بأننا نستطيع استخدام المفردة الإنجليزية (أو أي لغة يراد تعلمها) في المواضع نفسها التي\nنستخدم فيها الكلمات المقابلة في لغتنا، وهذا تصور أبعد ما يكون عن الواقع،\nفلكل لغة طرقها الخاصة في التعبير عن أشياء مشتركة بين بني البشر، وكل طريقة تعبير تتأثر بالثقافة والبيئة\nاللتين نشأت فيهما اللغة. قد تركز هذه الطرق على جوانب وزوايا معينة ليس لها التركيز نفسه في لغات أخرى،\nما يؤثر على سياقات استخدام الكلمات المسموح بها في اللغة.\n\n### حصيلة لغوية أوسع\n\nتسمح القواميس الأحادية بتوسيع حصيلتك اللغوية بشكل أسرع وأسلم بحكم أنها تجعلك تنغمس\nفي اللغة من خلال فهم معانيها من خلال معانيها الأخرى، وتعلمك التعبير عن أحاسيس معتادة بطرق\nجديدة، طرق متحدثي اللغة التي تتعلمها.\n\nسيقودك هذا بدوره إلى أن تدرك ضرورة الاطلاع على ثقافة متحدثي هذه اللغة، حيث\nإن كثيرًا من التعابير اللغوية لها تاريخ ثقافي عريق ومعرفة هذا التاريخ يساعد على فهمها\nوجعلك تكتسب القدرة على استخدامها. معرفة السياق التاريخي لبعض التعابير لا غنى عنه،\nففي النهاية، أنت تتعلم اللغة للتفاعل بشكل أو بآخر مع متحدثي اللغة أو نتاجهم الفكري،\nولكي يحصل فهم مشترك في بعض المواضع يجب أن يكون هناك أرضية مشتركة.\n\nالقواميس الأحادية -خصوصًا الموجهة لمتعلمي اللغة- تعتني بالجانب السياقي\nللتعابير وتوضيح مواضع استخدامها وسياقها الاجتماعي والتاريخي، لأنها موجهة\nفي الأصل إلى أناس من ثقافات أخرى. غالبًا لن تجد هذا الاعتناء في القواميس الثنائية\nلأنها مكتوبة على الأغلب من قبل أناس قد لا يكون لديهم اطلاع واسع على ثقافة اللغة.\n\n### طريق أسرع و\"مباشر\" أكثر\n\nهناك نقاش كبير في مجتمعات تعلم اللغات على الإنترنت حول فكرة الترجمة إلى لغتك الأم قبل\nمحاولتك التحدث أو إنتاج جملة في اللغة التي تتعلمها، وكيف أن عملية الترجمة حتمًا ستعيقك\nوتمنعك من التحدث بطلاقة وسلاسة، والعبارة الشهيرة \"stop translating in your head\" (توقف عن الترجمة في ذهنك).\n\nيعزى هذا عادة إلى أسباب عدة منها التعلم من خلال اللغة الأم غالبًا وعدم استخدام مراجع اللغة الأحادية.\nاستخدام اللغة الأم في بداية رحلة تعلم اللغة لا غنى عنه طبعًا، لكن يجب أن تكون هذه مرحلة مؤقتة\nتنتقل بعدها إلى بيئة تعلم أكثر تمثيلًا للواقع ليس فيها مكان للغتك الأم التي لن يفهمها من تريد التحدث معه\n(إذا كنت تتعلم اللغة بغرض التواصل). كما أن عملية الترجمة محدودة كما قلنا سابقًا وليست «دالة تقابلية» بمصطلحات الرياضيات،\nبمعنى أنه قد لا يكون لكل مفردة أجنبية مقابل مطابق في لغتك الأم وقد لا يكون أيضًا لكل مفردة في لغتك مقابل في اللغة الأجنبية.\n\nالتعود على المصادر الأحادية -سواء قواميس أو غيرها- هو خطوة أكثر مباشرة لتسريع كسر الحاجز\nالعائق بينك وبين استيعاب اللغة.\n\n## مقارنات\n\nبفرض أنك اقتنعت بكلامي السابق، سأنتقل الآن إلى عمل مقارنة بسيطة بين القواميس الإنجليزية\nعلى الإنترنت بالتركيز على جانب فوائدها لمتعلم اللغة. ستكون هذه المقارنات مبنية على تجربتي\nالقصيرة مع هذه القواميس في رحلتي -التي ما زلت مستمرة- مع اللغة الإنجليزية على مدار السنتين الماضيتين.\n\n### [Oxford Learner's Dictionaries](https://www.oxfordlearnersdictionaries.com/)\n\nقاموس أكسفورد للمتعلمين هو نسخة من قاموس أكسفورد الشهير (والذي سنطلع على نسخة منه هو الآخر لاحقًا) موجه لمتعلمي اللغة.[^2]\nيستحق هذا القاموس الذكر أولًا لأنه المفضل لدي ولأنني أعتقد أنه يضم تشكيلة متوازنة من الميزات المفيدة للمتعلمين خصوصًا، منها:\n\n#### شروح بسيطة\n\nأكبر نقطة لصالح هذا القاموس في نظري هي شروحاته المبسطة المكتوبة غالبًا باستخدام الكلمات الـ3000 الأكثر استخدامًا في اللغة.[^3]\nهذا الشيء يجعل استخدامه ممتعًا لمن لديه حصيلة المفردات الكافية ويريد التقدم في تعلمه من خلال الاعتماد على المصادر أحادية اللغة.\nقارن شروحات هذا القاموس بشروحات Oxford English Dictionary (الذي ليس مخصصًا للمتعلمين) لترى الفرق.\n\nفي بدايات مشواري مع القواميس الأحادية أذكر أني بدأت بقاموس أكسفورد للمتعلمين، ثم انتابتني رغبة في المخاطرة\nوبدأت بمطالعة قاموس أكسفورد العادي، وكنت أجد في كل تعريف تقريبًا كلمات لا أعرفها، أطلع على تعريفاتها هي الأخرى،\nفأجد في التعريفات كل كلمة أصعب من أختها.\n\n#### جمل نموذجية لتوضيح استخدام الكلمات\n\nهذه نقطة تأتي بعد الشروح البسيطة بمستوى الأهمية برأيي.\nقد لا يكون من الممكن دائمًا التعبير بوضوح عن معنى كلمة بمجرد تعريف، اللهم إلا أن\nيكون التعريف طويلًا ومفصلًا لحد الملل.\nوحتى لو كان التعريف مثاليًا شاملًا، ما دام ليس هناك مثال عملي عن استخدام المفردة،\nفقد لا تعرف كيف تستخدمها حتى لو فهمت معنى الكلمة وأصبحت تتعرف عليها عندما تصادفها.\nهذا لأن التعرف على الشيء والقدرة على \"إنتاجه\" أو \"استدعائه\" من الذاكرة عند الحاجة أمران مختلفان.[^4]\nوالأمثلة العملية تساعد على الإنتاج أكثر، وهي أوضح طريقة لتوصيل كيفية استخدام المفردة بجانب تعريف بسيط لها،\nفالإنسان بطبعه مجبول على التقليد.\n\nنقطة بارزة أيضا في الجمل التي يوفرها القاموس هي أن الكلمة المعنية في هذه الجمل مكتوبة بخط غامق\nمع الكلمات وحروف الجر التي تأتي معها عادة لجذب انتباهك إلى استخدام الكلمة المعتاد.\n\n![جمل نموذجية في قاموس أكسفورد للمتعلمين](/assets/images/oxford-learner-examples.png){:width=\"600px\"}\n\n#### قوائم الكلمات الأكثر تكرارًا\n\nيوفر القاموس [عدة قوائم مخصصة للكلمات الأكثر استخدامًا في اللغة](https://www.oxfordlearnersdictionaries.com/wordlists/)، منها:\n- قائمة الكلمات الـ3000 الأكثر شيوعًا.\n- قائمة أخرى أكبر مكونة من الـ5000 كلمة الأكثر شيوعًا.\n- قائمة الأفعال المركبة ([phrasal verbs](https://ar.wikipedia.org/wiki/%D9%81%D8%B9%D9%84_%D9%85%D8%B1%D9%83%D8%A8)) والعبارات الاصطلاحية ([idioms](https://ar.wikipedia.org/wiki/%D8%AA%D8%B9%D8%A8%D9%8A%D8%B1_%D8%A7%D8%B5%D8%B7%D9%84%D8%A7%D8%AD%D9%8A)) تحتوي على حوالي 750 مدخلة.\n- قائمة للكلمات الأكاديمية والتخصصية الشائعة في المجالات العلمية وما شابه، تحتوي على حوالي 4000 مدخلة.\n\nيظهر القاموس رموز في صفحة كل كلمة موجودة في أحد هذه القوائم لتنبيه القارئ على أهميتها، كما يظهر في الصورة التالية:\n\n![مؤشرات قوائم الكلمات في صفحات قاموس أكسفورد للمتعلمين](/assets/images/oxford-learner-wordlists-1.png){:width=\"600px\"}\n\nقوائم الكلمات الشائعة مفيدة لأنها توضح لك ما يجب أن تعطيه الأولوية في التعلم،\nوتضاعف سرعة تقدمك في فهم اللغة، فالكلمات ال5000 الأكثر شيوعًا مثلًا تمنحك القدرة على فهم\n%98 من النصوص العادية في اللغة حسب دراسات.[^5]\n\n#### تسجيلات صوتية لطرق نطق الكلمات\n\nطرق نطق الكلمات والأصوات لا غنى عنها في أي قاموس يحترم نفسه، وهذا القاموس ليس استثناءً،\nحيث يوفر تسجيلات نطق لكل من اللهجتين البريطانية والأمريكية الشمالية.\nبالإضافة إلى تسجيلات منفصلة لنطق الأفعال المصرفة غير الشاذة والشاذة منها، وهذا ما لم ألحظه في أي قاموس آخر،\nوأظن أنه مفيد لأن بعض الأفعال قد لا تكون طريقة نطقها واضحة حتى عندما تضاف إليها لاحقات مثل ed خصوصًا للمبتدئين مثلي.\n![تسجيلات صوتية متعددة لطريقة نطق الكلمات في قاموس أكسفورد للمتعلمين](/assets/images/oxford-learner-pronunciations.png){:width=\"600px\"}\n\nككل القواميس المحترمة أيضًا، هناك طرق النطق بالأبجدية الصوتية الدولية ([International Phonetic Alphabet](https://ar.wikipedia.org/wiki/%D8%A3%D9%84%D9%81%D8%A8%D8%A7%D8%A6%D9%8A%D8%A9_%D8%B5%D9%88%D8%AA%D9%8A%D8%A9_%D8%AF%D9%88%D9%84%D9%8A%D8%A9))،\nوهي أبجدية مخصصة لتمثيل أصوات اللغة بطريقة متناسقة لا لبس فيها (/leɪ/ في الصورة في الأعلى كمثال).\nتعلم هذه الأبجدية مفيد لأننا جميعًا نعرف أن الإنجليزية لغة فوضوية من ناحية الرابط بين كتابة الكلمة ونطقها،\nحيث قد تأتي حروف لا تنطق، وحروف أخرى يتغير نطقها من كلمة إلى أخرى، وهذه\nالتغييرات ضئيلة أحيانًا قد لا تكون على علم بوجودها إذا كنت مبتدئًا إلا\nإذا قرأت كتابة الكلمة بالأبجدية الصوتية.\n\n#### صور للكلمات التي تعبر عن أشياء ملموسة\n\nقراءة التعاريف \"المملة\" قد لا تكون أفضل طريقة لفهم كلمة ما، خصوصًا\nإذا كانت هذه الكلمة ملموسة ويمكن التعبير عنها بصورة ببساطة.\nكما تقول العبارة الشهيرة: a picture is worth a thousand words.\n\n![صورة توضيحية لجسم الإنسان مع أسماء الأعضاء المشهورة في قاموس أكسفورد للمتعلمين](/assets/images/oxford-learner-body.png){:width=\"600px\"}\n\n#### ملاحظات جانبية حول استخدام الكلمات\n\nهناك كثير من المترادفات والكلمات المتشابهة في اللغة الإنجليزية والتي تشكل صعوبات للمتعلم\nبخصوص الفروق بينها وسياقات استخدامها.\n\nخذ مثلًا كلمة inflammable والتي قد يظن أنها ضد كلمة flammable لأنها تبدأ بالبادئة in\nوالتي عادة ما تستخدم لتشكيل الأضداد، لكن في الحقيقة الكلمتان لهما المعنى نفسه.\nمصدر هذا الالتباس هو أن بادئة in لا تأتي فقط لتشكيل الأضداد، بل تستخدم أيضًا لتشكيل صفات\nتصف أشياء لها خاصيات محددة. مثلًا inborn مكونة من بادئة in والفعل الماضي born (وُلِد)\nلتعطي معنى يصف الأشياء الموجودة منذ الولادة، الوراثية بمعنى آخر.\n\nهناك أمثلة كثيرة عن كلمات تسبب مثل هذا الالتباس في اللغة الإنجليزية، ووجود شروحات\nتوضيحية في صفحات هذه الكلمات المستعصية أمر مفيد طبعًا لمتعلمي اللغة،\nوقاموس أكسفورد للمتعلمين يعج بهذه الشروحات.\n\n![توضيح الفروقات بين الكلمات التي يظن أنها متضادة في قاموس أكسفورد للمتعلمين](/assets/images/oxford-learner-non-opposites.png){:width=\"600px\"}\n\nنقطة أخرى هي الكلمات المترادفة أو ذات المعاني المتقاربة جدًا. مع أن القواميس الجيدة\nتعطي فكرة مختصرة عن سياقات استخدام المترادفات في التعاريف، أو كلمات جانبية مفتاحية مثل formal و informal و vulgar\n(اسمها التقني في علم اللغويات هو registers)، إلا أن المتعلم قد يجد نفسه يخلط بين الكلمات\nأحيانًا مستخدمًا كلمات لها معنى مقارب لما يريده لكنها قد لا تكون مناسبة في سياق حديثه.\nوهذا ما يستدعي ملحوظات جانبية في القواميس تعالج الفروقات بين الكلمات المتشابهة بشكل مباشر\nكما يتضح في هذا المثال عن الكلمات ask و enquire و demand.\n\n![توضيح الفروقات بين الكلمات المتشابهة في قاموس أكسفورد للمتعلمين](/assets/images/oxford-learner-ask-synonyms.png){:width=\"600px\"}\n\n#### الاعتناء بالتعابير والمصطلحات\n\nتعلم ما يسمى بالـidioms (العبارات الاصطلاحية) و الـphrasal verbs (الأفعال المركبة)\nمهم للغاية لأنها مستخدمة بكثرة خصوصًا في اللغة المتحدثة.\n\nالـidioms هي العبارات التي لها معنى مجازي غير حرفي لا يفهم بمجرد فهم الكلمات المكونة للعبارات.\nمن الأمثلة عن هذه العبارات العبارة الشهيرة \"once in a blue moon\" (حرفيًا «مرة كل شهر/قمر أزرق») والتي تأتي بمعنى «نادرًا».[^6]\n\nأجد من الممتع القراءة عن تاريخ هذا النوع من العبارات وكيف كسبت معانيها التي\nقد لا يكون واضحًا علاقتها بالكلمات المكونة للعبارة.[^7]\n\n![مثال عن شرح العبارات الاصطلاحية في قاموس أكسفورد للمتعلمين](/assets/images/oxford-learner-idioms.png){:width=\"600px\"}\n\nالـphrasal verbs هي أفعال مركبة من عدة كلمات، تتكون عادة من فعل عادي وحرف جر أو ظرف يأتي بعد الفعل.\nمن الأمثلة عنها الفعل look after الذي يأتي بمعنى الاعتناء،\nكما في جملة: She spends all day looking after her children (إنها تقضي كل اليوم بالاعتناء بأطفالها).\n\nتشبه الأفعال المركبة التعابير الاصطلاحية من حيث أن معناها قد لا يكون واضحًا بمجرد معرفة معنى الكلمات المفردة المكونة للعبارة.\nخذ كمثال آخر عبارة \"put up with\" (التحمل) كما في جملة:\nI can no longer put up with him (لا أستطيع تحمله بعد الآن).\n\n![مثال عن الأفعال المركبة في قاموس أكسفورد للمتعلمين](/assets/images/oxford-learner-phrasal-verbs.png){:width=\"600px\"}\n\n### [Longman Dictionary](https://www.ldoceonline.com/)\n\nقاموس Longman هو أيضا قاموس بدأت باستخدامه مؤخرًا بعد أن وجدت فيه بعض الميزات المفيدة.\nما لفت انتباهي هو التالي:\n- وجود تسجيلات صوتية لجمل كاملة، وليس فقط كلمات منفردة.\n- إبراز لعوائل الكلمات (مجموعة الكلمات المشتقة من الجذر نفسه، مثل happy و happily)\n  والكلمات المتضادة في أعلى صفحة كل كلمة.\n- اهتمام بالقواعد وحروف الجر التي تأتي مع كل صفة مثلًا. هذا موجود في قواميس أخرى مثل\n  أكسفورد للمتعلمين، لكنها بارزة هنا أكثر حسب ما رأيت.\n\nعدا عن ذلك، القاموس فيه ميزات مفيدة يشترك فيها مع قواميس أخرى ذكرتها سابقًا،\nلذلك لن أكرر الحديث عنها هنا.\n\n![واجهة قاموس Longman](/assets/images/longman-dictionary-1.png){:width=\"600px\"}\n\n![شرح نحوي في قاموس Longman](/assets/images/longman-dictionary-2.png){:width=\"600px\"}\n\n### [Collins Dictionary](https://www.collinsdictionary.com/)\n\nقاموس Collins هو قاموس استخدمه أحيانًا رغبة في التجديد.\n\nمن الميزات البارزة في هذا القاموس هي مؤشرات لأهمية كل كلمة من ناحية شياع الاستخدام،\nورسم بياني يوضح أيضا شياع الكلمة على مر العصور.\n\n![مؤشرات شياع الكلمات في قاموس Collins](/assets/images/collins-dictionary-1.png){:width=\"600px\"}\n![رسم بياني يوضح شياع الكلمات في قاموس Collins](/assets/images/collins-dictionary-trends.png){:width=\"600px\"}\n\nكما أن هناك فيديوهات (وليس فقط أصوات) لطريقة نطق الكلمات الشائعة!\nأعتقد أن هذا مفيد لرؤية حركة الفم وأعضائه عند نطق الكلمات.\n![توضيح قاموس Collins لنطق الكلمات عبر الفيديوهات](/assets/images/collins-dictionary-video-pronunciation.png){:width=\"600px\"}\n\nيوفر القاموس أيضا تسجيلات صوتية لكثير من الجمل مثل قاموس Longman،\nلكن بدا لي أن الأصوات مولدة آليًا وليست طبيعية.\n\nالقاموس أيضا يميل إلى توفير أكبر قدر من المعلومات حول كل كلمة في صفحة واحدة، مثل\nالمترادفات، والعبارات، والجمل طبعًا، وحتى ترجمات للغات كثيرة.\n![ترجمات للكلمات إلى لغات متعددة في قاموس Collins](/assets/images/collins-dictionary-translations.png){:width=\"600px\"}\n\nوبذكر الترجمات، فموقع القاموس أيضا يوفر [خدمة ترجمة](https://www.collinsdictionary.com/translator) تدعم لغات عديدة.\n![مترجم قاموس Collins](/assets/images/collins-dictionary-translator.png){:width=\"600px\"}\n\nكما أن هناك [موسوعة لقواعد اللغة](https://grammar.collinsdictionary.com) وشروحات للفروق بين الكلمات المتشابهة.\n![مثال عن شرح قواعد اللغة في قاموس Collins](/assets/images/collins-dictionary-grammar.png){:width=\"600px\"}\n\n### [Cambridge Dictionary](https://dictionary.cambridge.org/)\n\nقاموس Cambridge من أشهر القواميس للمتعلمين المتقدمين.\n\nلا أعرف ماذا يمكنني أن أكتب عن هذا القاموس... إنه يضم تشكيلة ممتازة من الميزات\nالمفيدة للمتعملين: تعريفات بسيطة، مؤشرات مستوى صعوبة الكلمة، أمثلة، عبارات متعلقة بالكلمة.\nهناك أيضا [أداة ترجمة](https://dictionary.cambridge.org/translate/)\nو[موسوعة قواعد لغة](https://dictionary.cambridge.org/grammar/).\n\n![واجهة قاموس Cambridge](/assets/images/cambridge-dictionary-1.png){:width=\"600px\"}\n![مثال عن شرح قواعد اللغة في قاموس Cambridge](/assets/images/cambridge-dictionary-grammar.png){:width=\"600px\"}\n![مترجم قاموس Cambridge](/assets/images/cambridge-dictionary-translator.png){:width=\"600px\"}\n\nتغيرت واجهة القاموس عن آخر مرة استخدمته فيها. أنا أفضل الواجهة القديمة.\nعدا عن ذلك، ليس لدي ما أقوله أكثر عن هذا القاموس. شخصيًا لا أستخدمه كثيرًا\nلأنني لا أرى له أفضلية على قاموس أكسفورد للمتعلمين مثلًا.\n\n### [The Merriam-Webster Dictionary](https://www.merriam-webster.com/)\n\nقاموس Merriam-Webster من القواميس المرموقة المعروفة. القاموس ليس موجهًا\nخصيصا للمتعلمين، لكنه قد يكون مفيدًا للمتعلمين المتقدمين على كل حال.\n\nالقاموس يضم التشكيلة المعتادة للقواميس وهو يعتني بالإنجليزية الأمريكية خصيصًا.\nأبرز ميزة لفتت انتباهي هي قسم منفصل للجمل النموذجية المأخوذة من مواقع على الإنترنت، مع روابط\nللمصادر. قد يكون هذا مفيدًا إذا أثارت جملة ما اهتمامك وتريد قراءة المقالة أو الكتاب التي مرت فيه الجملة.\nكما أن موقع القاموس فيه مدونة (ككثير من القواميس) فيها مقالات عن كل ما يخص اللغة أستمتع بقراءتها.\n\nلا أحب واجهة القاموس وأظن أنها \"ناشفة\" وخالية من \"التفاعلية\" مقارنة بقواميس أخرى.\nلا أستخدم هذا القاموس كثيرًا، لكنه مفيد طبعًا، خصوصًا للكلمات النادرة لأنه\nمن أكبر قواميس اللغة.\n\n![واجهة قاموس Merriam-Webster](/assets/images/merriam-webster-dictionary-1.png){:width=\"600px\"}\n\n### [Oxford Dictionary](https://www.lexico.com/)\n\nقاموس أكسفورد ليس قاموسًا واحدًا، بل قواميس عدة. منها هذا القاموس غير الموجه للمتعلمين.\nإذن لم أعرضه هنا؟ لأنه أولًا قاموس مرموق ويستحق الذكر طبعًا، ثانيًا لأنه قاموس ضخم سترى\nفائدته عاجلًا عندما تتقدم في رحلة تعلمك وتواجه كلمات لن تجدها في القواميس الموجهة للمتعلمين.\n\n![واجهة قاموس Oxford](/assets/images/oxford-dictionary-1.png){:width=\"600px\"}\n\nيضم القاموس كل ما تتوقعه من قاموس محترم، لكني لا أنصح باستخدامه كأول قاموس أحادي للمتعلم\n(نفس الشيء لقاموس Merriam-Webster أيضًا). لأنه كما قلت في قسم قاموس أكسفورد\nللمتعلمين، تعريفات هذا القاموس قد تكون صعبة للمبتدئ وقد تصيبك بالإحباط من كم الكلمات\nالتي لا تعرفها والمستخدمة في تعريف كلمات أخرى.\n\nهذا أكثر قاموس أستخدمه شخصيًا. انتقلت من قاموس المتعلمين إلى هذا القاموس بسبب حماسي\nالزائد ورغبتي في تعلم أكبر قدر من الكلمات. لكنني ما زلت أستخدم قاموس المتعلمين لأنني\nأحب واجهته أكثر وأشياء كثيرة فيه.\n\nيعجبني في قواميس أكسفورد (هذا والخاص بالمتعلمين) الاهتمام بالإشارة إلى أين يشيع استخدام الكلمات\nوتعريفاتها المفردة والتعابير، بالإضافة إلى تصنيفات كـslang للعامية، و vulgar للغة البذيئة وما إلى ذلك.\n\n![مثال عن العبارات في قاموس Oxford](/assets/images/oxford-dictionary-phrases.png){:width=\"600px\"}\n\n### [Dictionary.com](https://www.dictionary.com)\n\nقاموس أونلاين معروف يحتوي على كل ما تريده من قاموس. مواد القاموس معظمها مجمعة من قواميس أخرى.\nيعتبر هذا من أشمل القاموس حسب ما رأيت. موقع القاموس فيه أيضًا أدوات عديدة مفيدة للمتعلمين، ومقالات عن اللغة أيضا.\n\n### [The Free Dictionary](https://www.thefreedictionary.com)\n\nعبارة عن موسوعة من القواميس المجمعة من مصادر عديدة. يضم أيضًا قواميس متخصصة\nفي مجالات معينة، مثل الطب والقانون، وقاموس العبارت. ويضم في داخله ويكيبيديا بأسرها.\n\nاستخدم هذا القاموس خصوصا لتعلم الـidioms والعبارات، ربما ليس لشيء إلا لأنني عندما أبحث\nفي غوغل عن عبارة ما يأتي هذا القاموس في أول النتائج. والقاموس يعتني بالعبارات خصوصًا.\n\nفيه قسم منفصل لجمل تضم الكلمة المعنية في الأدب أيضا.\n![أمثلة من الأدب في القاموس الحر](/assets/images/the-free-dictionary-classic-literature.png){:width=\"600px\"}\n\nوبذكر الأدب، فللقاموس موقع شقيق يدعى [The Free Library](https://www.thefreelibrary.com/)\nوهو موسوعة للكتب المجانية ومصادر مكتوبة كثيرة ليست لها حقوق نشر.\n\n### [Wiktionary](https://en.wiktionary.org/)\n\nمن المشاريع الشقيقة لملكة الإنترنت العمة ويكيبيديا. ومثل ويكيبيديا،\nالقاموس عمل تعاوني يمكن لأي أحد المساهمة فيه!\n\nالموقع يعرض معنى كل كلمة تبحث عنها في كل لغة توجد فيها هذه الكلمة في صفحة واحدة.\nلذلك فهو ليس فقط قاموسًا مخصصًا بلغة واحدة، بل هو يوثق كل كلمة في أي لغة يمكن توثيقها.\n\n![واجهة قاموس Wiktionary](/assets/images/wiktionary-1.png){:width=\"600px\"}\n![قاموس آخر لواجهة Wiktionary لكلمة عربية](/assets/images/wiktionary-2.png){:width=\"600px\"}\n\nغني عن الذكر أيضًا أن الموقع متوفر في لغات أخرى مثل ويكيبيديا هي أيضا مشاريع تعاونية.\nهناك مشروع باللغة العربية له اسم لطيف: [ويكاموس](https://ar.wiktionary.org).\n\n### [Wordnik](https://www.wordnik.com/)\n\nقاموس أونلاين بدرجة أولى، عبارة عن تجميع من مصادر أخرى مثل بعض القواميس التي استعرضناها\nسابقًا. ومثل القواميس الموجودة أونلاين فقط وغير التابعة لسياسية تضمين كلمات صارمة\nمثل القواميس التقليدية التي نشأت على ورق في الأصل، فهذا القاموس يعد من أضخم القواميس،\nوقد يكون الأضخم، إذ [يضم ملايين الكلمات](https://mlab.com/case-studies/wordnik/).\n\nوفيه بحر من الجمل المجمعة من مصادر كثيرة، منها تغريدات تويتر!\n\n![مثال عن جمل مأخوذة من تغريدات تويتر في قاموس Wordnik](/assets/images/wordnik-dictionary-tweets.png){:width=\"600px\"}\n\n### [Vocabulary.com](https://www.vocabulary.com/)\n\nقاموس أونلاين آخر. يركز هذا القاموس على المفردات كما يوحي اسمه.\n\nيعجبني فيه أن تعريفاته للكلمات ليست تعريفات فعلًا، بل شرح بلغة عفوية مفهومة مع إعطاء\nأمثلة من الحياة اليومية.\n\n![مثال عن شرح موقع Vocabulary للمفردات](/assets/images/vocabulary.com-1.png){:width=\"600px\"}\n\nالموقع أيضًا فيه تركيز على قوائم الكلمات المصنفة حسب الموضوع والسياق وما إلى ذلك.\nأكبر ميزة للموقع هي نظام أسئلة متنوعة (أسئلة عن تعاريف، وأسئلة عن أمثلة، إلخ) لتعلم المفردات.\nيمكنك إنشاء حساب في الموقع وتخصيص\nقوائم مفردات تريد تعلمها وسيعرض لك الموقع أسئلة عن هذه المفردات. قبل أن أنسى،\nمن واجبي أن أحذرك أن الموقع قد يسبب الإدمان؛ اسأل مجرب، فقد اعتدت على قضاء\nالساعات في هذا الموقع قبل سنوات عندما كان هوسي بتعلم الكلمات في أوجه.\n\n![مثال لأسئلة موقع Vocabulary من خلال الجمل](/assets/images/vocabulary.com-quiz-1.png){:width=\"600px\"}\n![مثال لأسئلة موقع Vocabulary من خلال المعاني](/assets/images/vocabulary.com-quiz-2.png){:width=\"600px\"}\n\nيدّعي الموقع أن طريقة تنظيمه وعرضه للأسئلة مبنية على العلم وكيفية تعلمك للمفردات ونسيانها.\nلا يوجد كلام واضح عن \"الخوارزمية\" التي يستخدمها الموقع، لكن أشك أنه يستخدم التكرار المتباعد،\nمثل برنامج [Anki]({% post_url 2021-02-19-anki-intro %})،\nوالذي أظن أنني توقفت عن استخدام Vocbulary.com عندما تعرفت عليه.\n\n### [Urban Dictionary](https://www.urbandictionary.com/)\n\n«قاموس الإنترنت» بعبارة موجزة.\n\nقد يعترض من يعرف هذا القاموس على تضمينه كقاموس للمتعلمين هنا، إذ أن أي أحد يستطيع\nتعديله وإضافة كلمات وتعاريف لها على هواه (مع أنه [هناك عملية مراجعة غير صارمة تعتمد على تصويت زوار الموقع](https://en.wikipedia.org/wiki/Urban_Dictionary#Quality_control))،\nإضافة إلى ذلك، فهذا القاموس لا يأخذ نفسه بجدية.\nفي هذا الاعتراض وجهة نظر إذا كنت أضمن هذا القاموس هنا\nكبديل على القواميس \"المحترمة\" التقليدية مثل أكسفورد للمتعلمين أو حتى القواميس التعاونية الجدية مثل Wiktionary،\nلكنني أضعه عنا كمرجع مكمل لمن يريد التعمق في اللغة العامية والثقافة الإنجليزية، ثقافة الإنترنت على وجه الخصوص،\nولا أنصح به كمرجع منفصل عن تلك القواميس. هذ القاموس فكاهي وذو روح مرحة\nبدرجة أولى، وتصح تسميته شبكة تواصل اجتماعي بزي قاموس.\n\nمؤخرًا بدأت أزور هذا الموقع وأستمتع بتصفحه أكثر وأكثر، أحيانًا فقط لأؤكد نظريتي التي تقول\nإن كل كلمة وجدت على الإطلاق لها معنى بذيء أو متعلق بالجنس معروف فقط لدى كتّاب هذا الموقع.\n\n![مثال لتعريف كلمة في موقع Urban Dictionary](/assets/images/urban-dictionary-1.png){:width=\"600px\"}\n\n## قواميس تستحق الذكر\n\nللغة الإنجليزية كثير من القواميس التي يصعب حصرها هنا.\nسأضع هنا قائمة لقواميس ليس لدي اطلاع كافٍ عليها لكي أكتب بتفصيل عنها.\nقد أحدث المقالة بتحديثات لهذه القائمة، أو ضم بعضها تحت عنوانين منفصلة\nكما للقواميس السابقة إذا وجدت ما أكتبه عنها.\n- <https://www.macmillandictionary.com/>\n- <https://www.learnthat.org>\n- <https://www.onelook.com/>\n- <https://chambers.co.uk/book/the-chambers-dictionary/>\n\n[^1]: جدير بالذكر  أن القدرة على الشرح بأسلوب واضح قد لا تكون فطرية ومتطورة حتى عند المتحدثين الأصليين وتحتاج ربما إلى دراسة مخصصة لفن صنع القواميس، حيث إن معرفة المتحدثين الأصليين بلغتهم عادة ما تكون تلقائية لا واعية تصبح بمثابة حدس وبداهة مع كثرة الخلطة مع اللغة. في الحقيقة، قد تكون تلقائية القدرة اللغوية وعدم القدرة على الوصول إلى شرح \"منطقي\" ومبرر لبعض الأشياء في اللغة (النحو والقواعد على وجه الخصوص) هي المؤشر الرئيسي للطلاقة (fluency) والتمكن من اللغة. مثلًا، كثير من قواعد اللغة اعتباطية وقد لا تعني شيئًا لمتعلمها، لكنها تبدو طبيعية (natural كما يقال عادة) للمتحدثين الأصليين بدون أن يقدروا على إعطاء سبب \"عقلاني\" لهذا الشعور.\n\n[^2]: هل تعلم: قاموس أكسفورد للمتعلمين هو [أول قاموس خُصِص لمتعلمي اللغة الإنجليزية المتقدمين](https://en.wikipedia.org/wiki/Oxford_Advanced_Learner's_Dictionary).\n\n[^3]: أذكر أنني قرأت هذا في موقع القاموس قبل سنوات، لكنني فشلت في إيجاد المصدر على الموقع الآن.\n\n[^4]: التعرف على معنى كلمة عند رؤيتها رغم الفشل في تذكرها عند الحاجة إليها في محادثة مثلًا هو مثال شائع جدًا ومعروف لدى متعلمي اللغات.\n\n[^5]: اقرأ [هذه المقالة لمزيد من التفاصيل](https://universeofmemory.com/how-many-words-you-should-know/).\n\n[^6]: اقرأ المزيد عن أصل هذه العبارة هنا: [1](https://www.phrases.org.uk/meanings/once-in-a-blue-moon.html) [2](https://en.wikipedia.org/wiki/Blue_moon)\n\n[^7]: موقع [phrases.org](https://www.phrases.org.uk) مصدر رهيب للـidioms ومعانيها وأصولها.\n"
    },
    {
      "title": "مرحبا بالعالم!",
      "date": "2020-05-24",
      "uuid": "bfb63dd3-f9b4-47ad-a81e-c494aa1547ff",
      "lastModified": "2022-07-21",
      "tags": [],
      "id": "hello-world",
      "content": "\nمرحبا **بالعالم**!\n\nتجربة لمحرر المدونة."
    },
    {
      "title": "تعزيز الذاكرة طويلة الأمد - مايكل نيلسن (مترجم)",
      "date": "2021-07-11",
      "tags": [
        "translation",
        "memory",
        "anki"
      ],
      "uuid": "fc9e63d7-1b07-48c3-a12e-7e4060726ebb",
      "lastModified": "2022-07-24",
      "id": "ltm",
      "content": "{::options parse_block_html=\"true\" /}\n\n*__هذه ترجمة [لمقالة إنجليزية رائعة لمايكل نيلسن](https://augmentingcognition.com/ltm.html).\nالمقالة الأصلية مرخصة تحت رخصة [CC BY-NC 3.0](https://creativecommons.org/licenses/by-nc/3.0/deed.ar)__*\n\nفي يوم من أواسط عشرينيات القرن العشرين، دخل مراسل لصحيفة في موسكو يدعى سليمان شيريشفسكي\nمعملَ عالم النفس ألكسندر لوريا. لاحظ رئيس شيريشفسكي في الجريدة أن الأخير لم يحتج\nأن يأخذ أي ملحوظات، لكنه تمكن بطريقة ما من تذكر كل ما قيل له، واقترح عليه أن يذهب\nلمختص لكي يفحص ذاكرته.\n\nبدأ لوريا باختبار ذاكرة شيريشفسكي. بدأ باختبارات بسيطة مكونة من قوائم كلمات وأعداد.\nتذكرها شيريشفسكي بسهولة، لذلك زاد لوريا من طول القوائم تدريجيا. لكن شيريشفسكي\nنجح في تذكرها مهما كانت طويلة. ذهب لوريا مذهولا يدرس ذاكرة شيريشفسكي\nفي السنوات الثلاثين التالية. كتب لوريا التالي في كتاب يلخص بحثه[^1]:\n\n> تبين أنه لا يوجد حد *لسعة* ذاكرته ولا *متانة المعلومات التي حفظها*.\n> بينت التجارب أنه لم يواجه صعوبة في استحضار أي قائمة طويلة من الكلمات أيا كانت.\n> حتى مع أنها عرضت عليه منذ أسبوع، أو شهر، أو سنة، أو حتى سنوات عديدة. في الحقيقة،\n> أجريت بعض التجارب التي صممت لاختبار تذكره (بدون إخباره) بعد خمسة عشر أو ستة عشر عاما\n> من الجلسة التي تذكر فيها الكلمات سابقا. ومع ذلك نجح في تذكرها في كل مرة.\n\nقصص كهذه آسرة. الذاكرة جوهرية لتفكيرنا، وفكرة امتلاك ذاكرة مثالية مغرية.\nفي الوقت نفسه، كثير من الناس مترددون حيال ذواكرهم. لقد سمعت كثيرا أناسا يقولون\n«ذاكرتي ليست جيدة»، أحيانا بخجل، وأحيانا بأسف، وأحيانا أخرى بتمرد حتى.\n\nبالنظر إلى مركزية الذاكرة لتفكيرنا، من الطبيعي أن نتساءل ما إذا كان يمكن\nاستخدام الحواسيب لتحسين ذاكرتنا. يبدو أن هذا السؤال مولد معطاء للأفكار الجيدة،\nوالسعي وراءه أدى إلى عديد من أهم الوثائق المقدمة لأفكار جديدة في تاريخ الحوسبة.\nمثال مبكر هو اقتراح فانيفار بوش سنة 1945 في ما يتعلق بموسع ذاكرة ميكانيكي،\n(الميمكس)[^2]. كتب بوش:\n\n> ميمكس هو جهاز يخزن فيه المرء كل كتبه، وسجلاته، ومرسلاته، وهو مُؤتمَت لكي يتم استنطاقه\n> بسرعة عالية ومرونة كبيرة. إنه مكمل مُضخَّم لذواكرنا قريب إلينا.\n\nألهمت رؤية ميمكس العديد من رواد الحاسوب، بمن فيهم دوغلاس إنجيلبارت وأفكاره عن تعزيز\nالذكاء البشري، وثيودور نيلسون وأفكاره عن النص الفائق (hypertext)، وبشكل غير مباشر،\nتيم بيرنرز لي وتصوره للشبكة العنكبوتية العالمية[^3]. في اقتراحه للشبكة،\nيصف بيرنرز لي حاجة موظفه (منظمة الفيزياء الجزيئية CERN) لتطوير ذاكرة جمعية مؤسساتية:\n\n> تطوير حوض معلومات يمكنه النمو والتطور مع المنظمة والمشاريع التي تصفها.\n\nهذه فقط بعض من المحاولات العديدة لاستخدام الحواسيب لتعزيز ذاكرة الإنسان.\nمن الميمكس إلى الويب إلى الويكيات إلى [org-mode](https://orgmode.org/)\nإلى [مشروع Xanadu](https://en.wikipedia.org/wiki/Project_Xanadu) إلى محاولات\n[لصنع خارطة لكل فكرة يفكر فيها الإنسان](https://users.speakeasy.net/~lion/nb/book.pdf):\nكان تعزيز الذاكرة رؤية مولدة للأفكار للغاية في مجال الحوسبة.\n\nسنبحث في هذه المقالة في موضوع أنظمة الذاكرة الشخصية، وهي الأنظمة المصممة لتحسين\nالذاكرة طويلة الأمد لفرد واحد. في القسم الأول من المقالة سأروي تجربتي الشخصية\nمع استخدام نظام كهذا يدعى Anki. كما سنرى، يمكن استخدام أنكي لتذكر أي شيء تقريبا.\nإنه يجعل الذاكرة خيارا بدلا من أن تكون حدثا عشوائيا يُترَك للصدفة. سأناقش كيف أستخدم أنكي لفهم\nالأوراق البحثية، والكتب، وأشياء أخرى كثيرة. وسأتحدث عن عديد من طرق الاستخدام الجيدة والسيئة لأنكي.\nمع أن أنكي برنامج بسيط جدا، من الممكن تطوير مهارة عالية باستخدامه،\nمهارة تهدف لفهم مواد معقدة بعمق، وليس فقط حفظ حقائق بسيطة.\n\nيناقش القسم الثاني من المقالة أنظمة الذاكرة عموما. يتعامل كثير من الناس مع الذاكرة\nباعتبارها مهارة ذهنية بتردد واستخفاف أحيانا. مثلا، يتحدث الناس عادة عن الحفظ عن\nظهر قلب (rote memory) كما لو أنه أقل مرتبة من أنواع متقدمة من الفهم.\nسأعارض هذه الفكرة وأدافع عن فكرة أن الذاكرة جوهرية لحل المشاكل والإبداع. كما سنناقش\nفي الجزء الثاني أيضا دور علوم الإدراك في بناء أنظمة الذاكرة الشخصية وبناء أنظمة\nتعزز المعرفة الإنسانية عموما. في مقالة قادمة،\n[ Toward a Young Lady's Illustrated Primer](https://augmentingcognition.com/taylip.html)،\nسأناقش أفكار أكثر عن أنظمة الذاكرة الشخصية.\n\nإن المقالة غير معتادة الأسلوب؛ إنها ليست ورقة بحثية تقليدية في علوم الإدراك\n(دراسة في ذاكرة الإنسان وكيفية عملها مثلا)، كما أنها ليست ورقة حول تصميم أنظمة الحاسوب،\nمع أن تصميم نماذج أولية للأنظمة (prototyping) هو اهتمامي الرئيسي.\nلكن هذه المقالة مستخلص لملاحظات غير منهجية ومخصصة لأغراض محددة وقواعد عملية سهلة التطبيق\nحول طريقة عمل أنظمة الذاكرة الشخصية. أردت فهم هذه الأنظمة كتحضير لبناء أنظمتي الخاصة.\nبينما كنت أجمع هذه الملاحظات بدا لي أنها قد تهم الآخرين أيضا.\nتستطيع التفكير بهذه المقالة كدليل عملي يهدف لمساعدتك على تطوير مهارات عالية في أنظمة الذاكرة الشخصية.\nلكن لأن كتابة دليل كهذا ليس هدفي الرئيسي، فقد تأخذ فكرة عن المقالة كدليل يعطيك\nمعلومات كثيرة أكثر مما تريد تعلمه.\n\nبعض الكلمات عن مواضيع لن تغطيها هذه المقالة قبل أن أنهي المقدمة: سأناقش تقنيات\nالتصور المرئي مثل قصور الذاكرة و طريقة (لوكي) بإيجاز فقط. ولن تناقش المقالة استخدام\nالأدوية لتحسين الذاكرة، ولا واجهات مستقبلية تربط بين الدماغ والحاسوب لتعزيز الذاكرة.\nتحتاج هذه الموضوعات لنقاش منفصل. لكن كما سنرى لاحقا، هناك بالفعل أفكار قوية حول\nأنظمة الذاكرة الشخصية مبنية فقط على ترتيب المعلومات وعرضها.\n\n## القسم الأول: كيف تتذكر أي شيء تقريبا: نظام Anki\n\nسأبدأ بسرد لتجربتي مع نظام الذاكرة الشخصي أنكي[^4]. المحتوى شخصي لدرجة كبيرة كما قلت سابقا،\nوهو مجموعة من ملاحظات وقواعد عملية غير رصينة. قد لا تنطبق هذه القواعد على الآخرين؛\nفي الواقع، قد أكون مخطئا حول مدى قابلية تطبيقها بالنسبة لي. إنها بالتأكيد ليست\nدراسة مضبوطة بشكل مناسب لاستخدام أنكي! مع ذلك، أؤمن بقيمة جمع مثل هذه الخبرات\nالشخصية، حتى لو كانت متناقلة وانطباعية. لست خبيرا في مجال علم الذاكرة، وأقدر أي تصحيحات لأي أخطاء موجودة.\n\nللوهلة الأولى، لا يبدو أنكي أكثر من برنامج بطاقات استذكار (flashcards) إلكتروني.\nتدخل سؤالا:\n![واجهة السؤال في أنكي](/assets/images/ltm/Anki_question.png)\nوجوابا مقابلا:\n![واجهة الجواب في أنكي](/assets/images/ltm/Anki_answer.png)\n\nسيطلب منك لاحقا مراجعة البطاقة: سيظهر لك السؤال وتُسأل ما إذا كنت تعرف الجواب أم لا.\n\nالشي الذي يجعل أنكي أفضل من بطاقات الاستذكار التقليدية هو أنه يدير جدولة المراجعة.\nإذا استطعت الإجابة عن سؤال بشكل صحيح، تطول الفترة الزمنية الفاصلة بين المراجعات تدريجيا.\nفيصبح فاصل يوم واحد بين المراجعات فاصل يومين، ثم 6 أيام، ثم 14 يوما، وهكذا.\nالفكرة هي أن المعلومة تصبح أكثر رسوخا في ذاكرتك، لذلك فهي تتطلب مراجعة بوتيرة أخف.\nلكن إذا حصل وفشلت بالإجابة عن سؤال، يعاد ضبط الجدولة، ويصبح عليك أن تبني الفاصل\nالزمني بين المراجعات من البداية.\n\nمع أنه من المفيد بوضوح أن الحاسوب يهتم بإدارة الفواصل بين المراجعات، قد لا تبدو هذه الفكرة بالشيء الكبير.\nالمغزى هو أن هذه الطريقة أكثر فعالية بكثير لمراجعة المعلومات.\n\nإلى أي مدى هي أكثر فعالية؟\n\nللإجابة عن هذا السؤال، لنجرِ بعض الحسابات التقديرية. تستغرق مني إجابة بطاقة حوالي\n8 ثواني وسطيا. لنفرض أنني أستخدم بطاقات الاستذكار التقليدية، وأراجعها مرة\nفي الأسبوع. إذا أردت تذكر معلومة ما للسنوات العشرين القادمة، فسأحتاج 20 سنة مضروبة\nبـ52 أسبوعا لكل سنة مضروبة بـ8 ثوان لكل بطاقة. ينتج عن هذا مدة مراجعة تجتاز الساعتين لكل بطاقة.\n\nبينما فواصل مراجعة أنكي المتزايدة دوما تتخطى الشهر بسرعة ثم السنة.\nفي الواقع، الفاصل المتوسط بين المراجعات لمجموعة بطاقاتي الشخصية هو 1.2 سنة ويتزايد.\nفي [ملحق](#Anki_analysis) في الأسفل حيث أقدر ذلك لبطاقة عادية، أجد أنني أحتاج فقط\nمن 4 إلى 7 دقائق مراجعة لمدة 20 سنة كاملة. تسمح هذه التقديرات ببعض المراجعات الفاشلة\nمن حين لآخر، حيث يُصفّر الفاصل الزمني. هذا توفير للوقت بمقدار 20 ضعفا مقارنة بأكثر\nمن ساعتين متطلبات مع بطاقات الاستذكار التقليدية.\n\nبالتالي لدي قاعدتان عمليتان. أولا، إذا كان حفظ معلومة يستحق 10 دقائق من وقتي في\nالمستقبل، فسأفعل[^5]. ثانيا، ومهيمنا على القاعدة الأولى، إذا بدت حقيقة ما لافتة للنظر\nفستذهب إلى أنكي، بغض النظر عما إذا كانت تستحق 10 دقائق من وقتي المستقبلي أم لا.\nالسبب وراء هذا الاستنثاء هو أن كثيرا من أهم الأشياء التي نعرفها هي أشياء لسنا متأكدين\nما إذا كانت ستكون مهمة، لكن حدسنا يقول لنا إنها مهمة. لا يعني هذا أننا يجب أن نحفظ\nكل شيء، لكن من المفيد تنمية حدس حول ما نحفظ.\n\nأكبر تغيير يجلبه أنكي هو أنه يعني أن الذاكرة لم تعد بعد الآن حدثا عشوائيا يترك للصدفة،\nبل إنه يضمن أنني سأتذكر كل شيء بأقل جهد ممكن. *إن أنكي يجعل الذاكرة خيارا*.\n\nفي ماذا يمكن استخدام أنكي؟ أستخدم أنكي في كل نواحي حياتي. أستخدمه مهنيا للتعلم\nمن البحوث والكتب، وللتعلم من النقاشات والمؤتمرات، ولمساعدتي على تذكر أشياء مثيرة للاهتمام\nتعلمتها أثناء محادثة، ولتذكر ملاحظات مهمة خطرت لي أثناء عملي اليومي.\nشخصيا أستخدمه لتذكر كل أنواع الحقائق المتعلقة بعائلتي وحياتي الاجتماعية؛ حول مدينتي وأسفاري؛\nوحول هواياتي. سأصف بعض عادات الاستخدام المفيدة لأنكي وعادات سيئة لتجنبها لاحقا في هذه المقالة.\n\nاستخدمت أنكي لإنشاء أكثر بقليل من 10000 بطاقة بعد أكثر من سنتين ونصف من الاستخدام المنتظم.\nيتضمن هذا انقطاع 7 شهور حين أنشأت القليل جدا من البطاقات الجديدة. أستغرق من 15\nإلى 20 دقيقة يوميا لمراجعة بطاقاتي عندما أكون ملتزما بها. إذا ازدادت المدة لأكثر\nمن 20 دقيقة بشكل متكرر فهذا يعني عادة أنني أضيف بطاقات بسرعة شديدة وأحتاج إلى الإبطاء.\nلكن في بعض الأحيان قد يعني أن علي مراجعات متراكمة من الأيام الماضية (سأناقش هذا لاحقا).\n\nعمليا أستخدم نسخة أنكي للحاسوب لإضافة البطاقات الجديدة، وتطبيق الجوال للمراجعة[^6].\nأراجع بطاقاتي ماشيا لجلب قهوة الصباح، ومنتظرا في الطابور، وفي وسائل النقل، وما إلى ذلك.\nأجد تجربة المراجعة تأملية بشرط أن يكون ذهني صافيا إلى حد جيد. بينما إذا لم يكن ذهني صافيا،\nأجد المراجعة أكثر صعوبة، وقد يسبب أنكي لي مزيدا من التشتت.\n\nواجهت صعوبة في البدء باستخدام أنكي. عديد من معارفي نصحوني بشدة باستخدامه (أو أنظمة شبيهة)،\nوعلى مر السنين حاولت استخدامه عدد مرات، واستسلمت في كل مرة بسرعة. عندما أفكر بهذا الآن،\nأظن أن هناك عوائق عظيمة يجب اجتيازها لكي تجعل من استخدام أنكي عادة.\n\nما جعل أنكي أخيرا يروق لي ويصبح عادة هو مشروع شرعت بإنجازه كمزحة.\nكنت محبطا لسنين حيال فشلي في تعلم سطر أوامر Unix بشكل جيد. لقد تعلمت الأوامر الأساسية\nفقط. إن تعلم سطر الأوامر قوة خارقة لكل من يبرمج، لذلك بدت لي كشيء يُستحسن بشدة تعلمه.\nلذلك تسآلت للتسلية ما إذا كان من الممكن استخدام أنكي لحفظ كتاب صغير حول سطر أوامر يونكس عن ظهر قلب.\n\nوقد نجح الأمر!\n\nاخترت كتاب  “Macintosh Terminal Pocket Guide” من O'Reilly Media للمؤلف Daniel Barrett.\nلا أعني حرفيا أنني حفظت نص الكتاب كاملا عن ظهر قلب[^7]. لكنني حفظت معظم أفكار الكتاب،\nبالإضافة إلى الأسماء، وتراكيب الأوامر، وخيارات معظم الأوامر في الكتاب.\nباستنثاء أشياء لم أتخيل حاجتي لها. لكنني حفظت معظم ما تخيلت حاجتي لاستخدامه.\nفي النهاية لقد غطيت من 60 إلى 70 بالمئة من الكتاب، متجاوزا الأجزاء التي لم تبدُ\nذات أهمية لي. مع ذلك، زادت معرفتي لسطر الأوامر لدرجة عظيمة.\n\nاختيار هذا الهدف السخيف، لكن المفيد للغاية، أعطاني ثقة كبيرة باستخدام أنكي.\nكان هذا مثيرا، وأثبت بوضوح أن أنكي يجعل من السهل علي تعلم أشياء كان تعلمها مملا وصعبا\nسابقا بدونه. جعلت هذه الثقة أيضا من السهل علي جعل أنكي عادة. في الوقت نفسه،\nساعدني المشروع أيضا على تعلم واجهة أنكي، وأتاح لي تجربة طرق مختلفة لطرح الأسئلة.\nبعبارة أخرى، لقد ساعدني على بناء المهارات اللازمة لاستخدام أنكي بشكل جيد.\n\n### استخدام أنكي لقراءة شاملة لورقة بحثية في مجال غير مألوف\n\nأجد أنكي مفيدا جدا عند قراءة أوراق بحثية، خصوصا في مجالات خارج تخصصي.\nكمثال عن كيفية عمل هذا، سأسرد تجربتي مع قراءة ورقة سنة 2016[^8] التي تصف AlphaGo،\nنظام الحاسوب من Google DeepMind والذي هزم بعضا من أقوى لاعبي لعبة Go في العالم.\n\nبعد المبارة حيث تغلب ألفا غو على Lee Sedol، واحد من أقوى لاعبي غو في العالم، اقترحت\nعلى مجلة Quanta أن أكتب مقالة عن النظام[^9]. كان ألفا غو موضوعا ساخنا في وسائل الإعلام\nفي ذلك الوقت، وكانت الزاوية المشتركة الأكبر في القصص هي الزاوية الإنسانية التي\nتتصور AlphaGo كجزء من قصة صراع قائم طويل بين الإنسان والآلة، مع بعض التفاصيل التقنية،\nالمضمنة غالبا للتنويع.\n\nأردت أخذ زاوية مختلفة. خلال التسعينيات والعقد الأول من الألفينيات، اعتقدت أن ذكاء اصطناعيا\nعاما يوازي الذكاء البشري أو يفوقه ما زال بعيدا جدا في المستقبل. سبب هذا هو أنه في ذلك الوقت\nلم يجرِ الباحثون سوى تقدما بطيئا في بناء أنظمة حدسية للتعرف على الأنماط، من النوع الذي\nيدعم البصر والسمع البشريين، كما في لعب ألعاب مثل غو. على الرغم من جهود عظيمة من باحثي\nالذكاء الاصطناعي، عديد من إنجازات إيجاد الأنماط والتي يجدها البشر غاية في السهولة\nبقية مستحيلة للآلات.\n\nمع أننا صنعنا تقدما بطيئا جدا بخصوص هذه المشاكل لوقت طويل، بدأ التقدم بالتسارع حول سنة 2011،\nمشحونا بتقدمات في الشبكات العصبية المتعمقة. مثلا، تحولت أنظمة رؤية الآلة من كونها فظيعة إلى\nأن أصبح من الممكن مقارنتها ببصر البشر في مهام معينة محدودة. بحلول وقت إطلاق ألفا غو،\nأصبح من الخطأ القول بأننا لا نملك فكرة عن كيفية بناء أنظمة حواسيب للبحث الحدسي عن الأنماط.\nمع أننا لم نحل المشكلة تماما بعد، فإننا نصنع تقدما سريعا. كان ألفا غو جزءا كبيرا من القصة،\nوأردت في مقالتي استكشاف فكرة بناء أنظمة حواسيب تحاكي الحدس البشري هذه.\n\nمع أنني كنت متحمسا، كتابة مثل هذه المقالة سيكون صعبا. إنها ستتطلب فهما عميقا\nللتفاصيل التقنية لألفا غو أكثر من مقالة صحفية معتادة. لحسن الحظ، لدي معرفة جيدة\nبالشبكات العصبية، وقد كتبت كتابا عنها[^10]. لكنني لا أعرف شيئا عن لعبة غو،\nأو حول الأفكار العديدة المستخدمة في ألفا غو، والمبنية على مجال يدعى التعليم المعزز.\nكان علي تعلم هذه المواد من الصفر، وكان علي فهم الأفكار التقنية المضمنة جيدا\nلكتابة مقالة جيدة.\n\nإليكم كيف فعلتها.\n\nبدأت بورقة ألفا غو نفسها. بدأت بقراءتها قراءة عجولة. لم أكن أهدف إلى الفهم الشامل،\nبل كنت أفعل شيئين اثنين. أولا، كنت أحاول التعرف على الأفكار الأكثر أهمية في الورقة.\nما أسماء التقنيات الأهم التي علي تعلمها؟ ثانيا، كان هناك عملية كنس للبحث عن\nالحقائق الأساسية التي يمكنني فهمها بسهولة، وهذا سيفيدني طبعا. أشياء مثل المصطلحات\nالأساسية، وقواعد لعبة غو، وما إلى ذلك.\n\nإليكم بعض الأمثلة عن أنواع الأسئلة التي أضفتها إلى أنكي في هذه المرحلة:\n«ما حجم طاولة لعبة غو؟»؛ «من يلعب أولا في غو؟»؛ «من كم موضع لعب بشري تعلم ألفا غو؟»؛\n«من أين حصل ألفا غو على بيانات تدريبه؟»؛ «ما أسماء النوعين الأساسين للشبكات العصبية\nالتي استخدمها ألفا غو؟»\n\nهذه كلها أسئلة بسيطة كما ترون. إنها من النوع الذي يمكن استخلاصه أثناء المرور الأول على الورقة،\nمع استطرادات من وقت لآخر للبحث في غوغل وويكيبيديا، وما إلى ذلك. كما أن هذه الحقائق\nكان يرجح أنها ستكون مفيدة في بناء فهم أعمق للمواد الأخرى في الورقة بالإضافة إلى\nكونها سهلة الفهم بمعزل.\n\nمررت على الورقة عدة مرات بهذه الكيفية، كاسبا فهما أعمق وأعمق في كل مرة.\nفي هذه المرحلة لم أكن أهدف إلى فهم كامل لألفا غو، بل كنت أحاول بناء فهم لخلفيته.\nإذا تعسر علي فهم شيء ما، كنت أتخطاه ببساطة بدون قلق دوما. لكن كلما مررت على الورقة،\nكان يتوسع نطاق الأشياء التي كان سهلا علي فهمها. وجدت نفسي أضيف أسئلة عن أنواع الميزات\nالمستخدمة كمدخلات لشبكات ألفا غو العصبية، وحقائق أساسية حول بنية الشبكات وما إلى ذلك.\n\nبعد خمس أو ست قراءات للورقة، رجعت لأحاول أن أقرأها قراءة شاملة. كان الهدف\nهذه المرة فهم تفصيلي لألفا غو. أنا الآن أفهم معظم المعلومات السياقية، وكان من\nالسهل نسبيا قراءة الورقة قراءة شاملة، أسهل بكثير من قراءة الورقة دفعة واحدة بدون تحضير طبعا.\nلا تسئ فهمي: ما زالت قراءة الورقة صعبة، لكنها أسهل بكثير مما لو لم أقرأها قراءات تحضيرية.\n\nبعد قراءة شاملة للورقة، عدت لأقرأها قراءة شاملة ثانية بأسلوب مشابه. لقد استوعبت المزيد.\nفي هذا الوقت، فهمت نظام ألفا غو بشكل جيد. كان كثير من الأسئلة التي أضفتها إلى أنكي\nعالي المستوى، أحيانا تصل هذه الأسئلة لكونها اتجاهات نحو بحوث أصلية جديدة.\nلقد فهمت ألفا غو جيدا كفاية لأكون واثقا من قدرتي على كتابة الأقسام التي تتعلق به من مقالتي.\n(اشتملت مقالتي عمليا على عدة أنظمة، وليس فقط ألفا غو، وكان علي التعلم عن تلك الأنظمة\nأيضا باستخدام عملية مشابهة، لكنني لم أتعمق بهذا القدر.) استمررت بإضافة أسئلة أثناء\nكتابتي للمقالة، وانتهيت بإضافة مئات الأسئلة بالمجمل. في هذه المرحلة تم إنجاز العمل الأصعب.\n\nكان بإمكاني بالطبع استخدام الملحوظات التقليدية بدلا من استخدام أنكي، مستخدما عملية مشابهة\nلبناء فهم للورقة. لكن استخدام أنكي أعطاني ثقة أنني سأحتفظ بمعظم فهمي على المدى الطويل.\nبعد ما يقارب السنة نشرت DeepMind أوراقا تصف أنظمة تابعة، تعرف بـAlphaGo Zero و AlphaZero[^11].\nرغم أنني لم أفكر كثيرا بألفا غو والتعليم المعزز في الفترة الفاصلة، وجدت أنني أستطيع\nقراءة الورقات التابعة بسهولة. مع أنني لم أحاول فهم هذه الورقات بشكل شامل كما فعلت\nمع ورقة ألفا غو، وجدت أن بإمكاني تحصيل فهم جيد جدا للورقات في أقل من ساعة.\nاحتفظت بمعظم ما فهمته سابقا!\n\nللمقارنة، لو استخدمت طرق أخذ الملحوظات التقليدية في قراءتي الأصلية لورقة ألفا غو،\nلكان فهمي ليتبخر بسرعة، وكانت قراءة الأوراق التالية ستأخذ مني وقتا أطول.\nلذلك فاستخدام أنكي بهذه الطريقة أعطاني ثقة بأنني سأحتفظ بفهمي على المدى الطويل.\nهذه الثقة بدورها تجعل عملية الفهم الأولية ممتعة أكثر، لأنك تؤمن أنك تتعلم للمدى الطويل،\nوليس لتنسى بعد يوم أو أسبوع.\n\nأخذت كل هذه العملية أياما معدودة من وقتي ممتدة على أسابيع قليلة. هذه عمل كثير.\nلكن العائد هو أنني حصلت على أرضية أساسية جيدة في نظرية التعليم المعزز العميق المعاصرة.\nهذا مجال مهم للغاية، وذو فائدة كبيرة في علم الروبوتات، ويعتقد عديد من الباحثين\nأنه سيلعب دورا مهما في تحقيق الذكاء العام الاصطناعي. في أيام قلائل انتقلت من معرفة\nلا شيء عن التعليم المعزز العميق إلى فهم متين لورقة رئيسية في المجال، ورقة استخدمت\nتقنيات عديدة مستخدمة في الحقل بأكمله. بالطبع ما زال أمامي طريق طويل لكي أصبح خبيرا.\nهناك تفاصيل هامة عديدة حول ألفا غو لم أفهمها، وكان ليكون علي بذل جهد أكثر بكثير\nلبناء نظامي الخاص في المجال. لكن هذا الفهم التأسيسي يساعد على بناء خبرة عميقة.\n\n<div class=\"quote\">\n\nحسنٌ، لكن ماذا يمكن للمرء التحقيق باستخدامها؟ ... الآن ولدي كل هذه القوة - روبوت\nميكانيكي لا ينسى أبدا ولا يدعني أنسى ما أريد تذكره - ماذا أختار تذكره؟ –\n[غويرن برانوين](https://www.gwern.net/Spaced-repetition)\n\n</div>\n\nمن الملحوظ أنني كنت أقرأ ورقة ألفا غو لدعم مشروع إبداعي خاص بي، وهو كتابة مقالة\nلمجلة Quanta. هذه مهم: أجد أن أنكي يعمل بشكل أفضل بكثير إذا اُستخدم لخدمة مشروع إبداعي شخصي.\n\nمن الجاذب فكرة استخدام أنكي لتخزين المعلومات ليوم مستقبلي ما بقول مثل «آه، يجب أن\nأتعلم عن جغرافية أفريقا، أو أتعلم عن الحرب العالمية الثانية، أو [...]». هذه أهداف جذابة فكريا\nبالنسبة لي، لكن لدي تعلق عاطفي بها. جربت هذا عدة مرات. يميل هذا إلى توليد أسئلة أنكي باردة\nلا حياة فيها، أسئلة أجد من الصعب التفاعل معها في مراجعة لاحقة، ومن الصعب جدا استيعاب\nأجوبتها وتثبيتها في الذاكرة. المشكلة ربما في الفكرة الأولية حول أنه «يجب» أن أتعلم\nعن هذه الأشياء: عقلانيا، تبدو هذه فكرة جيدة، لكن لدي اتصال عاطفي ضئيل بها.\n\nللمقارنة، عندما أقرأ لدعم مشروع إبداعي، فإنني أصنع أسئلة أنكي أفضل بكثير.\nأجد من السهل التواصل مع الأسئلة والأجوبة عاطفيا. أنا ببساطة أولي لها اهتماما أكبر،\nوهذا يصنع فرقا. لذلك مع أن من الجذاب استخدام بطاقات أنكي للتحضير لاستخدام\nمستقبلي (مفترض ربما)، من الأفضل إيجاد طريقة لاستخدام أنكي كجزء من مشروع إبداعي ما.\n\n<div class=\"quote\">\n\nادرس بجد ما يهمك أكثر، بالطريقة الممكنة الأكثر فوضوية، واستهتارا، وإبداعا. –\nريتشارد فاينمان\n\n</div>\n\n### استخدام أنكي للقراءة السطحية للأوراق البحثية\n\nمعظم قراءاتي المعتمدة على أنكي أكثر سطحية بكثير من قراءتي لورقة ألفا غو.\nبدلا من قضاء أيام على ورقة، عادة ما أقضي من 10 إلى 60 دقيقة، وأحيانا أكثر للأوراق\nالجيدة جدا. إليكم بعض الملاحظات حول عادات وجدتها مفيدة للقراءة السطحية.\n\nكما ذكرت سابقا، أقوم بمثل هذه القراءة عادة كجزء للبحث المصاحب لمشروع ما.\nأجد مقالة جديدة (أو مجموعة مقالات)، وعادة ما أقضي عدة دقائق أقيّمها.\nهل يرجح أن تحتوي المقالة على فهم عميق أو محفز لمشروعي - أسئلة جديدة، أو أفكار جديدة،\nأو طرق جديدة، أو نتائج جديدة؟ إذا كان كذلك، فسأقرؤها.\n\nلا يعني هذا قراءة كل كلمة من الورقة. بل أضيف لأنكي أسئلة حول الادعات والأسئلة والأفكار\nالجوهرية للورقة. أجد من المفيد خصوصا استخلاص الأسئلة من الملخص، والمقدمة، والخاتمة،\nوالأشكال التوضيحية والتعليقات عليها. عادة ما أستخرج من 5 إلى 20 سؤالا من الورقة.\nمن السيء عادةً استخراج أقل من 5 أسئلة لأن هذا يجعل الورقة معزولة يتيمة في ذاكرتي.\nأجد لاحقا من الصعب أن أشعر بصلة كبيرة بهذه الأسئلة. بعبارة أخرى: إذا كانت ورقة\nمملة لدرجة أنه من غير الممكن إضافة أكثر من 5 أسئلة جيدة عنها، فمن المفضل ألا أضيف\nأي أسئلة على الإطلاق.\n\nعادة سيئة بخصوص هذه العملية هي إضافة المعلومات المضللة إلى أنكي. يحتوي عديد من\nالأوراق على ادعاءات خاطئة أو مضللة، وإذا حفظت مثل هذه المعلومات في ذاكرتك،\nفإنك تجعل نفسك أكثر غباء.\n\nما السبيل إلى تجنب إضافة المعلومات المضللة إلى أنكي؟\n\nكمثال، دعني أصف لك كيف أضفت ورقة بحثية قرأتها مؤخرا إلى أنكي، مكتوبة من قبل عالمي الاقتصاد\n(بينجامين جونز) و (بروس وينبيرغ)[^12]. تدرس الورقة أعمار العلماء حينما صنعوا أعظم اكتشافاتهم.\n\nيجب أن أقول شيئا أولا: ليس لدي سبب لاعتقاد أن هذه الورقة مضللة! لكن من الجيد أن يكون\nالمرء حذرا. كمثال عن هذا الحذر، كان واحد من الأسئلة التي أضفتها إلى أنكي: «ما متوسط\nالعمر الذي يدعي (جونز) سنة 2011 أن علماء الفيزياء الحاصلين على جائزة نوبل صنعوا\nكشفهم الذي خولهم لنيل الجائزة فيه، بين أعوام  1980-2011؟» (الجواب: 48).\nنوع سؤال آخر هو: «ما الورقة التي ادعت أن علماء الفيزياء الحائزين على نوبل صنعوا كشفهم\nالذي خولهم لنيل الجائزة في متوسط عمر 48 سنة، في فترة 1980-2011؟»\n(الجواب: (جونز) سنة 2011). وهكذا.\n\nأسئلة كهذه تخصص الادعاء المضمن: إننا نعلم أنه ادعاء قيل في ورقة (جونز) سنة 2011،\nوأننا نعتمد على جودة تحليل بيانات (جونز) و (وينبرغ). في الحقيقة، أنا لم أفحص ذلك\nالتحليل بحذر كافي لأن اعتبر ادعاء أن متوسط عمر هولاء العلماء الحائزين على نوبل هو\n48 كحقيقة. لكن المؤكد هو أن الورقة ادعت أن العمر هو 48 سنة. هذه أشياء مختلفة،\nوالسؤال الأخير هو الأفضل لإضافته إلى أنكي.\n\nإذا كنت مهتما خصوصا بجودة التحليل، فقد أضيف سؤالا أو أكثر عما يجعل هذا العمل صعبا،\nمثل: «ما تحدي من تحديات تحديد عمر الحائزين على نوبل في وقت اكتشافاتهم، كما نوقش في ورقة (جونز) سنة 2011؟»\nتتضمن الأجوبة الجيدة: صعوبة تحديد الورقة التي احتوت على العمل الحائز على نوبل؛\nحقيقة أن نشر الأوراق أحيانا يتأخر بسنين؛ أن العمل أحيانا يكون ممتدا على عدة أوراق؛ وهكذا.\nالتفكير حول هذه التحديات يذكرني أنه إذا كان (جونز) و (وينبرغ) غير دقيقين، أو ببساطة\nارتكبوا خطأ متقبلا، فإن أرقامهم قد لا تكون صحيحة. حصل أنني في هذه الورقة المحددة\nلست مهتما كثيرا بهذه المسائل. لذلك لم أضف سؤالا كهذا إلى أنكي. لكن من الجيد أن\nيكون المرء حذرا في صياغة الأسئلة لكي لا يضلل نفسه.\n\nعادة مفيدة أخرى أثناء قراءة الأوراق هي إضافة الأشكال التوضيحية إلى أنكي. مثلا،\nهذا رسم بياني من ورقة (جونز) سنة 2011 يظهر احتمال أن يكون فيزيائي قد صنع اكتشافه\nالحائز على نوبل بعمر 40 (الخط الأزرق) وبعمر 30 (الخط الأسود):\n\n![مدى تكرار الاكتشافات العظيمة للأعمار 30 و 40](/assets/images/ltm/Jones_figure2011a.png)\n\nلدي سؤال أنكي يقول ببساطة: «تصور الرسم البياني الذي صنعه (جونز) سنة 2011 حول\nمنحنيات احتمالية أن الفيزيائين صنعوا اكتشافاتهم الحائزة على نوبل في سن 30 و 40».\nالجواب هو الصورة الموضحة في الأعلى، وأعد نفسي ناجحا إذا كان تصوري الذهني يدور حول\nهذه الخطوط. يمكنني تعميق صلتي مع الرسم بإضافة أسئلة مثل: «في الرسم البياني الخاص\nبـ (جونز) سنة 2011 حول الاكتشافات الفيزيائية الحائزة على نوبل، ما ذروة احتمالية\nالاكتشاف العظيم في سن 40 [مثلا، النقطة الأعلى في الخط الأزرق في الرسم البياني في الأعلى]؟»\n(الجواب: حوالي 0.8). في الواقع، يمكن بسهولة إضافة عديد من الأسئلة المثيرة حول هذا الرسم.\nأنا لم أفعل هذا، بسبب الوقت المتطلب لصنع مثل هذه الأسئلة. لكنني أجد الشكل العام للرسم أخاذا.\nكما أن من المفيد أن أعرف أن الرسم موجود، وأين يمكنني الوصول إليه إذا أردت تفاصيل أكثر.\n\nقلت سابقا إنني عادة ما أقضي من 10 إلى 60 دقيقة أضيف أسئلة أنكي حول ورقة، مع اعتماد\nالمدة على حكمي للفائدة التي استخلصها من الورقة. على أي حال، إذا كنت أتعلم الكثير،\nوأجد هذا ممتعا، فإنني أستمر بإضافة الأسئلة والقراءة. المصادر الجدية جدا تستحق بذل الوقت.\nلكن معظم الأوراق لا تطابق هذا الوصف، ويحصل لديك تشبع بسرعة. إذا شعرت أن باستطاعتك\nإيجاد شيء له عائد أكبر لقراءته بسهولة، فانتقل إليه. من المفيد ممارسة هذه الانتقالات\nعمدا، لتجنب بناء عادة الرغبة في الاستكمال السلبية في قراءتك. من الممكن غالبا قراءة\nورقة بعمق أكثر، لكن لا يعني هذا أنك لا تستطيع أن تستخرج فائدة أكبر في مكان آخر.\nمن السيء استغراق الكثير من الوقت بقراءة أوراق غير مهمة.\n\n### القراءة الموسوعية باستخدام أنكي\n\nتحدثت عن كيفية استخدام أنكي للقراءة السطحية للأوراق، والقراءة العميقة بعض الشيء أيضا.\nيمكن أيضا من زاوية معينة أن يستخدم أنكي ليس فقط لقراءة الأوراق، بل لـ«قراءة»\nكامل أدبيات البحث في مجال معين. إليكم كيفية فعل هذا.\n\nقد تفترض أن الأساس يقوم على قراءة سطحية لعدد كبير من الأوراق. في الحقيقة، لفهم مجال\nغير مألوف فعلا، عليك أن تطور صلة عميقة مع الأوراق الجوهريةـ، أوراق مثل ورقة ألفا غو.\nإن ما تكسبه من تفاعل عميق مع الأوراق الجوهرية هو أكبر بكثير من أي حقيقة أو تقنية مفردة:\nستكسب إداركا حول ما تبدو عليه نتيجة مؤثرة في مجال كهذا. إنها تساعدك على تشرب العادات\nوالمعايير الأكثر صحية للمجال. تساعدك على تعلم كيف تسأل أسئلة جيدة في المجال،\nوكيف تجمع بين التقنيات. ستبدأ بفهم ما الذي جعل شيئا كألفا غو تقدما عظيما، وحدوده أيضا،\nوتدرك أنه فعلا تطور طبيعي في حقله. لا تُرصَد هذه الأشياء فرديا بأي سؤال أنكي منفرد.\nلكنها ترصد جمعيا بالأسئلة التي يسألها المرء عند التفاعل بعمق مع الأوراق الجوهرية.\n\nعادة ما أبدأ بورقة مهمة حقا لآخذ صورة عن حقل كامل، بشكل أمثل ورقة تقرر نتيجة جعلتني\nمهتما بالحقل في المقام الأول. أقرأ الورقة قراءة كاملة، بشكل مشابه لما فعلته مع ورقة ألفا غو.\nثم أقرأ الأوراق المهمة الأخرى قراءة كاملة، أقرا الـ5-10 أوراق الأفضل في الحقل.\nكما أقرأ أيضا أوراق أقل أهمية (لكنها جيدة) أكثر بكثير قراءة سطحية وتقطع. هذا يعني\nعشرات الأوراق حسب خبرتي حتى الآن، لكن أتوقع أنه في بعض المجالات سأقرأ أخيرا مئات\nأو آلاف الأوراق بهذا الأسلوب.\n\nقد تسأل لم لا أركز على الأوراق الأكثر أهمية فقط؟ جزء من هذا غير مثير للاهتمام:\nوهو أنه من الصعب أن تميز الأوراق الأكثر أهمية. تساعدك القراءة السطحية لعديد من الأوراق\nعلى معرفة الأوراق الجوهرية، بدون بذل الكثير من الوقت للقراءة العميقة لأوراق يظهر\nلاحقا أنها ليست مهمة جدا. لكن هناك أيضا ثقافة يتشربها من يقرأ الأوراق الأساسية\nفي مجال ما: وهي إدراك للتقدم المعتاد، الجانب العملي للمجال. هذا مفيد أيضا، خصوصا\nلبناء صورة عامة لوضع المجال، ولتحفيز أسئلتي الخاصة. في الحقيقة، مع أنني لا أنصح\nببذل قسم كبير من وقتك بقراءة الأوراق السيئة، من الممكن طبعا أن تخرج بفائدة من ورقة سيئة.\nيوجد التحفيز في أماكن غير متوقعة.\n\nهذا ما يدعوه (مورتيمر أدلر) و (تشارلز فان دورين) القراءة الموسوعية (syntopic reading).[^13]\nمع الوقت أبني فهما لأدبيات مجال كامل. ما تم فعله وما لم يتم. بالطبع ليس هذا حرفيا\nقراءة أدب كامل، لكن عمليا إنها قريبة. أبدأ بتعريف المشاكل المفتوحة، والأسئلة التي\nأرغب في أن تجاب شخصيا لكن لا يبدو أنها أجيبت بعد. أتعرف على التقنيات والملحوظات الواعدة،\nلكن التي لا أعلم مآلها بعد. وأحيانا أتعرف على ما يبدو أنه نقط عمياء تشمل المجال كله.\nأضيف أسئلة عن كل هذا إلى أنكي أيضا. بهذه الطريقة، أنكي هو أداة تدعم بحثي الإبداعي.\nإن له قصوراته كأداة بهذا الصدد، حيث إنه لم يصمم لدعم العمل الإبداعي، إنه ليس مثلا معدا\nللاستكشاف الحر داخل مساحة للمسودات. لكن حتى بدون هذا، فإنه مفيد للدعم الإبداعي.\n\nكنت أشرح كيف أستخدم أنكي لتعلم المجالات الجديدة لي بشكل كبير. للمقارنة مع مجال\nأعلمه جيدا، فضولي وتصوري لهذا المجال عادة بالأصل قويان جدا لدرجة أن من السهل تعلم\nحقائق جديدة. ما زلت أجد أنكي مفيدا، لكنه بالتأكيد مفيد أكثر في المجالات الجديدة.\nيقول الرياضياتي الإنجليزي العظيم (جون إيدنسور ليتلوود)[^14]:\n\n > جربت تعلم رياضيات خارج مجالات اهتماماتي؛ بعد مدة كان علي البدء من الصفر.\n\nيوضح هذا شيئا من الجهد العاطفي العظيم الذي اعتدت على أن أجده مطلوبا لتعلم مجال جديد.\nبدون كثير من التحفز، كان من الصعب جدا جعل كثير من المواد في حقل جديد ترسخ في عقلي.\nيفعل أنكي الكثير لحل هذه المشكلة، من جانب معين إنه طرف صانعي عاطفي يساعد على خلق العزم\nاللازم لتحقيق الفهم. إنه لا يحل المشكلة بمفرده، كما ذكرت سابقا، فمن المفيد جدا أن يكون\nلي مساعٍ أخرى (مثل مشروع إبداعي، أو ناس معتمدون علي) للمساعدة على خلق ذلك العزم.\nمع ذلك، يساعد أنكي بإعطائي الثقة بأن بإمكانني ببساطة *تقرير* أنني أريد التعمق في\nمجال جديد، وأحتفظ بمعظم ما أتعلمه وأفهمه. نجح هذا في كل مجالات الفهم التصوري التي\nجربته فيها[^15].\n\nنتيجة مفاجئة للقراءة بهذه الطريقة هي كم تصبح ممتعة أكثر معها. لطالما استمتعت بالقراءة،\nلكن الخوض في مجال جديد صعب كان أحيانا عملا مرهقا، وكثيرا ما انتابتني الشكوك حيال\nنجاحي على الإطلاق بالبدء في المجال. هذا الشك بدوره جعل نجاحي أقل رجحانا. لدي الآن\nالثقة بأنني أستطيع الخوض في مجال جديد وأحصل بسرعة على فهم جيد عميق نسبيا، وراسخ.\nتجعل هذه الثقة القراءة ممتعة أكثر حتى[^16].\n\n### أمثلة أخرى لاستخدام أنكي\n\nبعد أن نظرنا إلى استخدام أنكي لقراءة الأوراق التقنية، لنعد لأمثلة الاستخدام العامة[^17].\nهناك الكثير في هذا القسم، فأثناء قراءتك الأولى له قد ترغب في قراءة النص بسرعة والتركيز فقط\nعلى العناصر التي تثير اهتمامك.\n\n**اجعل أغلب الأسئلة والأجوبة في أنكي ذرية قدر الإمكان**: بمعنى أن كل من\nالسؤال والجواب يعبر عن فكرة واحدة فقط. كمثال، عندما كنت أتعلم سطر أوامر يونكس،\nأدخلت السؤال التالي: «كيف تنشئ رابطا مرنا (soft link) من linkname إلى filename؟»،\nكان الجواب: «`ln -s filename linkname`». لسوء الحظ، كنت أخطئ بالإجابة عن هذا السؤال مرة تلو الأخرى.\n\nكان الحل هو إعادة صياغة السؤال بتقسيمه إلى قسمين. القسم الأول: «ما الأمر الأساسي والخيار\nالمستخدمين لإنشاء رابط يونكس مرن؟» الجواب: «`ln -s …`». والقسم الثاني: «عند إنشاء\nرابط Unix مرن، ما ترتيب مجيء linkname و filename؟» الجواب: «`filename linkname`».\n\nتقسيم هذا السؤال إلى أجزاء أكثر «ذرية» جعل سؤالا اعتدت على الإخطاء بإجابته إلى سؤالين\nأجيبهما بنجاح بانتظام[^18]. والأفضل من ذلك أنني عندما أحتاج إلى إنشاء رابط يونكس\nمرنا عمليا، فإنني أعرف كيف أفعل ذلك.\n\nلست متأكدا من سبب هذا التأثير. أظن أنه جزئيا بسبب التركيز. عندما أرتكب أخطاء في سؤال مركب،\nفإنني أكون عادة مشوشا حول مكمن خطئي بالضبط. يعني هذا أنني لم أكن أركز جيدا على الخطأ،\nلذلك لم أتعلم كثيرا من فشلي. عندما أخطئ في الأسئلة الذرية فإن عقلي يعلم بالضبط أين عليه التركيز.\n\nعموما أجد أن تقسيم أسئلة أنكي إلى أسئلة أكثر ذرية يعود بنفع كبير. إنها طريقة فعالة\nلإعادة صياغة الأسئلة.\n\nلاحظ أن هذا لا يعني أنه لا يجب عليك الاحتفاظ ببعض من السؤال الأصلي. ما زلت أريد\nأن أعرف كيف أنشئ رابط يونكس مرنا، لذلك فمن الجيد إبقاء السؤال الأصلي في أنكي. لكنه يصبح\nسؤالا تكميليا، جزء من هرمية أسئلة تبدأ من الحقائق البسيطة الذرية إلى أفكار أكثر تعقيدا.\n\nبالمناسبة، كون السؤال ذريا لا يعني أنه لا يمكن أن يحتوي على أفكار مقعدة ومفاهيم عالية المستوى.\nخذ السؤال التالي من حقل النسبية العامة: «ما حد dr^2 في مقياس روبرتسون-ووكر؟»\nالجواب *dr^2 / (1 - kr^2)*. من المرجح أن يبدو هذا السؤال غامضا إلا إذا كنت قد\nدرست النسبية العامة. إنه سؤال تكميلي معقد، يفترض أنك تعرف ما مقياس روبرتسون-ووكر،\nوما معنى *dr^2*، وما معنى *k*، وما إلى ذلك. لكن بناء على المعرفة الضرورية المسبقة،\nفإن السؤال والجواب ذرييان لدرجة جيدة.\n\nفائدة لاستخدام أنكي بهذه الطريقة هي أنك تبدأ بتحليل الأشياء إلى أسئلة ذرية. هذا يبلور بجلاء\nالأشياء التي تعلمتها. شخصيا أجد هذه البلورة مريحة، لأسباب أجدها (ويا للعجب) صعبة الشرح،\nلكن فائدة حقيقة واحدة هي أنني عادة ما أجد لاحقا أنه يمكن ربط هذه الأفكار الذرية\nبطرق لم أترقبها في البداية. وهذا يستحق الجهد بجدارة.\n\n**يفضل التفكير باستخدام أنكي كمهارة يجب صقلها**: أنكي برنامج بسيط للغاية: إنه يوفر\nلك إدخال النصوص والوسائط الأخرى، ثم يظهر لك هذه الوسائط بجدول زمني محدد بأجوبتك.\nعلى الرغم من هذه البساطة، إنه أداة قوية للغاية. وككثير من الأدوات، فإنه يتطلب مهارة\nلاستخدامه جيدا. من المفيد التفكير بأنكي كمهارة يمكن تطويرها لمستوى الإتقان،\nومحاولة صقل هذه المهارة للوصول إلى هذا الإتقان.\n\n**ليس أنكي مجرد أداة لحفظ الحقائق البسيطة. إنه أداة لفهم أي شيء تقريبا.**\nهناك مفهوم خاطئ شائع وهو أن أنكي هو فقط لحفظ الحقائق البسيطة الخام، مثل المفردات\nوالتعريفات الأساسية. لكن كما رأينا، من الممكن استخدام أنكي لأنواع فهم أكثر تقدما بكثير.\nبدأت أسئلتي حول ألفا غو بأسئلة بسيطة مثل «كم حجم طاولة غو؟»، وانتهت بأسئلة\nمفاهيمية عالية المستوى حول تصميم أنظمة ألفا غو، حول مواضيع مثل كيف تجنب ألفا غو\nالتعميم الزائد من بيانات التمرين، وحدود الشبكات العصبونية الالتفافية، وما إلى ذلك.\n\nجزء من تطوير مهارة استخدام أنكي هو صقل القدرة على استخدامه لأنواع فهم تتعدى الحقائق الأساسية.\nفي الواقع، عديد من الملحوظات التي رصدتها (والتي سأرصدها في الأسفل) حول كيفية استخدام أنكي\nهي تتعلق فعلا بمعنى فهم شيء. جزئ الأشياء إلى حقائق ذرية. ابنِ هرميات غنية من\nالترابطات والأسئلة التكميلية. لا تضع أسئلة يتيمة. عادات تساعد على التعمق في المادة المقروءة.\nأساليب جيدة (وأخرى سيئة) لطرح الأسئلة. أمثلة عن أنواع الأشياء التي تريد حفظها.\nمهارات أنكي تمثل بشكل ملموس نظريتك لكيفية فهمك؛ سيساعدك تنمية هذه المهارات على\nالفهم بشكل أفضل. إن قول إن كونك خبيرا في أنكي يعني أنك خبير في الفهم هو ادعاء قوي،\nلكن فيه بعض الحقيقة.\n\n**استخدم رزمة واحدة كبيرة:** يسمح لك أنكي بتنظيم بطاقاتك في رزمة ورزم فرعية.\nيستخدم بعض الناس هذا لإنشاء بنية تنظيمية معقدة. اعتدت سابقا على فعل هذا،\nلكنني تدريجيا[^19] دمجت الرزم وفروعها إلى رزمة كبيرة واحدة.\nليس العالم مقسما إلى أعضاء مفصولة بشكل محدد، وأنا أؤمن أن من الجيد أن نجعل أنواع\nمختلفة من الأسئلة تتصادم. في لحظة يسألني أنكي سؤالا حول درجة الحرارة التي يجب\nأن تُطهَى دجاجة فيها. ثم سؤال حول واجهة برمجة جافاسكربت.\nهل يجلب لي هذا المزج أي فائدة؟ لست متأكدا. لم أجد، حتى الآن، أي سبب لاستخدام\nجافاسكربت للتحكم بطبخ دجاجة. لكنني لا أعتقد أن هذا المزج ضار، وآمل أنه محفز إبداعيا،\nويساعدني على تطبيق معرفتي في سياقات غير اعتيادية.\n\n**تجنب الأسئلة اليتيمة:** لنفرض أنني كنت أتصفح الإنترنت وتعثرت على مقالة رائعة حول\nعادات النظافة الخاصة بالسموريات الألبانية العملاقة، موضوع لم أكن أعرف أنني مهتم به،\nلكن تبين أنه موضوع أخاذ. بعد مدة وجيزة أضفت من 5 إلى 10 أسئلة إلى أنكي.\nهذا عظيم، لكن خبرتي تقول لي إنني بعد أشهر قليلة سأجد هذه الأسئلة مملة، وأخطئ فيها\nبشكل متكرر. أعتقد أن السبب هو أن هذه الأسئلة منفصلة كثيرا عن اهتماماتي الأخرى،\nوسأكون عندها قد خسرت السياق التي جعلني مهتما بها في المقام الأول.\n\nأسمي هذه *أسئلة يتيمة*، لأنها ليست متصلة عن قرب بأي شيء آخر في ذاكرتي. ليس سيئا أن\nيكون لدي بعض الأسئلة اليتيمة في أنكي - قد يكون من الصعب أن أعرف ماذا سيكون اهتمامي به زائلا،\nوماذا سينمو ليصبح اهتماما كبيرا متصلا مع اهتماماتي الأخرى. لكن إذا كانت أقلية كبيرة من أسئلتي\nيتيمة، فهذا مؤشر إلى أنني يجب أن أركز أكثر على إضافة أسئلة متعلقة بمشاريعي الإبداعية الرئيسية،\nوأقلل من إضافة أسئلة حول المواد الجانبية.\n\nمن الجيد خصوصا تجنب الأسئلة اليتيمة الوحيدة: أسئلة منفردة منفصلة بشكل كبير عن\nأي شيء آخر. لنفرض على سبيل المثال أنني أقرأ مقالة في مجال جديد، وتعلمت فكرة بدت\nمفيدة خصوصا. عندي قاعدة تنص على عدم إضافة سؤال واحد فقط، بل يجب أن أحاول إضافة\nسؤالين على الأقل، ومن المفضل ثلاث أسئلة أو أكثر. هذا كافٍ عادةً ليكون على الأقل\nنواة معرفة مفيدة. إذا كان سؤالا يتيما وحيدا، فسأخطئ في إجابته بشكل حتمي دائما،\nويكون من مضيعة الوقت أنني أضفته أصلا.\n\n**لا تشارك رزمك:** سئُلِت كثيرا ما إذا كنت أرغب في مشاركة رزمي. لست أرغب. لقد أدركت\nمبكرا جدا أن من المفيد جدا وضع معلومات شخصية في أنكي. لا أعني أي شيء شخصي للغاية - \nفأنا لن أضع أبدا أسرار سوداء عميقة في أنكي، كما لن أضع أي شيء يحتاج للحماية مثل\nكلمات المرور. لكنني أضع بعض الأشياء التي لا أبوح بها بإهمال.\n\nكمثال، لدي قائمة (قصيرة جد!) من الزملاء الساحرين سطحيا والمثيرين للإعجاب والذين\nلن أعمل معهم أبدا، لأنني رأيتهم كثيرا يعاملون الناس بشكل سيء. من الجيد إضافة بعض\nالتفاصيل حول تلك المعاملة، لكي أستطيع أن أتذكر بوضوح لم يجب تجنب ذلك الشخص.\nليس هذا من نوع المعلومات التي من الصحيح نشره بإهمال: قد أكون أسأت فهم أفعال الشخص،\nأو السياق الذي تصرف فيه. لكنها معلومة مفيدة شخصيا لإضافتها إلى أنكي.\n\n**أنشئ رزمك الخاصة:** في موقع أنكي [كثير من الرزم المشاركة](https://ankiweb.net/shared/decks/)،\nلكنني لم أجدها مفيدة كثيرا. السبب الأكبر هو أن صناعة بطاقات أنكي هو فعل فهم بحد نفسه.\nبمعنى أن معرفة الأسئلة الجيدة التي يجب أن تسألها والأجوبة الجيدة، هو جزء مما يعنيه\nفهم موضوع جديد بشكل جيد. إن استخدام رزم شخص آخر هو تخلي عن معظم هذا الفهم.\n\nفي الواقع، أعتقد أن عملية صنع البطاقات تساعد فعلا على التذكر. وجد باحثو الذاكرة\nمرارا أنه كلما كان تشفيرك لذاكرة مفصلا أكثر، كانت الذاكرة قوية. أقصد بالتشفير المفصل\nغناء الترابطات التي تشكلها.\n\nمثلا، من الممكن أن تحاول تذكر الحقيقة المنعزلة التي تقول إن سنة 1962 كانت سنة وضع\nقمر الاتصالات الصناعي الأول (تيلستار) في مداره. لكن طريقة أفضل لتذكر هذه الحقيقة هي ربطها\nمع الحقائق الأخرى. على نحو متبذل لحد ما، قد تلاحظ أن تيلستار تم إطلاقه 5 سنين بعد\nقمر السوفييت الأول، (سبوتنك). لم تأخذ مسألة استخدام الفضاء للاتصالات وقتا طويلا.\nبشكل أقل ابتذالا، أي بتفصيل غني، أجد شخصيا من المثير للعجب حقيقة أن تيلستار وضع\nفي مداره سنة *قبل* ظهور ASCII، والذي يمكن القول إنه المعييار الرقمي المعاصر الأول\nللتواصل النصي. كان للبشرية قمر صناعي قبل أن يكون لها معيار رقمي للتواصل النصي!\nإيجاد مثل هذا الترابط هو مثال عن التشفير التفصيلي.\n\nعملية صناعة بطاقة أنكي نفسها تكاد تكون دوما شكلا من أشكال التشفير التفصيلي.\nإنها تجبرك على التفكير بأشكال بديلة للسؤال، لاعتبار الأسئلة الأفضل، وما إلى ذلك.\nأعتقد أن هذا ينطبق حتى على أبسط البطاقات. وينطبق بشكل مؤكد عندما تصنع بطاقات أكثر تعقيدا،\nبطاقات تربط الحقيقة الأساسية المراد تذكرها مع الأفكار الأخرى (مثل رابط  Telstar-ASCII)، وتبني شبكة أفكار مترابطة غنية.\n\nمع ذلك، هناك بعض الممارسات المفيدة لمشاركة الرزم. مثلا، هناك مجتمعات من طلاب الطب\nيجدون من المفيد مشاركة الرزم وأحيانا بناؤها معا[^20]. كما أنني وجدت الرزم المشاركة\nالتي تتضمن أسئلة أساسية جدا مفيدة، مثل [رزم الفن](https://ankiweb.net/shared/info/685421036)\nالتي تسأل أسئلة مثل من رسم لوحة معينة. لكن لمستويات الفهم الأعمق، فإنني لم أجد بعد\nطرقا جيدة لاستخدام الرزم المشتركة.\n\n**نمِّ استراتيجيات للتشفير التفصيلي / تشكيل الترابطات الغنية:** هذه في الحقيقة\nاستراتيجية فوقية، استراتيجية لتشكيل الاستراتيجيات. مثال عن استراتيجية بسيطة هو\nأن تستخدم *نسخا متعددة من السؤال «نفسه»*. مثلا، ذكرت سابقا سؤالي الاثنين: «ما السن\nالذي يدعي  (جونز) سنة 2011 أن الفيزيائيين الحائزين على نوبل صنعوا كشفهم الذي\nاستحق الجائزة فيه، في فترة 1980-2011؟» و: «ما الورقة التي ادعت أن\nالفيزيائيين الحائزين على نوبل صنعوا كشفهم المستحق للجائزة في متوسط عمر 48، في\nفترة 1980-2011؟» منطقيا، من الواضح أن هذين السؤالين متصلان بشدة. لكن من ناحية\nكيفية عمل الذاكرة، فإنهما مختلفان، ويسببان ترابطات من محفزات مختلفة.\n\n**ماذا عن قصور الذاكرة وتقنيات مشابهة؟** هناك مجموعة معروفة من تقنيات الذاكرة المبنية\nعلى أفكار مثل قصور الذاكرة، طريقة لوكي، وأخرى[^21]. هذا شكل متطرف من التشفير التفصيلي،\nحيث تصنع ترابطات مكانية ومرئية غنية مع المادة التي تريد تعلمها. ها هو (جوشوا فوير)\nينقل محادثة حيث يصف خبير تقنيات التذكر (أيد كود) تقنية أساسية من هذه التقنيات:\n\n> ثم شرح لي (أيد) طريقته لجعل اسم سهل التذكر، والتي استخدمها في منافسة لحفظ الأسماء\n> والكنيات المرتبطة بـ99 صورة وجه مختلفة في حدث حفظ أسماء ووجوه. إنها تقنية\n> وعدني بأنني أستطيع استخدامها لتذكر أسماء الناس في الحفلات والاجتماعات. «التقنية في الحقيقة\n> بسيطة بشكل مضلل» قال (أيد). «إنها تتمحور حول ربط صوت اسم شخص مع شيء يمكنك تخيله بوضوح.\n> إنها تتمحور بالكامل حول إنشاء صورة حية في ذهنك تربط ذاكرتك الذهنية لوجه الشخص مع\n> ذاكرة ذهنية مرتبطة باسم الشخص. عندما تحتاج إلى العودة وتذكر اسم الشخص في وقت لاحق،\n> ستأتي إلى ذهنك فورا الصورة التي صنعتها... لذا، همم، قلت إن اسمك Josh Foer، صحيح؟»\n> رفع حاجبه ومسح ذقنه بشكل مسرحي. «حسنٌ، أتصور أنك تمازحني (joshing) عندما التقينا\n> لأول مرة، خارج قاعة المنافسة، وأتصور نفسي أنقسم إلى أربع (four) قطع كردة فعل.\n> Four/Foer. هل فهمت؟\n> هذه الصورة التافهة مسلية -لي على الأقل- أكثر من اسمك المجرد، ويجب أن ترسخ جيدا في الذهن.»\n\nجربت هذه التقنيات، ومع أنها ممتعة، إلا أنها تبدو أكثر فائدة لحفظ المعلومات التافهة - سلسة أوراق شدة، سلسة أرقام، وما إلى ذلك. يبدو أنها أقل تطورا في مجال المفاهيم\nالأكثر تجريدا، وتجريدات كهذه هي مكمن الفهم الأعمق عادة. من هذا الجانب، فإنها قد تبعد\nعن الفهم حتى. مع ذلك، من الممكن أنني فقط أحتاج إلى إيجاد طرق أفضل لاستخدام هذه الأفكار،\nكما احتجت لوقت لكي أفهم أنكي. من المفيد خصوصا أن أبحث في بعض التقنيات المستخدمة\nمن قبل بعض المتمرسين لتشكيل ترابطات غنية. كما يقول (فوير)، مقتبسا خبير ذاكرة،\nهناك فائدة كبيرة في تعلم «التفكير بطرق يسهل تذكرها أكثر».\n\n**تأتي 95% من فائدة أنكي من الـ5% من الميزات:** في أنكي طرق لتوليد البطاقات تلقائيا،\nووسمها، ونظام إضافات، والكثير. عمليا نادرا ما أستخدم أيا من هذه الميزات. بطاقاتي دائما\nنوع من اثنين: أغلبها بشكل سؤال وجواب بسيطين؛ أقلية كبيرة هي بشكل ما يدعى بـ *cloze*:\nنوع من اختبارات ملء الفراغات. مثلا، أستخدم نوع الكلوز لاختبار نفسي حول اقتباساتي المفضلة:\n\n> \"إذا كان الحاسوب الشخصي حقا __ فإن استخدامه سيغير __ __\"، __، __\"\n> (الجواب: وسطا جديدا، أنماط تفكير، حضارة كاملة، آلان كاي، 1989).\n\nيمكن استخدام الـcloze أيضا لطرح الأسئلة التي لا تتضمن اقتباسات:\n> خدعة أديلسون تعرف أيضا بخدعة __. (الجواب: رقعة الشطرنج)\n\nلم لا أستخدم مزيدا من ميزات أنكي؟ جزء من السبب هو أنني أحصل على فائدة عظيمة من\nالميزات الأساسية فقط. كما أن تعلم استخدام مجموعة الميزات الصغيرة هذه جيدا تطلب وقتا كثيرا.\nإن كرة السلة والسلة أدوات بسيطة، لكن يمكنك قضاء عمر كامل تتعلم استخدامها جيدا.\nبشكل مشابه، يمكن تطوير استخدام أنكي الأساسي بشكل كبير. لذلك فإنني ركزت على تعلم\nاستخدام الميزات الأساسية جيدا.\n\nأعرف كثيرا من الناس الذي يجربون أنكي، ثم يضيعون في متاهة تعلم أكبر قدر ممكن من الميزات\nلكي يستخدموه «بفعالية». إنهم يركضون وراء تحسينات بنسبة 1% عادة. غالبا ما يترك هؤلاء\nالناس أنكي «لأنه صعب جدا»، وهي كلمة مرادفة لـ «شعرت بالقلق حيال أنني لا أستخدمه بشكل مثالي».\nهذا مؤسف. كما ناقشت سابقا، يوفر أنكي ما يقارب 20 ضعف تحسينات مقارنة (لنقل) ببطاقات\nالاستذكار العادية. لذلك فإنهم يتركون تحسنا بنسبة 2000% لأنهم قلقون أنهم يفوتون\nالـ5%، أو 1%، أو (في أحيان كثيرة) 0.1% تحسينات. يبدو الوقوع في مثل هذا الفخ\nجذابا خصوصا للمبرمجين.\n\nلهذا السبب، لا أنصح باستخدام أي ميزات متقدمة عندما يبدأ المرء باستخدام أنكي،\nولا تنصيب أي إضافات. باختصار، لا تصيبنك حالة سيئة من مرض فعالية المبرمج.\nتعلم استخدام أنكي للأسئلة والأجوبة الأساسية، وركز على استكشاف أنماط جديدة داخل هذا النموذج.\nسيفيدك هذا أكثر بكثير من أي عدد ساعات تقضيها تلعب بالميزات. بعدها، إذا بنيت عادة\nمنتظمة من الاستخدام الجيد لأنكي، يمكنك تجربة الميزات المتقدمة.\n\n**تحدي استخدام أنكي لتخزين حقائق الأصدقاء والعائلة:** جربت استخدام أنكي لتخزين أسئلة\nحول أصدقائي وعائلتي (أسئلة غير حساسة!). إنه يعمل جيدا في أمور مثل «هل [صديقي] نباتي؟»\nلكن استخدامي وُجِه من قبل أسئلة شائكة أكثر. مثلا، لنفرض أنني أتحدث مع صديق حول أولاده،\nلكنني لم أقابلهم أبدا. يمكنني أن أضيف أسئلة مثل «ما اسم ابن [صديقي] الأكبر؟» أو،\nإذا تحدثنا عن الموسيقا، قد أضيف سؤالا مثل: «ما اسم موسيقي يحبه [صديقي]؟»\n\nالنية وراء مثل هذه التجربة حسنة. لكن طرح مثل هذه الأسئلة عادة ما يشعرني بعدم الارتياح.\nإنها تبدو كثيرا كافتعال الاهتمام بأصدقائي. هناك عرف اجتماعي قوي ينص على أنك إذا تذكرت\nذوق صديقك في الموسيقا أو أسماء أولاده، فهذا لأنك مهتم بذلك الصديق. يبدو استخدام\nأداة تساعد على التذكر هنا مصطنعا بعض الشيء، لي على الأقل.\n\nتحدثت مع أصدقاء عدة عن هذا الأمر. معظمهم قال الشيء نفسه: إنهم يقدرون أنني أتعب نفسي\nفي المقام الأول، ويجدون من اللطيف أنني أقلق كثيرا حيال كون هذا مصطنعا. لذلك ربما\nمن الخطأ القلق. مع ذلك، ما زالت لدي مشكلة مع هذا الأمر. كيفت أنكي لأشياء أقل شخصية،\nأشياء مثل تفضيلات طعام الناس. وربما مع الوقت سأستخدمه لتخزين حقائق شخصية أكثر،\nلكنني آخذ الأمر برويّة الآن.\n\n**الذاكرة الإجرائية والذاكرة التقريرة:** هناك فرق كبير بين تذكر حقيقة وإتقان عملية.\nمثلا، مع أنك قد تتذكر أمر يونكس عندما يطلب منك في سؤال أنكي، لا يعني هذا أنك ستلاحظ\nفرصة لاستخدام الأمر في سياق سطر الأوامر وتكتبه براحة. وشيء آخر أن تجد طرقا جديدة إبداعية\nلجمع الأوامر التي تعرفها من أجل حل مشاكل صعبة.\n\nبعبارة أخرى: لاستيعاب عملية ما حقا، ليس من الكافي مراجعة بطاقات أنكي. تحتاج إلى إجراء\nالعملية في سياقها. وتحتاج إلى حل مشاكل حقيقة باستخدامها.\n\nمع ذلك، فإنني وجدت عملية النقل سهلة جدا. في حالة سطر الأوامر، فأنا أستخدمه بوتيرة كافية\nلأن تكون لدي فرص كثيرة لتطبيق معرفتي عن سطر الأوامر المخزنة في أنكي. مع الوقت، تصبح\nالمعرفة التقريرية هذه معرفة إجرائية أستخدمها بانتظام في سياقها. مع ذلك، من الجيد فهم أكثر\nمتى يحصل النقل ومتى لا يحصل. والأفضل من هذا هو نظام ذاكرة يتم دمجه مع بيئة عملي الحقيقة.\nمثلا، قد يختبرني في أوامر يونكس في بيئة سطر أوامر حقيقية. أو ربما يطلب مني أن أحل مشاكل\nعالية المستوى في سطر الأوامر.\n\nأجريت تجربة واحد بهذا الخصوص: محاكاة إدخال الأوامر عندما أراجع بطاقات أنكي.\nلكن انطباعي الشخصي هو أن هذا لا يعمل جيدا وغير مريح، لذلك فقد توقفت عن فعله:\n\n**التخلي عن «الأسماء لا تهم»:** لقد درست الفيزياء النظرية. هناك قصة شهيرة في الفيزياء،\nمروية من قبل ريتشارد فاينمان، تقلل من قيمة معرفة أسماء الأشياء. كان فاينمان في طفولته\nيلعب في حقل مع طفل متذاكي. إليكم ما حدث برواية فاينمان[^22]:\n\n> قال طفل لي: «هل ترى ذاك الطائر؟ من أي نوع هو؟»\n>\n> قلت: «ليس لدي أدنى فكرة عن نوعه.»\n>\n> قال الطفل: «إنه طائر السمنة بنّي الحنجرة. لم يعلمك أبوك شيئا!»\n>\n> لكن كان العكس. إنه [والد فينمان] بالفعل قد علمه: قال: «هل ترى ذاك الطائر؟»\n> «إنه هازج سبنسر.» (علمت أنه لم يكن يعرف الاسم الحقيقي.)\n> «حسنٌ، إنه Chutto Lapittida في الإيطالية. Bom da Peida في البرتغالية...\n> تستطيع معرفة اسم ذاك الطائر في كل لغات العالم، لكن في نهاية المطاف، ستكون تعرف لا شيء إطلاقا\n> عن الطائر! ستعرف فقط عن أناس من أماكن مختلفة، وماذا يطلقون على الطائر.\n> لذلك لنلقِ نظرة على الطائر ونرَ ما يفعله، هذا ما يهم.»\n> (تعلمت من سنة صغيرة الفرق بين معرفة اسم شيء ومعرفة الشيء.)\n\nفاينمان (أو والده) يفتح نقاشا يدعو للتفكير حول المعرفة الحقيقية: رصد السلوك، وفهم أسبابه،\nوما إلى ذلك.\n\nإنها قصة جيدة. لكن مبالغ فيها: الأسماء تهم. ربما ليست مهمة بقدر ما يعتقد الطفل المتذاكي،\nوهي عادة ليست نوعا عميقا من المعرفة. لكنها أساس يسمح لك ببناء شبكة معرفة.\n\nتم تلقيني فكرة أن الأسماء لا تهم هذه أثناء دراستي العلمية. عندما بدأت باستخدام أنكي،\nفي البداية شعرت بسخافة إضافة أسئلة حول أسماء الأشياء، لكنني الآن أفعل هذا بحماس\nبعد معرفتي أنها خطوة أولى نحو الفهم.\n\nأنكي مفيد لأسماء كل أنواع الأشياء، لكنني أجده مفيدا بشكل خاص للأشياء غير اللفظية.\nأنا أضيف مثلا أسئلة حول الأعمال الفنية، مثل: «كيف تبدو لوحة Howl للفنانة Emily Hare؟».\nالجواب:\n![لوحة Howl للفنانة Emily Hare](/assets/images/ltm/EmilyHareHowl.png)\n\nأضفت ذاك السؤال لسببين. السبب الرئيسي هو أنني أحب أن أتذكر تجربة الرسم من وقت لآخر.\nوالسبب الآخر هو ربط اسم باللوحة[^23]. إذا أردت التفكير بشكل تحليلي أكثر باللوحة - لنقل،\nحول الاستخدام الذكي للألوان - فقد أضيف أسئلة مفصلة أكثر. لكنني راضٍ عن ترسيخ تجربة\nالصورة فقط في ذاكرتي.\n\n**ماذا تفعل عندما تتراكم عليك المراجعات؟** يصبح أنكي عسيرا عندما تتأخر بمراجعة البطاقات.\nإذا توقفت يوم أو اثنين - أو خمسين - تبدأ البطاقات بالتراكم. من المخيف العودة لتجد\nأن لديك 500 بطاقة لتراجعها في يوم واحد. والأسوأ حتى هو أنه إذا تركت عادة أنكي،\nفقد تتراكم عليك كمية ضخمة. توقفت بشكل شبه تام عن استخدام أنكي لمدة 7 شهور،\nوعدت لأجد آلاف البطاقات المتراكمة.\n\nلحسن الحظ، لم يكن من الصعب جدا التدارك. لقد حددت لنفسي أقساطا متصاعدة تدريجيا\n(100، 150، 200، 250، وأخيرا 300) من البطاقات كل يوم، وأنهيت هذه الأقساط كل يوم\nلأسابيع عدة حتى استطعت التدارك.\n\nمع أن هذا لم يكن صعبا جدا، إلا أنه كان مثبطا بعض الشيء. كان من الجيد لو كان في أنكي\nميزة «تدارك» حيث يوزع البطاقات الزائدة على فترة أسابيع قادمة قليلة في جدولك،\nلكن هذا غير موجود في أنكي. على كل حال، هذه عقبة، لكنها تخطيها ليس صعبا جدا.\n\n**استخدام أنكي لواجهات البرمجة، والفيديوهات، والندوات، والمحادثات، والويب، والأحداث، والأماكن:**\nتقريبا كل شيء قلته سابقا عن معالجة الأوراق البحثية من خلال أنكي ينطبق أيضا على الموارد الأخرى.\nإليكم بعض الإرشادات. فصلت مناشقة واجهات البرمجة إلى ملحق منفصل تستطيع\n[قراءته في الأسفل](#Anki_APIs) إذا كنت مهتما.\n\nللندوات والمحادثات مع الزملاء أجد من المفيد على غير المتوقع تحديد أقساط أنكي.\nعلى سبيل المثال، للندوات أحاول أن أجد على الأقل ثلاث أسئلة عالية الجودة لإضافتها\nإلى أنكي، للمحادثات المطولة، سؤال واحد على الأقل. وجدت أن تحديد الأقساط يساعدني على التركيز أكثر،\nخصوصا خلال الندوات. (أجد *نظريا* التركيز في المحادثات الفردية أسهل بكثير.)\n\nأنا عشوائي أكثر حيال الفيديوهات، والأحداث، والأماكن. من الجيد، لنقل، أن أضيف 3-5 أسئلة\nأنكي بشكل منهجي بعد الخروج في رحلة ما أو الذهاب إلى مطعم جديد، لمساعدتي على تذكر التجربة.\nأفعل هذا أحيانا. لكنني لست منهجيا لدرجة كبيرة.\n\nأميل إلى إضافة بطاقات أنكي أثناء قراءتي للأوراق والكتب. للندوات والمحادثات وما إلى ذلك،\nأفضل غمس نفسي في التجربة. بدلا من استحضار أنكي، أنشئ ملاحظة ذهنية (أو ورقية)\nعما أريد إضافته إلى أنكي بسرعة. ثم أدخلها إلى أنكي لاحقا. يتطلب هذا بعض الانضباط؛\nإنه سبب من الأسباب التي تجعلني أفضل تحديد قسط صغير، حيث يتوجب علي فقط إدخال\nبعض الأسئلة لاحقا بدلا من الكثير.\n\nتنبيه حيال الكتب: قراءة كتاب كامل هو التزام كبير، وإضافة بطاقات أنكي بانتظام قد يبطئك كثيرا.\nمن الجيد أخذ هذا بعين الاعتبار عند تقرير حجم ما تريد إضافته إلى أنكي. أحيانا يكون كتاب مليئا جدا\nبالمعلومات الرائعة ويستحق الوقت المصروف لإضافة كثير من الأسئلة عنه. لكن إضافة كل شيء تراه\nإلى أنكي بدون تفكير هو عادة سيئة وقعت بها أحيانا.\n\nليس ما تضيفه إلى أنكي قرارا تافها: أضف الأشياء التي تخدم أهدافك بعيدة المدى.\nنحن نصبح ما نتذكره من زاوية معينة، لذلك يجب أن نكون حريصين حول ما نتذكره[^24].\nهذا صحيح دوما، لكن أنكي يجعله خصوصا صحيحا.\n\nمع كل ذلك، عادة استخدام ممتعة هي العودة إلى ملاحظاتي القديمة قبل أنكي حول الكتب\nوإضافتها إلى أنكي. غالبا ما يمكن إنجاز هذا بسرعة، ويعود علي بنفع كبير مقابل الوقت\nالذي بذلته في الكتب التي نسيتها تقريبا الآن.\n\nمسألة لم أحلها بعد هي كيف يمكنني جمع أنكي مع عملية أخذ الملاحظات لمشاريعي الإبداعية.\nلا يمكنني استبدال أخذ الملاحظات بأنكي، إنها بطيئة جدا، ولكثير من الأشياء استخدام سيء\nلذاكرتي طويلة الأمد. في الجانب الآخر، هناك فوائد كثيرة لاستخدام أنكي للأشياء المهمة -\nوصول مرن للذاكرة هو في جوهر كثير من الفكر الإبداعي. علميا أجد نفسي غريزيا ولا منهجيا\nأدون بعض الأشياء كملاحظات، وأخرى كأسئلة أنكي، وأشياء أخرى أيضا كالاثنين.\nعموما يعمل هذا جيدا، لكن لدي إحساس أنها قد تكون أفضل بكثير إذا طبقت فكرا منهجيا أكثر\nوتجريبا. جزء من المشكلة هو أنني لا أملك نظاما جيدا جدا لأخذ الملاحظات، نقطة انتهى!\nإذا عملت على ذلك أكثر، أظن أن الإجراء كله سيصبح أفضل بكثير. مع ذلك فإنه يعمل بشكل مرضٍ.\n\n<div class=\"quote\">\n\nأعتقد أن سرعة الفكر الترابطي مهمة في العمل الإبداعي. – جون ليتلوود\n\n</div>\n\n**تجنب نمط نعم/لا:** عادة سيئة أقع فيها أحيانا هي إضافة كثير من أسئلة نعم/لا.\nمثلا، إليكم سؤالا ليس جيدا جدا أضفته عند التعلم حول النماذج الرسومية في مجال تعلم الآلة:\n\n> هل حساب دالة التقسيم عملي لمعظم النماذج الرسومية؟\n\nالجواب هو \"نعم\". هذا جيد لهذا النوع من الأسئلة. لكن تفصيل أفكار السؤال يساعد فهمي.\nهل يمكنني إضافة سؤال حول أي من النماذج الرسومية حساب دالة التقسيم لها عملي؟\nهل يمكنني إعطاء مثال عن نموذج رسومي حل دالة التقسيم له غير عملي؟ ماذا يعني أن\nحل دالة التقسيم لنموذج رسومي ما غير عملي على أي حال؟ يجب أن تُعد أسئلة نعم/لا مرشحا\nجيدا لعملية إعادة صياغة الأسئلة على الأقل[^25].\n\n**أليست مساعدات الذاكرة الخارجية كافية؟** نقد شائع لأنظمة مثل أنكي هو أن أجهزة الذاكرة\nالخارجية، مثل غوغل، والويكيات، والمفكرات، يجب أن تكون كافية حقا. أنظمة كهذه هي\nبالتأكيد مفيدة للغاية كمكمل لأنكي إذا استخدمت جيدا. لكن للعمل الإبداعي وحل المشاكل\nهناك شيء مميز حول امتلاك فهم داخلي. إنه يعزز سرعة الفكر الترابطي، والقدرة على\nتجربة تشكيلات منوعة من الأفكار بسرعة، وعلى استشعار الأنماط، بطرق غير ممكنة إذا\nكنت تحتاج إلى البحث عن المعلومات بجهد وباستمرار.\n\nالطلاقة مهمة في التفكير. اقترح (ألان كاي) و (أديل غولدبرغ) [^26] تجربة فكرية حول آلة ناي\nفيها «تأخر ثانية واحدة بين نفخ النوتة وسماعها!». كما لاحظا، هذا «سخيف». بشكل مشابه،\nبعض أنواع الأفكار من السهل جدا تكوينها عندما يكون كل أنواع الفهم المتعلقة مرسخة في الذهن.\nوبهذا الصدد أنكي لا يقدر بثمن.\n\n**إذا كانت أنظمة الذاكرة الشخصية عظيمة جدا، لم ليست مستخدمة بشكل واسع؟**\nيشبه هذا السؤال النكتة القديمة حول عالمي اقتصاد كانا يمشيان في الشارع عندما رأى أحدهما\nورقة 20$. قال: «انظر! هناك 20$ على الأرض!» يرد الآخر: «مستحيل! إذا كانت هنا فعلا،\nكان ليلتقطها أحد ما من قبل.»\n\nالتشبيه جزئي فقط. في الحقيقة، يبدو أنكي كمزود دائم لأوراق 20$ ملقاة على الأرض.\nومن المنطقي سؤال لم ليس مستخدما بشكل أوسع. واحدة من أكثر الأوراق اقتباسا في أدبيات\nالبحث المتعلقة [^27] هي نقاش حول سبب عدم انتشار هذه الأفكار في التعليم.\nتبقى كثير من ملاحظات الورقة صحيحة اليوم مع أنها كتبت سنة 1988.\n\nظني الشخصي هو أن هناك عوامل ثلاث رئيسية:\n- في البحث التجريبي في الذاكرة، يستخف الناس باستمرار من النفع الذي يأتي من توزيع\n  دراستهم بأسلوب مشابه لأنكي. إنهم يفضلون الدراسة المكثفة بآخر دقيقة (cramming) بدلا من ذلك،\n  ويعتقدون أنها تأتي بنتائج أفضل، مع أن كثيرا من الدراسات تظهر العكس.\n- اقترح عالم النفس (روبيرت بجورك) [^28] «مبدأ الصعوبة المرغوب فيها»، وهي فكرة أن الذكريات\n  تقوى بشكل أقصى عندما تُختبر عندما نكون على وشك نسيانها. يلمح هذا إلى أن نظام ذاكرة فعالا\n  سيكون جوهريا صعب الاستخدام بعض الشيء. لبني البشر علاقة معقدة مع النشاطات الصعبة، وعادةً\n  ما يكرهون إنجازها، إلا إذا كان حافزهم قويا (في هذه الحالة قد تصبح الأنشطة الصعبة ممتعة).\n- من الصعب استخدام أنظمة مثل أنكي بشكل جيد، ومن السهل إساءة استخدامها.\n\nمن المثير للاهتمام التفكير بتطوير أنظمة تتغلب على بعض هذه المشكلات أو كلها.\n\n## القسم الثاني: أنظمة الذاكرة الشخصية على نطاق أوسع\n\nفي القسم الأول من هذه المقالة نظرنا إلى نظام ذاكرة شخصي معين، أنكي، من خلال عدسات\nتجربتي الشخصية. في القسم الثاني والأقصر من هذه المقالة سنعالج سؤالين أوسع حول أنظمة\nالذاكرة الشخصية: ما مدى أهميتها كمهارة معرفية؛ وما دور علوم الإدراك في بناء أنظمة ذاكرة شخصية؟\n\n### ما مدى أهمية الذاكرة طويلة الأمد على كل حال؟\n\nيُقلًّل من أهمية الذاكرة طويلة الأمد أحيانا. من الشائع أن يحط الناس من قدر\n«الحفظ عن غيب» (rote memory)، خصوصا في المدارس. سمعت من كثير من الناس أنهم تركوا\nدرسا ما - الكيمياء العضوية كموضوع شائع - لأنه كان «مجرد مجموعة حقائق، وأنا أردت شيئا يتضمن فهما أكثر».\n\nلن أدافع عن التعليم المدرسي السيء، أو أسلوب تعليم الكيمياء العضوية المعتاد. لكن من الخطأ\nالتقليل من أهمية الذاكرة. اعتدت على تصديق مثل هذه الأفكار حول أهمية الذاكرة الضئيلة.\nلكنني الآن أؤمن أن الذاكرة هي في جوهر التفكير.\n\nهناك سببان رئيسيان لهذا التعيير، أولها تجربة شخصية، ثانيها مبني على أدلة من علوم الإدراك.\n\nدعني أبدأ بالتجربة الشخصية.\n\nعلى مر السنين، اعتدت على مساعدة الناس على تعلم مواضيع تقنية صعبة مثل ميكانيكا الكم.\nمع الوقت تبدأ برؤية أنماط حول كيف يستعصي الناس التعلم. نمط شائع هو أن الناس يعتقدون\nأنهم يستعصون الأمور الغامضة المعقدة. لكن عندما تسبر أكثر تجد أن لديهم صعوبة\nفي الرموز والمصطلحات الأساسية. من الصعب فهم ميكانيكا الكم إذا كان لديك تشوش حول كل\nثالث كلمة أو رمز! كل جملة تصبح عناءً.\n\nإنه كأنهم يحاولون تأليف سونيته موسيقية جميلة في الفرنسية لكنهم يعرفون 200 كلمة فرنسية فقط.\nإنهم محبطون ويعتقدون أن المشكلة في صعوبة إيجاد ثيمة جيدة، مشاعر وصور أخاذة وما إلى ذلك.\nبينما المشكلة الحقيقية هي أن لديهم فقط 200 كلمة للتأليف.\n\nإيماني القوي بعض الشيء هو أنه إذا ركز الناس على تذكر الأساسيات، وقلقوا أقل حيال الأمور\nعالية المستوى «الصعبة»، فإنهم سيجدون الأمور عالية المستوى تحل نفسها بنفسها.\n\nمع أنني أعتقد هذا الاعتقاد القوي حول الآخرين، لم أدرك أبدا أنه ينطبق علي أيضا.\nولم يكن لدي أي فكرة عن مدى قوة انطباقه علي. استخدام أنكي لقراءة الأوراق في حقول جديدة\nخلصني من هذا الوهم. أشعر بشعور قريب من القلق حيال كيفية جعل أنكي لتعلم مثل هذه\nالمواضيع سهلا. أنا أؤمن الآن أن تذكر الأساسيات هو العقبة المفردة الأكبر للفهم.\nإذا كان لديك نظام كأنكي للتغلب على هذه العقبة، فستجد القراءة في مجالات جديدة أسهل بكثير.\n\nتجربتي لمدى جعل أنكي لتعلم حقل تقني جديد سهلا زاد بكثير من تقديري الداخلي لأهمية الذاكرة.\n\nهناك أيضا نتائج عديدة من علوم الإدراك حول دور الذاكرة الجوهري في المعرفة.\n\nسلسلة أعمال مثيرة للاهتمام تم القيام بها (بشكل منفصل) من قبل الباحثين\n(أدريان دي جروت) و (هيربرت سيمون)،\nحيث درسوا كيف يحصل الناس على خبرة مركزين على الشطرنج خصوصا[^29]. لقد وجدوا أن\nخبراء الشطرنج على مستوى العالم رأوا الطاولة بشكل مختلف عن المبتدئين. يرى مبتدئ\n«بيدق هنا، قلعة هناك»، وهكذا، كسلسلة من القطع الفردية. بينما يرى الخبراء «قطعا» معقدة\nأكثر بكثير: تجمعات قطع يدركونها كوحدة، ويمكنهم التفكير فيها في مستوى أعلى من\nالتجريد من القطع الفردية.\n\nقدر (سيمون) أن الخبراء يتعلمون من 25000 إلى 100000 من هذه القطع خلال تدريبهم،\nوأن تعلم هذه القطع كان عنصرا أساسيا في كونهم لاعبي شطرنج من الطراز الأول. لاعبون كهولاء\nحقا يرون مواضع الشطرنج بشكل مختلف عن المبتدئين.\n\nلم يساعد التعرف على قطع كهذه والتفكير فيها كثيرا في تطوير الخبرة؟ إليكم نظرية\nتخمينية غير رصينة - على حد علمي، لم يتم تأكيدها من قبل علماء الإدراك، لذلك لا تأخذها\nبجدية كبيرة. سأتحدث عنها في سياق الرياضيات بدلا من الشطرنج، حيث الرياضيات هي مجال لدي\nفيه خبرة التحدث مع ناس من كل نطاقات القدرة، من المبتدئين إلى علماء الرياضيات الخبراء.\n\nتصور كثير من الناس عن علماء الرياضيات الخبراء هو أنهم أذكياء للغاية، لديهم نسبة ذكاء عالية،\nوالقدرة على التعامل مع أفكار معقدة جدا في ذهنهم. تصور شائع هو أن ذكاءهم يعطيهم القدرة\nعلى التعامل مع أفكار معقدة جدا. إن لديهم محركا بقوة حصان أعلى ببساطة.\n\nصحيح أن علماء الرياضيات الكبار هم أذكياء جدا عادة. لكن إليكم شرحا مختلفا عما يحدث.\nإن الرياضياتيين الكبار، حسب (سيمون)، تشربوا قطعا رياضياتية أعقد بكثير من الأناس العاديين\nمن خلال العمل الجاد. وهذا يعني أن المواقف الرياضياتية التي تبدو معقدة جدا لنا تبدو\nبسيطة جدا لهم. فليس الأمر أن لديهم ذهنا بقوة حصان أعلى، من جانب قدرتهم على التعامل\nمع تعقيد أكبر. بل إن تعليمهم المسبق أعطاهم قدرات «تقطيع» أكبر، لذلك فالمواقف\nالتي تبدو معقدة لمعظم الناس تبدو لهم بسيطة ويجدون من السهل أكثر تحليلها.\n\nإن فكرة القطع المستخدمة من قبل (سيمون) في دراسته للاعبي الشطرنج أتت من ورقة شهيرة\nمن سنة 1956 مكتوبة من قبل (جورج ميلر)، «الرقم السحري سبعة، زائد أو ناقص اثنين»[^30].\nادعى (ميلر) أن سعة الذاكرة العاملة هي سبع قطع تقريبا. في الحقيقة تبين أن هناك\nاختلافا في هذا الرقم من شخص لآخر، وعلاقة قوية بين سعة الذاكرة العاملة لشخص وقدرات\nذكائه العامة (IQ)[^31]. عموما كلما كانت ذاكرتك العاملة أفضل، كانت نسبة ذكائك أعلى،\nوالعكس صحيح.\n\nإن ما عناه ميلر بالقطع غير واضح بعض الشيء، حيث يكتب:\n\n> يساعد أيضا التفريق بين مصطلحي جزء (bit) وقطعة (chunk) على إبراز حقيقة أننا غير\n> دقيقين جدا حول ما يشكل قطعة معلومات. مثلا، قوة الذاكرة لخمس كلمات حصل عليها Hayes...\n> يمكن بشكل مناسب بدرجة مساوية أن تدعى قوة ذاكرة 15 مقطعا صوتيا، لأن كل كلمة فيها حوالي 3\n> مقاطع صوتية. بديهيا من الواضح أن الخاضعين للتجربة تذكروا 5 كلمات وليس 15 مقطعا صوتيا، لكن\n> الفصل المنطقي ليس واضحا فورا. إننا نتعامل هنا مع عملية تنظيم المدخلات وتجميعها إلى وحدات مشابهة أو قطع،\n> وقد تم صرف كمية كبيرة من التعلم على تشكيل الوحدات المألوفة هذه.\n\nبعبارة أخرى، في رواية ميلر تعني القطعة عمليا *الوحدة الأساسية* للذاكرة العاملة.\nلذلك كان سيمون ومساعدوه يدرسون الوحدات الأساسية المستخدمة في الذاكرة العاملة للاعبي الشطرنج.\nإذا كانت هذه القطع أكثر تعقيدا، فهذا عنى أن ذاكرة اللاعب العاملة لها سعة عملية أكبر.\nعلى وجه الخصوص، شخص بنسبة ذكاء أدنى لكن قدرة على استدعاء قطع أكثر تعقيدا سيكون\nقادرا على تحليل المواقف المعقدة أكثر من شخص بمعدل ذكاء أعلى لكن قطع مُستوعَبة أقل تعقيدا.\n\nبعبارة أخرى، امتلاك قطع أكثر متذكرة في مجال محدد هو إلى حد ما مثل معزز فعال لنسبة ذكاء\nشخص في ذلك النطاق.\n\nحسنٌ، هذا نموذج تخميني غير رصين. بغض النظر عما إذا كان صحيحا، من الواضح أن استيعاب\nقطع عالية المستوى هو جزء جوهري من الحصول على الخبرة. مع ذلك، لا يعني هذا بالضرورة\nأن استخدام أنظمة مثل أنكي سيسرع الحصول على هذه القطع. هذه فقط حجة لصالح كون الذاكرة\nطويلة الأمد تلعب دورا جوهريا في الحصول على بعض أنواع الخبرة. مع ذلك، يبدو مقنعا\nأن الاستخدام المنتظم لأنظمة مثل أنكي قد يسرع عملية الحصول على القطع عالية المستوى\nالمستخدمة من قبل الخبراء[^32]. ومن ثم أن هذه القطع تقع في قلب المعرفة الفعالة،\nمتضمنة قدرتنا على الفهم، وحل المشاكل، والإنتاج.\n\n### التمرين المتباعد\n\nلم يعمل أنكي؟ في هذا القسم سننظر بإيجاز إلى واحدة من الأفكار الرئيسية من علوم الإدراك،\nوالمعروفة *بالتمرين المتباعد*.\n\nلنفرض أنك تعرفت على شخص في حفلة، وقال لك هذا الشخص اسمه. إذا كنت تصغي جيدا،\nولم يكن اسمه غريبا جدا، فمن شبه المؤكد أنك ستتذكر اسمه بعد 20 ثانية. لكن من المرجح أن\nتنسى اسمه بعد ساعة، ومرجح أكثر أن تكون قد نسيت اسمه بعد شهر.\n\nهذا هو اضمحلال الذاكرة. ليست هذه أخبار جديدة! لكن العالم العظيم (هيرمان إبنجهاوس)\nفكر بفكرة جيدة وهي دراسة اضمحلال الذاكرة منهجيا وكميا[^33]. كان مهتما على وجه الخصوص\nفي مدى سرعة اضمحلال الذكريات، وما يسبب هذا الاضمحلال. لدراسة هذا، حفظ إبنجهاوس سلسة من\nمقاطع الكلمات التي لا معنى لها - أشياء مثل \"fim\" و \"pes\" - ولاحقا اختبر نفسه مع تسجيل\nكيف حفظ المقاطع بعد فترات زمنية مختلفة.\n\nوجد إبنجهاوس أن احتمالية تذكر مقطع بشكل صحيح انخفضت (تقريبا) أسّيّا كل مرة.\nيدعى هذا اليوم *منحنى نسيان إبنجهاوس*:\n\n![منحنى نسيان إبنجهاوس](/assets/images/ltm/Ebbinghaus.png)\n\nما الذي يحدد انحناء المنحنى، أي سرعة اضمحلال الذكريات؟ في الوقع يعتمد الاضمحلال\nعلى أشياء عديدة. مثلا، قد يكون أشد انحدارا للمفاهيم الأكثر تعقيدا أو غير المألوفة.\nقد تجد من السهل أكثر تذكر اسم يبدو مشابها لأسماء سمعتها من قبل: لنقل Richard Hamilton بدلا\nمن Suzuki Harunobu. لذلك فسيكون لها منحنى أقل انحدارا. بشكل مشابه، قد تجد من السهل\nأكثر تذكر شيء مرئي من شيء لفظي. أو شيء لفظي أكثر من مهارة حركية. وإذا استخدمت طرق تذكر أكثر\nتفصيلا - المذكرات (mnemonics) مثلا، أو فقط عملت على ربط فكرة مع أشياء أخرى\nتعرفها مسبقا - فقد تنجح بتسطيح المنحنى[^34].\n\nلنقل أنك تعرفت على شخص في حفلة، ثم لم تفكر باسمه لفترة 20 دقيقة. لكن بعدها كان عليك\nتقديمه لشخص آخر، لذلك فعليك استدعاء اسمه إلى ذهنك. فورا بعد ذلك، احتمال تذكرك سيكون\nمرتفعا جدا مجددا. دلت بحوث إبنجهاوس على أن الاحتمالية ستتناقص أسيا بعد إعادة الامتحان،\nلكن معدل الاضمحلال سيكون أبطأ مما كان أوليا. في الحقيقة، ستبطئ الامتحانات التالية الاضمحلال\nأكثر وأكثر، حتى تسطح منحنى الاضمحلال تدريجيا بينما تقوي الذاكرة من خلال مناسبات استدعاء متعددة:\n\n![احتمالية التذكر بعد عدة مراجعات في منحنى نسيان إبنجهاوس](/assets/images/ltm/Ebbinghaus_repeat.png)\n\nهذا التزايد التدريجي في وقت الاضمحلال يقع في أساس تصميم أنكي وأنظمة ذاكرة مشابهة.\nلهذا السبب يرفع أنكي تدريجيا من الفواصل الزمنية بين المراجعات.\n\nإن هذه الظواهر جزء من مجموعة أوسع من الأفكار التي تمت دراستها بتوسع من قبل العلماء.\nهناك عدة مصطلحات متعلقة مستخدمة لمجموعة الظواهر هذه. لكن سنستخدم عبارة «التمرين المتباعد»،\nوالتي تعني التمرين الموزع عبر الزمن، مثاليا بطريقة مصممة لتعزيز الترسيخ الأمثل.\nهذا عكس الدراسة المكثفة حيث يحاول الناس حصر كل دراستهم في جلسة واحدة فقط معتمدين\nعلى التكرار.\n\n### حول دور علوم الإدراك في تصميم أنظمة لتعزيز المعرفة\n\nمنذ وقت إبنجهاوس، كان هناك آلاف الدراسات حول تنويعات مختلفة من التمرين المتباعد.\nعلمتنا هذه الدراسات الكثير حول سلوك الذاكرة طويلة الأمد. من أهم ذلك أنها أظهرت\nبشكل مؤكد أن التمرين المتباعد يتفوق على التمرين المكثف[^35].\nمن الجذاب القفز إلى أدبيات البحث واستخدامها كدليل لتصميم أنظمة الذاكرة[^36].\nلكن من الجيد التفكير حول حدود أدبيات البحث كدليل لتطوير الأنظمة.\n\nمع أن العلماء أنجزوا عددا عظيما من الدراسات حول التمرين المتباعد، ما زالت كثير\nمن الأسئلة الجوهرية حوله غير مفهومة تماما.\n\nإننا لا نفهم بالتفصيل لم يحدث الاضمحلال الأسي للذاكرة، ومتى يتوقف هذا النموذج عن العمل.\nليس لدينا نماذج جيدة عما يحدد معدل الاضمحلال، ولم يتغير لأنواع مختلفة من الذكريات.\nإننا لا نفهم لم يأخذ الاضمحلال وقتا أكثر بعد المراجعات التالية. ولدينا فهم ضئيل\nحول الطريقة الأفضل لتوسيع الفواصل بين المراجعات.\n\nبالطبع هناك عدة نظريات جزئية للإجابة عن هذه الأسئلة وأسئلة أخرى جوهرية. لكن ليس\nلدينا نظرية موحدة، يمكن التنبؤ بها كميا، ومقبولة بشكل واسع. لذلك من هذا الجانب،\nنعرف القليل حول التمرين المتباعد، ونحن بعيدون عقودا (إن لم يكن أكثر) من فهم كامل بشكل معقول.\n\nلتوضيح هذه النقطة بشكل ملموس، دعني أذكر مثالا واحدا: هناك أوقات حيث لا تضمحل ذكرياتنا،\nلكن تصبح أفضل مع الوقت، حتى عندما لا تكون واعيا باستدعاءات صريحة لها. قد تكون قد لاحظت\nهذا في حياتك الخاصة. لعالم النفس  (ويليام جيمس) ملاحظة مازحة أعزاها إلى مؤلف ألماني\nغير مسمى، تقول[^37]\n\n> نحن نتعلم السباحة في الشتاء، والتزلج على الجليد في الصيف.\n\nفي الواقع، تم التحقق مخبريا من مثل هذه الظاهرة في دراسة سنة 1895 لـ (أليكس أويهرن)[^38].\nمع أن التجارب اللاحقة أكدت هذه النتيجة، إنها تعتمد بشكل حساس على المادة المحفوظة،\nوالفواصل الزمنية الدقيقة، وعدة متغيرات أخرى. من جانب، يعارض هذا منحنى نسيان إبنجهاوس.\nقاعدة عملية جيدا جدا هي أن منحنى إبنجهاوس ينطبق تقريبا، لكن هناك استثناءات،\nعادةً ممتدة لأوقات محدودة، ولأنواع مواد مخصصة جدا.\n\nلم أذكر هذا لأزعزع إيمانك بنموذج إبنجهاوس، بل كتحذير: الذاكرة معقدة، إننا لا نفهم\nعديدا من الأسئلة الكبيرة جيدا، ويجب أن نكون حذرين قبل الإيمان كثيرا بأي نموذج.\n\nمع كل هذا: الظواهر الأساسية خلف التمرين المتباعد ومنحنى إبنجهاوس حقيقية، وكبيرة،\nوتم تأكيدها بتجارب كثيرة. ظواهر كالمكتشفة من قبل (أويهرن) أقل أهمية بالمقارنة.\n\nيضعنا هذا في موقف مثير للاهتمام: لدينا فهم كافٍ للذاكرة لكي نحكم أن نظاما كأنكي\nيجب أن يساعد كثيرا. لكن عديدا من القرارات المطلوبة في تصميم نظام كهذا يجب أن تؤخذ\nعلى أساس *حسب الحاجة*، موجهة بالحدس والفرضيات غير المؤكدة. إن التجارب\nفي الأدبيات العلمية *لا* تبرر قرارات التصميم هذه بعد. السبب هو أن هذه الدراسات غالبا ليس\nهدفها معالجة هذه الأسئلة. إنها تركز على أنواع محددة من المعلومات المراد حفظها. أو تركز\nعلى فترات زمنية قصيرة نسبيا - التذكر على فترة يوم أو أسبوع، لكن ليس سنوات. عمل كهذا\nيساعدنا على بناء نظرية أفضل للذاكرة، لكنه لا يجاوب بالضرورة على الأسئلة المطلوبة\nلكي يصمم المصممون أنظمة.\n\nبالتالي، يجب أن يبحث مصممو الأنظمة في مكان آخر، في التجارب غير الرسمية والنظريات.\nأنكي مثلا يستخدم خوارزمية تباعد مطورة من قبل (بيوتر وزنياك) على أساس تجاربه الشخصية[^39].\nمع أن (وزنياك) قد نشر [عددا من الأوراق البحثية](https://www.supermemo.com/en/archives1990-2015/english/publicat)\nإلا أنها تقريرات غير رسمية ولا تخضع لضوابط أدبيات علوم الإدراك المعتادة.\n\nمن جانب، ليس هذا مرضيا: ليس لدينا فهم جيد جدا لجدول مباعدة جيد نستخدمه. لكن أي نظام\nيجب أن يستخدم جدولا ما، لذلك فيفعل المصممون أفضل ما عندهم. يبدو هذا مرجحا للعمل بشكل\nأفضل من المقاربات الساذجة، لكن على المدى الطويل من الجيد أن تكون لدينا مقاربة مبنية\nعلى نظرية مفصلة للذاكرة البشرية.\n\nرد واحد على هذا هو أنك يجب أن تصمم علميا، وتمتلك أدلة تجريبية جيدة لكل قرارات التصميم.\nسمعت هذا يطرح كنقد لمصممي أنظمة مثل أنكي، أنهم يأخذون تخمينات *حسب الغرض* كثيرا،\nوليست مدعومة بفهم علمي.\n\nلكن ما الذي يجب عليهم فعله؟ ينتظرون خمسين أو مئة سنة، حتى تأتي الأجوبة؟ يتركون التصميم،\nويصبحون علماء ذاكرة للسنوات الثلاثين التالية، لكي يمكنهم إعطاء أسئلة مناسبة «علمية» على\nكل الأسئلة التي احتاجوا إجابتها في تصميم أنظمتهم؟\n\nليست هذه طريقة عمل التصميم، ولا ما يجب أن يكون عليه.\n\nإذا انتظر المصممون حتى تأتي كل الأدلة، لن يصمم أحد أي شيء. عمليا تحتاج إلى تصميم\nشجاع إبداعي يستكشف عدة أفكار، لكن مُلهَم ومدعوم (لكن ليس محصورا جدا) بما يعرف بالعلمي.\nبشكل مثالي، على طول هذا سيكون هناك لولب تفاعل أبطأ، حيث ستطرح قرارات التصميم أسئلة\nحول الذاكرة، والتي ستقود إلى تجارب علمية جديدة، ومن ثم فهم أفضل للذاكرة يقود إلى\nإمكانيات جديدة للتصميم.\n\nليس توازن كهذه سهل التحقيق. لقد حاول مجتمع التفاعل بين الإنسان والحاسوب\n(human-computer interaction; HCI) تحقيق هذا في أنظمة بنوها، ليس فقط للذاكرة،\nبل لتعزيز المعرفة الإنسانية عموما. لكنني لا أعتقد أن هذا نجح كثيرا. يبدو لي أنهم\nتركوا كثيرا من الشجاعة والخيال والطموح في تصميمهم[^40].\nفي الوقت نفسه، إنهم لا يعملون في مجال علم إدراك خالص - إنهم لا يطورون فهما مفصلا للعقل.\nإيجاد العلاقة الصحيحة بين التصميم الإبداعي وعلم الإدراك هو مشكلة جوهرية للعمل على التعزيز،\nوليست سهلة الحل.\n\nبأسلوب مشابه، من المغري تصور علماء الإدراك يبدؤون بتصميم الأنظمة. مع أن هذا قد يعمل أحيانا،\nإلا أنني أعتقد أن من غير المرجح أن يجلب هذا نتائج جيدة في معظم الحالات. بناء أنظمة فعالة،\nحتى نماذج أولية، صعب. يفقد علماء الإدراك غالبا الخبرات وسعة خيال التصميم اللازمة لفعل هذا جيدا.\n\nيوحي لي هذا بالحاجة إلى حقل منفصل للتعزيز البشري. حقل يأخذ مدخلات من علم الإدراك.\nلكنه سيكون جوهريا علم تصميم، متجه إلى التصميم الشجاع الإبداعي، وبناء أنظمة من\nالنماذج الأولية إلى توظيف واسع النطاق على أرض الواقع.\n\n### شكر وتقدير\n\nبدأ اهتمامي بأنكي جزئيا من خلال كتابات [غويرن برانوين](https://www.gwern.net/Spaced-repetition) و\n[ساشا لندي](https://sasha.wtf/anki-post-1/amp/)\nو [ديري سفيرس](https://sivers.org/srs).\nشكرا لـ (أندي ماتوشيك) و (كيفين سيملر) و  (ماسون هارتمان) و (روبيرت أوكسهورن) على محادثاتهم المتعددة المحفزة حول هذه المقالة.\nأنا ممتن خصوصا لأندي ماتوشيك على محادثات داعية للتفكير وممتعة، خصوصا لإشارته\nإلى كون نظرة أن أنكي يمكن أن يكون مهارة يمكن تطويرها للفهم وليس فقط حفظ الحقائق - غير اعتيادية.\nأخيرا، شكرا لكل من علق على [منشوري في تويتر](https://twitter.com/michael_nielsen/status/957763229454774272) حول أنكي.\n\n\n## الملحق الأول: تحليل لوقت دراسة أنكي {#Anki_analysis}\n\nإليكم تحليلا تقريبيا عن الجهد المطلوب لدراسة بطاقة أنكي لتذكرها لفترة 20 سنة -\nما يمكننا اعتباره بشكل معقول تذكر طيلة الحياة. لاحظ أن هذا التحليل حساس للافتراضات التفصيلية\nالمأخوذة، لذلك لا يجب أخذ تقديرات الوقت بجدية كبيرة. مع ذلك، من المفيد أخذ فكرة عن الأوقات المطلوبة.\n\nعندما تدخل بطاقة أوليا، يتطلب أنكي مراجعات بعد دقيقة ثم 10 دقائق. بعد هذه المراجعات\nيرتفع الفاصل بين المراجعات بشكل كبير إلى يوم واحد. معدل ارتفاع الفاصل بعد ذلك قد\nيتغير قليلا[^41]، لكن في بطاقاتي معدل الارتفاع المتوسط هو مضاعف حوالي 2.4 لكل مراجعة ناجحة.\nيعني هذا أن المراجعات الناجحة ترفع الفاصل بمدة 2.4 يوما، ثم 2.4 * 2.4 = 6.76، وهكذا.\nأخطئ ببطاقة من كل 12 بطاقة وسطيا، لذلك بحدود البطاقة الثانية عشر لدينا فاصل\nيقارب 2.4<sup>9</sup> = 2642 يوما بين المراجعات. لاحظ أننا رفعنا العدد للأس 9 وليس 12، لأن\nالفاصل الزمني لا يصل ليوم واحد قبل المراجعة الثالثة للبطاقة.\n\nإذا جمعت هذه الفواصل، فهذا يشير إلى أن الوقت المعتاد بين المراجعات الفاشلة هو 12 سنة.\nلاحظ أنني لم استخدم أنكي لهذه المدة الطويلة، وقد يكون هذا التقدير متفائلا جدا.\nنستطيع أن نحصل على حد أدنى للوقت بين المراجعات الفاشلة بملاحظة أن معدل الفاصل بين\nمراجعات البطاقات هو 1.2 سنة. الوصول إلى فاصل 1.2 سنة يتطلب حوالي 0.9 سنة من المراجعات\nالسابقة الناجحة، لذلك فوسطيا لبطاقاتي حوالي 2.1 سنة بين المراجعات الفاشلة. لكن\nقد يكون الرقم الحقيقي أكبر بكثير، حيث ليس هناك سبب لافتراض أن مراجعتي القادمة في\nمعظم هذه البطاقات ستكون فاشلة. لذلك لنفرض أن تقديرا متحفظا هو متوسط وقت بين المراجعات الفاشلة\nيمتد بين 4 و 7 سنين.\n\nإذا افترضنا أن متوسط الوقت بين المراجعات الفاشلة هو 4 سنين، فيعني هذا 5 مراجعات فاشلة خلال 20 سنة،\nومراجعة 5 مراجعات فاشلة * 10 مراجعات كل فترة = 50 مرة، لمحصلة 50 * 8 ثانية = 400 ثانية،\nأو حوالي 7 دقائق.\n\nإذا افترضنا بدلا من ذلك أن متوسط الوقت بين المراجعات الفاشلة هو 7 سنين، فيعني هذا\n3 مراجعات فاشلة خلال فترة 20 سنة، ومراجعة 3 مراجعات فاشلة * 11 مراجعة كل فترة = 33 مرة،\nأو محصلة 33 * 8 ثانية ≈ 260 ثانية، أو حوالي 4 دقائق.\n\nلاحظ أنه في نموذج أنكي المراجعات الفاشلة تصفّر فاصل المراجعة إلى 10 دقائق، ثم يوم، ثم 2.4 يوما، وهكذا.\nعمليا يبدو هذا متحفظا كثيرا. بعد مراجعة فاشلة أو اثنتين مع بطاقة عادة ما أتدارك فشلي فيها،\nومن الجيد لو لم يكن أنكي مستبدا جدا في تصفير جدول المراجعة. جدول مراجعة أفضل\nسيقلل من مجمل وقت الدراسة، ولن أتفاجئ إذا كان استمثار وقتي متوسط مكون من حوالي دقيقتين ممكنا.\n\n## الملحق الثاني: استخدام أنكي لتعلم واجهات البرمجة {#Anki_APIs}\n\nاستخدام جيد لأنكي هو لمساعدتك على تعلم واجهات البرمجة. إليكم بعض العادات التي\nتعمل بالنسبة لي، وبعض التحذيرات حول العادات السيئة.\n\nيبدأ الأمر بتقريري أن هناك واجهة برمجية ما أريد تعلمها لاستخدامها في مشروع.\nأحيانا أريد استخدام الواجهة قليلا فقط، لنقل لـ50-100 سطر برمجي، أو حتى 1-10 سطر فقط.\nفي هذه الحالة من الأفضل لي الانطلاق بدون تحضير، بأخذ مقاطع برمجية من مكان ما وتعديلها،\nوالرجوع إلى الوثائق عند الحاجة.\n\nلكن لنفرض أنني أريد استخدام الواجهة بجدية أكير في مشروع. مثلا أردت بناء بعض النماذج\nالأولية باستخدام الرسوميات ثلاثية الأبعاد لمقالتي [الفكر كتكنولوجيا](http://cognitivemedium.com/tat/)،\nوقررت تعلم أساسيات مكتبة [three.js](https://threejs.org/) لجافاسكربت.\n\nعادة سيئة قد تفكر بسلوكها هي التفكير \"آه، يجب أن أتقن الواجهة أولا\"،\nثم تغرق في الدروس التعليمية والوثائق. هذا خاطئ إلا إذا كانت جولة سريعة في درس\nما أو الوثائق. مقاربة أفضل هي إيجاد مقطع برمجي صغير يعمل ويؤدي شيئا يتعلق\nبالوظائف الرئيسية لمشروعك. ليس بالضرورة أن يكون شبيها بكل مشروعك، لكن بشكل مثالي\nيجب أن يطبق ميزة أو اثنتين مشابهتين، ويكون مكونا من عشرات أو مئات الأسطر.\nأعمل على تشغيل الكود، ثم أبدأ بعمل تعديلات بسيطة، وأضيف الوظائف التي أريدها وأزيل\nما لا أريده، وأعمل على فهم الكود وتحسينه.\n\nالشيء العظيم في هذا هو أن علي تغيير من 1 إلى 5 أسطر في الوقت نفسه فقط، وأرى تقدما\nذا معنى نحو أهدافي. هذا مثير. دعني استخدم تشبيها من مجال تعلم الآلة، إنه كإعمال\nخوارزمية أصل التدرج في مساحة مشاريعي ذات المعنى.\n\n<div class=\"quote\">\n\nأميل إلى فقط جعل الأشياء تحدث... أتحمس كثيرا عندما أصنع أشياء وأخرجها إلى الحياة...\nحالما تصبح حية تبدأ بنفسها بإخبارك ما هي. - دان إنغلز \n\n</div>\n\nبالطبع، أثناء هذا سأكون في حالة بحث دائمة في الوثائق، موقع StackOverflow، وما إلى ذلك.\nسأكون أقرأ قطع الكود التي بدأت بها وأفهمها. من المغري إضافة كل هذا إلى أنكي لكن هذا خاطئ:\nإنه يأخذ وقتا طويلا، وقد تضيف كثيرا من الأشياء التي يتبين أنها ليست مفيدة كثيرا لاحقا.\nلكن عندما يكون شيء ما مفهوما مركزيا بوضوح، أو أعلم أنني سأستخدمه كثيرا، فمن الجيد إضافته إلى أنكي.\nبهذا الأسلوب أبني تدريجيا قاعدة معرفية من الأشياء التي أستطيع استخدامها في مشاريع حية واقعية.\nوأصبح أفضل وأفضل ببطء.\n\nحالما أبدأ بنصع تقدم حقيقي في مشروعي، وأكون واثقا أنني اخترت واجهة برمجية جيدة،\nيصبح من المنطقي أن أطلع على درس تعليمي. عادة ما ألقي نظرة سريعة على عدة دروس، وأتعرف\nعلى الدرس الذي أعتقد أنني سأتعلم الأكثر منه، ثم أدرسه. أضيف أشياء إلى أنكي في هذه المرحلة\nلكن بشكل خفيف. من المغري إضافة كل شيء، لكن ينتهي بي المطاف بحفظ كثير من المعلومات\nالتي لا فائدة فيها بعد صرف وقت طويل.\nمن الأفضل أكثر إضافة فقط المواد التي أعرف أنني سأحتاجها بشكل متكرر. يعني هذا عادة أنني\nأعرف مسبقا أنني سأحتاجها في المرحلة الحالية من المشروع. في الجولة الأولى أكون متحفظا\nوأضيف مواد أقل إلى أنكي. ثم بعد قراءة الدرس مرة واحدة،  أكرره مجددا، هذه المرة مع إضافة\nكل شيء يرجح أنني سأحتاجه لاحقا إلى أنكي. عادة ما تكون الجولة الثانية سريعة جدا\n- أسرع من الجولة الأولى غالبا- لكن في الجولة الثانية لدي سياق أوسع، وحكمي حول ما \nيجب إضافته إلى أنكي أصبح أفضل.\n\nأستمر بعملية الذهاب والعودة من العمل على المشروع وإضافة المعلومات إلى أنكي بينما\nأقرأ الدروس التعليمية والوثائق، بالإضافة إلى المواد التي تظهر عند قراءة الكود،\nكود مكتوب من قبل الآخرين، وحتى كود كتبته بنفسي. أجد من المفيد بشكل غير متوقع إضافة\nواجهات البرمجة للكود الذي أكتبه بنفسي إذا كان من المرجح أن تكون مفيدة في المستقبل. فقط لأنني كتبت شيئا لا يعني أنني سأتذكره في المستقبل!\n\nلذلك: لا تتسرع بإضافة الدروس التعليمية والوثائق إلى أنكي فورا. انتظر، وأضف بالموازاة مع\nعملك الجدي على مشروعك. يجب أن أعترف أنني جزئيا أنصح بهذا لأنني أجد النصيحة صعبة التطبيق بنفسي.\nغالبا ما أندم لأنني لا أتبع هذه النصيحة.\nأبدأ مشروعا جديدا، مفكرا «آه، أريد كذا وكذا من واجهات البرمجة»، ثم أغرق في درس تعليمي،\nوأقضي الساعات فيه. لكنني أعاني وأعاني وأتقدم ببطء شديد. حتى يخطر ببالي أن أجد كود يعمل أبدأ منه،\nوفورا أجد الأمور تسير بشكل أفضل بكثير. ثم أقسم ألا استخدم طريقة «الدرس أولا» مجددا.\nلكنني عمليا أجدها مغرية لسوء الحظ.\n\nالعملية عموما تشبه كثيرا طريقة التعلم من خلال العمل المستخدمة للواجهات البرمجية الجديدة،\nحيث تتعلم الواجهة تدريجيا من خلال التكرار أثناء العمل على مشروع. الفرق الرئيسي\nهو أن استخدام أنكي المتداخل يسرع معدل استيعابك للمعلومات الجديدة بكثير.\n\nعادة سيئة محتملة هي أن تقول «آه، قد أحتاج أن أتعلم كذا وكذا من الواجهات البرمجية في يوما ما،\nلذلك يجب أن أبدأ بإضافة البطاقات، حتى لو لم يكن لدي حاليا مشروع أستخدم فيه تلك الواجهة.»\n\nجربت هذا عدة مرات، ونصيحتي لك هي: لا تفعل هذا.\n\nإنها شكل من المشكلة التي وصفتها في القسم الرئيسي من المقالة: سحر تخزين المعلومات\nلوقت ما ستستخدمها فيه. ستتعلم بسرعة أكبر بكثير إذا كنت تستخدم الواجهة في مشروع في الوقت نفسه.\nاستخدام الواجهة لعمل شيء جديد يساعدك على التعرف على ما هو مهم لتذكره من الواجهة.\nولذلك - هذا تخمين - يرسل إشارة لعقل تقول «هذا مهم حقا»، وهذا يساعد ذاكرتك قليلا.\nلذلك إذا شعرت بالرغبة في إضافة مواد إلى أنكي تخمينيا، فلا تفعل. وإذا وجدت نفسك تبدأ بهذا، فتوقف.\n\nعادة سيئة صعبة الهزيمة أكثر هي إضافة ما ينتهي به الأمر ليصبح واجهات يتيمة. بمعنى\nأنني سأستخدم واجهة جديدة لمشروع، وأضيف بعض المواد من الواجهة. ثم ينتهي المشروع،\nوليس لدي مشروع آخر يستخدم الواجهة نفسها بعده فورا. بعدها أجد أن ذهني لا يتفاعل\nجيدا مع البطاقات، هناك فكرة نصف واعية تقول «لم أتعلم هذه المعلومات التي لا فائدة فيها؟»\nببساطة أنا لم أعد أجد هذه البطاقات مثيرة للاهتمام كما كنت عندما كنت أستخدم المشروع بشكل فعال.\n\nهذه حالة صعبة. أستخدم القاعدة العملية التي تقول إنه إذا كان من المرجح أنني لن أستخدم\nالواجهة مجددا، فسأحذف البطاقات عندما تأتي. لكن إذا بدا مرجحا أكثر أن أستخدم الواجهة\nالسنة القادمة أو ما شابه، فسأبقيها في الرزمة. ليست هذه حالة مثالية، لأنني فعلا\nأفقد تفاعلي مع البطاقات إلى حد ما. لكن هذه أفضل طريقة توفيقية وجدتها.\n\n\n[^1]: Alexander Luria, “The Mind of a Mnemonist”, Harvard University Press (1968).\n\n[^2]: Vannevar Bush, [As We May Think](https://www.theatlantic.com/magazine/archive/1945/07/as-we-may-think/303881/), The Atlantic (1945).\n\n[^3]: انظر مثلا: Douglas Engelbart, [Augmenting Human Intellect](https://augmentingcognition.com/assets/Engelbart1962.pdf) (1962); Ted Nelson, [Complex information processing: a file structure for the complex, the changing and the indeterminate](https://dl.acm.org/citation.cfm?id=806036) (1965); and Tim Berners-Lee, [Information Management: a Proposal](https://w3.org/History/1989/proposal.html) (1989).\n\n[^4]:\n    ليس لدي صلة بأنكي. هناك أنظمة أخرى مثل [Mnemosyne](https://mnemosyne-proj.org)\n    و [SuperMemo](https://supermemo.com). يدل استخدامي المحدود على أن Mnemosyne شبيه جدا بأنكي.\n    يعمل SuperMemo على ويندوز فقط، ولم تتسنَّ لي فرصة استخدامه، مع أنني تأثرت بمقالات\n    في [موقع SuperMemo](https://supermemo.com).\n    لن أحاول إخفاء حماسي حول أنكي خلف وجه محترم من الحيادية. إن أنكي جزء كبير من حياتي.\n    إن له قصوراته مع ذلك، وسأذكر بعضها خلال المقالة.\n\n[^5]:\n    رأيت تحليلا مشابها أول مرة في مراجعة Gwern Branwen حول التكرار المتباعد:\n    Gwern Branwen، [Spaced Repetition](https://www.gwern.net/Spaced-repetition).\n    أرقامه متفائلة أكثر من أرقامي قليلا - إنه يصل إلى قاعدة 5 دقائق بدلا من 10 دقائق -\n    لكن تقديراتنا متسقة عموما. تحليل براونين مبنٍ بدوره على تحليل آخر في: Piotr Wozniak,\n    [Theoretical aspects of spaced repetition in learning](http://super-memory.com/articles/theory.htm).\n\n[^6]:\n    برنامج الحاسوب مجاني، لكن تطبيق الجوال، في وقت كتابة هذه المقالة، يكلف 25 دولارا.\n    كثير من الناس يعترضون على أن هذا «غالٍ جدا». شخصيا وجدت أن فائدة أنكي أثمن بأضعاف مضاعفة\n    من قيمة الـ25 دولارا. تطبيق أنكي للجوال هو بالتأكيد أثمن بكثير لي من وجبة واحدة\n    في مطعم متوسط التكلفة.\n\n[^7]:\n    لاحقا أجريت تجربة مع كتاب تشارلز ديكنز «قصة مدينتين» بعد أن رأيت أن من الممكن\n    حفظ نص كامل. بعد أسابيع قليلة استنتجت أن هذا ممكن، لكن لا يستحق وقتي. لذلك حذفت\n    كل البطاقات. حدث شيء مثير بعد الحذف: اضمحلت الجمل المعدودة الأولى من الكتاب تدريجيا\n    من ذاكرتي، والآن لا أذكر إلا المتفرقات. أتساءل أحيانا ما سيكون أثر حفظ كاتب جيد كاملا؛\n    لن أتفاجئ إن أثر بشكل عظيم على لغتي وكتابتي.\n\n[^8]: David Silver, Aja Huang, Chris J. Maddison, Arthur Guez et al, [Mastering the game of Go with deep neural networks and tree search](https://augmentingcognition.com/assets/Silver2016a.pdf), Nature (2016).\n\n[^9]: Michael Nielsen, [Is AlphaGo Really Such a Big Deal?](https://www.quantamagazine.org/is-alphago-really-such-a-big-deal-20160329/), Quanta (2016).\n\n[^10]: Michael A. Nielsen, [\"Neural Networks and Deep Learning\"](http://neuralnetworksanddeeplearning.com/), Determination Press (2015).\n\n[^11]: حول AlphaGo Zero, انظر: David Silver, Julian Schrittwieser, Karen Simonyan, Ioannis Antonoglou *et al*, [Mastering the game of Go without human knowledge](https://augmentingcognition.com/assets/Silver2017a.pdf), Nature (2017). حول AlphaZero, انظر: David Silver, Thomas Hubert, Julian Schrittwieser, Ioannis Antonoglou *et al*, [Mastering Chess and Shogi by Self-Play with a General Reinforcement Learning Algorithm](https://arxiv.org/abs/1712.01815) (2017).\n\n[^12]: Benjamin F. Jones and Bruce A. Weinberg, [Age Dynamics in Scientific Creativity](https://augmentingcognition.com/assets/Jones2011a.pdf), Proceedings of the National Academy of Sciences (2011).\n\n[^13]: في كتابهم الرهيب “How to Read a Book”: Mortimer J. Adler and Charles van Doren, “How to Read a Book: The Classic Guide to Intelligent Reading” (1972)\n\n[^14]: في “Littlewood's miscellany”, محرر من قبل Béla Bollobás (1986).\n\n[^15]: لدي فضول إلى أي مدى يمكن استخدامه للمهارات الحركية وحل المشاكل، وهما مجالان لم أجرب أنكي فيهما.\n\n[^16]:\n    كتب العديد من الناس تجاربهم حول القراءة باستخدام أنظمة الذاكرة الشخصية.\n    تأثر تفكيري خصوصا بـ: Piotr Wozniak, [Incremental Reading](https://www.supermemo.com/en/archives1990-2015/help/read).\n\n[^17]: قائمة من أمثلة الاستخدام المفيدة: Piotr Wozniak, [Effective learning: Twenty rules of formulating knowledge](https://www.supermemo.com/en/archives1990-2015/articles/20rules).\n\n[^18]:\n    نسخة ذرية أكثر هي أن أقسم السؤال الأول إلى «ما أمر يونكس لإنشاء رابط؟» و\n    «ما خيار الأمر `ln` المستخدم لإنشاء رابط مرن؟» عمليا كنت أعلم منذ سنين أن `ln`\n    يستخدم لإنشاء رابط، لذلك لم يكن هذا ضروريا.\n\n[^19]:\n    إنه تدريجي لأن الأسئلة تحتاج أحيانا إلى إعادة الصياغة نظرا إلى السياق المتغير.\n    مثلا، كل من رزمي حول برنامج Emacs وسطر أوامر يونكس فيها أسئلة مشابهة جدا، مثل\n    «كيف تمحو كلمة؟» يجب إعادة صياغة هذه الأسئلة، مثلا لتصبح: «في Emacs، كيف تمحو كلمة؟»\n    (قد يبدو هذا بالمناسبة سؤالا غريبا لمستخدم لـEmacs منذ مدة طويلة مثلي. في الحقيقة،\n    لقد استخدمت أنكي لمساعدتي على تغيير كيف أمحو الكلمات في Emacs، ولهذا لدي هذا السؤال\n    في أنكي. نجحت بتحسين استخدامي لـEmacs كثيرا بهذه الطريقة.)\n\n[^20]:\n    انظر [MedicalSchoolAnki subreddit](https://www.reddit.com/r/medicalschoolanki/)،\n    والتي تحتوي على أفضل الرزم، وكيفية استخدامها، بالإضافة إلى قائمة بأفضل الرزم لأغراض\n    مختلفة متغيرة باستمرار. انظر أيضا ورقة: Michael Hart-Matyas et al, [Twelve tips for medical students to establish a collaborative flashcard project](https://augmentingcognition.com/assets/Hart-Matyas2018.pdf), Medical Teacher (2018).\n\n[^21]: مراجعة مسلية وغنية بالمعلومات: Joshua Foer, “Moonwalking with Einstein” (2011).\n\n[^22]: Richard P. Feynman, “What Do You Care What Other People Think? Further Adventures of a Curious Character” (1989).\n\n[^23]: في الواقع سؤال أفضل هو إظهار اللوحة والسؤال عن اسمها.\n\n[^24]: مع اعتذاري لـ Kurt Vonnegut، والذي كتب: «نحن ما نتظاهر به، لذلك يجب أن نكون حذرين حيال ما نتظاهر به.»\n\n[^25]:\n    قياسا على «نتانة الكود» (code smell)، يمكننا قول «نتانة السؤال»، كإشارة إلى\n    الحاجة إلى إعادة الصياغة. بنية نعم/لا هي مثال عن نتانة سؤال.\n\n[^26]: Alan Kay and Adele Goldberg, [Personal Dynamic Media](https://augmentingcognition.com/assets/Kay1977.pdf) (1977).\n\n[^27]: Frank N. Dempster, [The Spacing Effect: A Case Study in the Failure to Apply the Results of Psychological Research](https://augmentingcognition.com/assets/Dempster1988.pdf) (1988).\n\n[^28]: Robert A. Bjork, [Memory and Metamemory Considerations in the Training of Human Beings](https://augmentingcognition.com/assets/Bjork1994.pdf) (1994).\n\n[^29]: انظر مثلا، Herbert A. Simon, [How Big is a Chunk?](https://augmentingcognition.com/assets/Simon1974.pdf), Science (1974), and Adriaan de Groot, Thought and Choice in Chess, Amsterdam University Press (2008, reprinted from 1965).\n\n[^30]: George A. Miller, [The Magical Number Seven, Plus or Minus Two: Some Limits on our Capacity for Processing Information](https://psychclassics.yorku.ca/Miller/) (1956).\n\n[^31]: يمكن إيجاد مراجعة عن العلاقة في Phillip L. Ackerman, Margaret E. Beier, and Mary O. Boyle, [Working Memory and Intelligence: The Same or Different Constructs?](https://augmentingcognition.com/assets/Ackerman2006.pdf) Psychological Bulletin (2006).\n\n[^32]:\n    لمعرفة هذا من المفيد فهم كيف تنشأ هذه القطع بالتحديد. يبدو أن هذا ما زال مفهوما بشكل ضئيل.\n    لن أكون متفاجئا إذا كان يتضمن كمية كبيرة من التحليل وحل المشاكل بالإضافة إلى الذاكرة طويلة الأمد.\n\n[^33]: Hermann Ebbinghaus, [Memory: A Contribution to Experimental Psychology](https://psychclassics.yorku.ca/Ebbinghaus/index.htm) (1885). يمكن إيجاد إثبات حديث لنتائج إبنجهاوس هنا: Jaap M. J. Murre and Joeri Dros, [Replication and Analysis of Ebbinghaus' Forgetting Curve](https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0120644) (2015).\n\n[^34]:\n    مع أن هذا التوسع قد درس كثيرا إلا أن هناك عملا قليلا بشكل غير متوقع على بناء\n    نماذج تنبئية تفصيلية لهذا التوسع. استثناء واحد هو:\n    Settles and Brendan Meeder, [A Trainable Spaced Repetition Model for Language Learning](https://augmentingcognition.com/assets/Settles2016.pdf) (2016).\n    تبني هذه الورقة تحليل انحدار للتنبؤ بمعدل اضمحلال ذاكرة طالب في Duolingo، منصة تعلم\n    لغات على الإنترنت. لم تشمل النتيجة تنبؤا أفضل لمعدلات الاضمحلال فقط، بل تفاعل أحسن\n    لطلاب Duolingo.\n\n[^35]:\n    تحاول عديد من التجارب أيضا تقييم إدراك المشاركين لفعالية الدراسة المكثفة مقابل الدراسة المتباعدة.\n    من الملفت للنظر أنهم عادة ما يعتقدون أن الدراسة المكثفة أكثر فعالية، على الرغم من حقيقة\n    أن الدراسة المتباعدة تتفوق عليها بشكل مؤكد.\n\n[^36]:\n    بدلا من عمل مراجعة كهذه، دعني أدلك على عدة مراجعات تصلح كنقطة بداية.\n    كتاب Benedict Carey “How We Learn” (2015) هو مقدمة جيدة على المستوى الشعبي. مراجعات مفيدة لأدبيات التمرين المتباعد تتضمن:\n    Cepeda *et al*, [Distributed Practice in Verbal Recall Tasks: A Review and Quantitative Synthesis](https://augmentingcognition.com/assets/Cepeda2006.pdf) (2006); و: Gwern Branwen, [Spaced-Repetition](https://www.gwern.net/Spaced-repetition).\n\n[^37]: William James, “The Principles of Psychology” (1890).\n\n[^38]: Axel Oehrn, Experimentelle Studien zur Individualpsychologie (1895).\n\n[^39]:\n    انظر: Piotr Wozniak, [Repetition spacing algorithm used in SuperMemo 2002 through SuperMemo 2006](https://www.supermemo.com/english/algsm11.htm). يستخدم أنكي خوارزمية SM-2.\n\n[^40]:\n    كغير مختص، أعرف أن هذا التعليق لن يروق لمجتمع تفاعل الإنسان والحاسوب. لكن البقاء صامتا لن يفيد بشيء.\n    عندما ألقي نظرة على الأحداث الكبيرة في المجتمع، مثل مؤتمر CHI، الغالبية العظمة\n    من الأوراق تبدو هزيلة مقارنة بالأعمال المبكرة في مجال التعزيز. إنها إشارة ذات دلالة\n    أن نشر أوراق ثابتة تقليدية (PDF، وليس حتى JavaScript تفاعلي و HTML) ما زال مركزيا في المجال.\n\n[^41]:\n    السبب هو أن أنكي يسمح لك بتحديد أنك وجدت بطاقة «سهلة» و «صعبة» عندما تراجعها،\n    بالإضافة إلى خيار «جيد» العام (يعني أنك نجحت بإجابة السؤال) أو «مجددا» (يعني أنك فشلت).\n    هذه الخيارات الإضافية قد تغير معدل توسع الفاصل. عمليا أنا أختار «جيد» دائما أو أخبر\n    أنكي أنني فشلت بتذكر البطاقة.\n"
    },
    {
      "title": "تعريف ببرنامج mpvacious لتعلم اللغات من خلال مقاطع الفيديو",
      "date": "2022-03-12",
      "tags": [
        "anki",
        "languages",
        "english"
      ],
      "uuid": "d3b562d9-4197-40c3-9c12-04754fc60761",
      "lastModified": "2022-07-21",
      "id": "mpvacious",
      "content": "\n## مقدمة\n\n[mpvacious](https://github.com/Ajatt-Tools/mpvacious) هو برنامج يعمل كإضافة لمشغل\nالفيديو [mpv](https://mpv.io/)، وظيفته تسهيل عملية اقتطاع مقاطع مختارة من الفيديو\nمع ترجمتها وصنع بطاقات لبرنامج [Anki](anki-intro.md)\nمنها لكي تراجعها مرارا وتكرارا وتتعلم أي كلمة أو عبارة غير مألوفة في المقطع.\n\nتدعى عملية انتقاء جمل من فيديوهات تشاهدها أو نصوص تقرأها أو أي شيء تستهلكه باللغة\nالتي تتعلمها عموما بـ\"تعدين الجمل\" (sentence mining)، وهي طريقة ممتعة للتعلم من السياق.\n\nشاهد هذا الفيديو المسجل من قبل مؤلف mpvacious لنبذة سريعة عنه: <https://www.youtube.com/watch?v=vU85ramvyo4>\n\n## المتطلبات\n\n1. حمل mpv ونصبه من هنا: <https://mpv.io/installation/>\n2. نزل mpvacious من هنا: <https://github.com/Ajatt-Tools/mpvacious/archive/refs/heads/master.zip> واتبع تعليمات تنصيبه.\n\nسأفترض أن لديك معرفة تقنية تساعدك على تنصيب المتطلبات بنفسك باتباع التعليمات.\nإذا وجدت نفسك ضائعا تماما فعلى الأغلب ليس mpvacious مخصصا لك، فهو يحتاج معرفة تقنية لدرجة معينة.\n\n## استعراض\n\nلنأخذ جولة سريعة مع mpvacious من خلال استعراض مكتوب مع الصور لكي نأخذ فكرة عن كيفية عمله.\n\nبعد تنصيب mpvacious، نفتح ملف الفيديو الذي نريد مشاهدته في mpv.\n\nأتعلم حاليا اللغة التركية. مؤخرا وجدت قناة يوتيوب تنشر أنيميشن/أفلام متحركة تركية ([Yunus Emre Gündüz](https://www.youtube.com/c/YunusEmreG%C3%BCnd%C3%BCz/))\nوأدمنت عليها وبدأت باستخدام mpvacious لتعلم أي عبارة لا أعرفها تمر علي.\n\nلنأخذ مثالا سريعا مع فيديو من هذه القناة: <https://www.youtube.com/watch?v=B9Gj0Xq8D3A>\n\nبعد أن حملنا الفيديو وشغلناه باستخدام mpv، لنقل إنك وصلنا إلى مقطع نريد صنع بطاقة أنكي منه.\n{% include image.html file=\"mpvacious-1.png\" %}\n\nأول شيء سنفعله هو فتح قائمة خيارات mpvacious بالضغط على <kbd>a</kbd> ليظهر التالي.\n\n{% include image.html file=\"mpvacious-2.png\" %}\n\nثم نضغط على <kbd>i</kbd> لتظهر لنا قائمة بهذا الشكل فيها بعض اختصارات لوحة المفاتيح واستخداماتها.\n{% include image.html file=\"mpvacious-3.png\" %}\n\nالاختصارات المظهرة هي أكثر الاختصارات التي ستحتاج لاستخدامها في mpvacious.\nإذا كنت تعرف بعض الإنجليزية يمكنك غالبا أن تفهم أساسيات استخدام البرنامج من الواجهة.\n\nلكي نخبر mpvacious بالمقطع الذي نريد استخراجه، علينا أن نحدد بدايته ونهايته.\nأسهل طريقة لذلك هي بالضغط على زر <kbd>c</kbd> والذي يضبط بداية المقطع ونهايته حسب\nتوقيت الترجمة الظاهرة حاليا.\n\n{% include image.html file=\"mpvacious-4.png\" %}\n\nإذا كان توقيت الترجمة دقيقا يتزامن مع حديث الشخصيات فهذا الخيار مريح جدا\n(سنرى ما يمكننا فعله إذا لم يكن التوقيت جيدا لاحقا).\n\nبعد أن حددنا بداية المقطع ونهايته يمكننا الضغط على <kbd>n</kbd> لكي نضيف بطاقة إلى أنكي.\n\n{% include image.html file=\"mpvacious-5.png\" %}\n\nلنذهب الآن إلى أنكي ونفتح البطاقة التي أضافها mpvacious.\n\n{% include image.html file=\"mpvacious-anki-1.png\" %}\n\nوجدنا أن mpvacious قد استخرج الصوت وأضافه للجانب الأمامي للبطاقة مع صورة مأخوذة\nفي لحظة إضافتنا للبطاقة. مهمتنا هنا هي 1) الاستماع للمقطع الصوتي طبعا، 2) ملاحظة\nأي شيء لم نفهمه في العبارة (كلمات، تعابير، إلخ). ثم نظهر الجواب ليظهر لنا التالي:\n\n{% include image.html file=\"mpvacious-anki-2.png\" %}\n\nظهرت لدينا الجملة النصية مع معلومات الفيديو المأخوذة منه. نقييم الآن فهمنا\nونختار زر تقييم إجابة.\n\nلنأخذ مثالا آخر. هذه المرة مع لغة أخرى ومقطع من مسلسل [Mind Your Language](https://en.wikipedia.org/wiki/Mind_Your_Language) (أنصح متعلمي الإنجليزية بمشاهدته)\nوليكن المقطع الذي نريد استخراجه يمتد على مدى عبارتين نريد تضمينهما في البطاقة نفسها.\n\n{% include image.html file=\"mpvacious-6.png\" %}\n\nنبدأ أولا بالذهاب لأول عبارة ونضغط على <kbd>c</kbd> كما سبق\nلكي يتم تحديد بداية المقطع ونهايته. لكننا نريد أيضا تضمين العبارة التالية لذلك علينا\nتعديل وقت نهاية المقطع. أسهل طريقة لفعل هذا هنا هو ببساطة تقديم الفيديو إلى حين\nظهور ترجمة العبارة التالية. سنلاحظ أن mpvacious يعدل نهاية المقطع تلقائيا.\n\n<video controls>\n  <source src=\"/assets/video/mpvacious-demo-1.mp4\" type=\"video/mp4\">\n</video>\n\nالآن ما علينا إلا الضغط على <kbd>n</kbd> لإضافة البطاقة.\nجدير بالملاحظة أن لقطة الشاشة التي يأخذها البرنامج ويحفظها في البطاقة تكون مأخوذة\nمن لحظة الضغط على زر <kbd>n</kbd>. من المفيد الاعتناء بالتقاط صور معبرة عن المشهد ومميزة\nفهذا قد يساعدك مثلا على تذكر المشهد وسياقه عند رؤية الصورة في أنكي.\n\nحسنا، ماذا لو كانت توقيت الترجمة سيئا جدا لا يتزامن مع الحديث أو ماذا لو كانت لا توجد ترجمة\nأصلا لكنك ما زلت تريد اقتطاع مقطع وإضافته؟\n\nإذا قرأت خيارات القائمة فسترى أن هناك خيارات لضبط بداية المقطع ونهايته حسب اللحظة الحالية\nبغض النظر عن توقيت الترجمة. هذه الاختصارات هي <kbd>s</kbd> و <kbd>e</kbd>.\n\nلنأخذ مثالا عن توقيت ترجمة متأخر:\n\n<video controls>\n  <source src=\"/assets/video/mpvacious-demo-2.mp4\" type=\"video/mp4\">\n</video>\n\nاستخدام هذه الخيارات أصعب بطبيعة الحال لأنك تحتاج للتأكد يدويا من أنك تضمن\nبداية الجملة إلى نهايتها في المقطع بدون اقتصاص كلمة بدون قصد قد تضر بفهمك للسياق.\n\nلنر كيف ستظهر البطاقة في أنكي:\n\n{% include image.html file=\"mpvacious-anki-3.png\" %}\n\nإذا كنت تقرأ بنباهة فستلاحظ أن عبارة \"Goodnight! - I've locked up the tea room Sid - Thanks Glad\"\nتم تضمينها مع أننا لم نمضها في المقطع الصوتي. هذا لأن توقيت الترجمة ليس دقيقا طبعا\nوmpvacious يعتمد عليه لاستخراج النص المرافق للصوت. يمكننا هنا ببساطة حذف النص الزائد\nيدويا عندما نراجع البطاقة.\n\nلكن ماذا لو كنت تريد تقطيع فيديو ليس له ترجمة؟ عندها سيكون حقل النص فارغا وسيرفض mpvacious\nإنشاء بطاقة بسبب ذلك. لكن هناك حل لهذا سأشرحه لاحقا يجعل البرنامج يسمح بإضافة البطاقة على كل حال\nمع نص تنبيهي كهذا:\n\n{% include image.html file=\"mpvacious-anki-4.png\" %}\n\nيمكنك هنا استغلال الفرصة لكي تصغي السمع وتكتب النص بنفسك وتضيفه عند مراجعة البطاقة.\n\n## ضبط mpvacious\n\nبعد أن أخذنا جولة قصيرة مع mpvacious لندخل في التفاصيل الدسمة وطريقة إعداد\nالبرنامج وتخصيصه. أولا سننشئ ملفا باسم `subs2srs.conf` ونضعه في مجلد\n`mpv/script-opts/`. سيحتوي هذا الملف إعدادات مثل الزرمة التي سيحفظ\nmpvacious البطاقات فيها ونوع الملحوظة (notetype) المستخدم وأشياء أخرى.\nهنا مثال عن ملف: <https://github.com/Ajatt-Tools/mpvacious/blob/master/.github/RELEASE/subs2srs.conf> مع شرح لكل الخيارات.\n\nهذه إعداداتي التي أستخدمها للغة الإنجليزية مثلا:\n```\ndeck_name=en::09. mined sentences\nmodel_name=Mined Sentence\nsentence_field=sentence\naudio_field=audio\nimage_field=image\nmiscinfo_field=source\ncreate_deck=yes\nnuke_spaces=no\nallow_duplicates=no\n```\n\nسيحفظ mpvacious بيانات المقطع بهذا الشكل حسب هذه الإعدادات:\n\n{% include image.html file=\"mpvacious-anki-5.png\" %}\n\nبجانب أول الخيارات والتي هي مخصصة لضبط توزيع الحقول والرزمة ونوع الملحوظة المستخدمين،\nيجدر التركيز على آخر ثلاث خيارات:\n1. `create_deck`: يجعل هذا الخيار البرنامج ينشئ الرزمة المضبوطة بخيار `deck_name`\nإذا لم تكن موجودة بالفعل في أنكي.\n2. `nuke_spaces`: البرنامج يزيل المسافات بين كل كلمة من نص المقطع بشكل افتراضي.\nهذا لأن استخدامه الأكبر هو لتعلم لغات شرق آسيا مثل الصينية واليابانية والتي لا تستخدم المسافات بين الكلمات.\nنحتاج لإلغاء تفعيل هذا الخيار لأغلب اللغات الأخرى وإلا ظهرت النصوص كطلاسم بدون مسافات.\n3. `allow_duplicates`: قلنا سابقا إن mpvacious يرفض استيراد المقاطع التي لا ترجمات لها.\nضبط هذا الخيار لقيمة `no` يجعله يستورد المقاطع على أي حال مع العبارة التنبيهية التي رأيناها.\n\n## استخدام mpvacious مع عدة لغات\n\nإذا كنت مهووسا بتعلم اللغات فقد ترغب في استخدام mpvacious لتعلم أكثر من لغة،\nوستحتاج غالبا لأن تستخدم إعدادات مختلفة لكل لغة، مثل الرزمة المستخدمة وخيار `nuke_spaces`.\n\nيدعم mpvacious استخدام عدة ملفات إعدادات يمكن تفعيل واحد منها والتنقل بينها\nباستخدام زر `p` عندما تكون قائمة البرنامج ظاهرة. يظهر الملف المفعل حاليا بجانب \"Active profile\" في الواجهة.\nإذا عدت إلى الصور السابقة في المقالة فستجد أنني استخدمت ملفي إعدادات مختلفة لكل\nمن اللغتين الإنجليزية والتركية.\n\nلكي تستخدم هذه الميزة عليك أولا إنشاء ملف باسم `subs2srs_profiles.conf` في مجلد `mpv/script-opts/`\nتعرّف فيه أسماء ملفات الإعدادات الموجودة في المجلد نفسه وذات اللاحقة `conf` بهذا الشكل:\n```\nprofiles=subs2srs,english,turkish\nactive=subs2srs\n```\nسيكون ملف `subs2srs.conf` الافتراضي في هذه الحالة.\n\nلدي شخصيا ثلاث ملفات إعدادات للغات الإنجليزية والتركية واليابانية.\n\n## خاتمة\n\nكان هذا تعريفا قصيرا لأداة تعرفت عليها مؤخرا ووجدتها مفيدة جدا لإنعاش روتيني التعليمي.\nسأضع مصادر للاستزادة حول mpvacious وأدوات مشابهة.\n\n## مراجع\n\n- وثائق mpvacious الرسمية والتحميل: <https://github.com/Ajatt-Tools/mpvacious>\n- [أداة subs2srs](http://subs2srs.sourceforge.net/) عريقة ومصدر إلهام mpvacious. فرقها الأكبر أنها أوتوماتيكية تماما تقتطع المقاطع حسب توقيت الترجمة وتضيفها كلها إلى Anki.\n  مفيدة إذا كان لديك ترجمة بتوقيت ممتاز وتريد إضافة كل المقاطع في فيديو بسرعة.\n- هناك عدة إضافات لـAnki تساعد على إنشاء بطاقات على طراز subs2srs. ابحث عن \"subs2srs\" في صفحة <https://ankiweb.net/shared/addons/2.1>.\n- \"خدعة\" بسيطة [تعلمتها مؤخرا](https://www.youtube.com/watch?v=MadpZEBFHIc) هي إنشاء عدة حسابات يوتيوب باستخدام الإيميل نفسه وتخصيص كل منها للغة من اللغات التي أتعلمها حيث أشترك بقنوات تنشر محتوى بتلك اللغة فقط لخلق بيئة للانغماس فيها. أحمل فيديوهات من القنوات وأستخدمها مع mpvacious أيضا.\n"
    },
    {
      "title": "مشاريع",
      "date": "2022-05-02",
      "uuid": "fc743dc0-ff57-467c-84f1-94f9150a0005",
      "lastModified": "2022-07-22",
      "tags": [],
      "id": "projects",
      "content": "\nسأكتب هنا عن بعض مشاريعي (البرمجية غالبا) التي أعمل عليها، غالبا للتعلم والترفيه.\nأحب التقنية وعمل أدواتي البرمجية الخاصة ككل من يحب البرمجة، وأحب التعلم من أجل التعلم،\nلذلك لن أهمل ذكر التفاصيل التقنية \"المملة\" بجانب الكلام عن الأهداف المعنوية.\n\n## [مدونة عبدو الفضولية](/)\n\nهذه المدونة التي تقرأها حاليا. أنشأتها قبل حوالي سنتين لكي أكتب عن كل ما يهمني.\nأصبحت قبلها بسنوات مدمنا على قراءة المدونات (التقنية غالبا) وأصبح لدي اهتمام مكثف\nبمواضيع محددة غير معروفة نسبيا جعلني أشعر بالثقة بأن لدي ما أقوله عنها، حتى لو كان سطحيا.\nمن المواضيع التي أردت الكتابة عنها واكتساب معرفة واسعة فيها هي موضوع طرق التعلم المبنية على أبحاث علمية (تأثير الاختبار، التكرار المتباعد)\nواستخدام أدوات تقنية تستغل هذه الطرق (مثل [Anki]({% post_url 2021-02-19-anki-intro %})).\nموضوع متعلق آخر يهمني هو تعلم اللغات باستخدام هذه الطرق وشرح استخدام كثير من الأدوات التقنية الموجودة في الساحة.\nبجانب مواضيع التعلم، أريد أيضا تحسين مهاراتي التقنية من خلال شرح ما أتعلمه.\nأخذ الوقت بكتابة الشروحات يساعدني على تعميق فهمي بغض النظر عما إذا كان أحد يقرأ ما أكتبه ويفهم منه شيئا :)\n\nلنتحدث قليلا عن الجانب التقني للمدونة: المدونة مبنية على أداة Jekyll الشهيرة لبناء المواقع الثابتة\n(التي لا تتطلب قواعد بيانات وتخزين بيانات متغيرة للمستخدمين مثلا).\nتصميم المدونة اخترت عمله بنفسي من الصفر وجعله بسيطا وإعطاءه طابعي الخاص، لأن المدونة\nمشروع تعلم بشكل أساسي. المدونة لا تستخدم أي جافاسكربت حاليا بالمناسبة والصفحات تفتح بسرعة البرق!\nالمدونة [مستضافة](https://github.com/abdnh/abdnh.github.io/) على خدمة GitHub Pages المجانية.\nتكلفة المدونة هي فقط تكلفة اسم النطاق الخاص (والذي ليس ضروريا).\n\n## [ويكي عبدو الفضولية](/curious)\n\n\"ويكي\" شخصية مرافقة لمدونة عبدو الفضولية أكتب فيها بشكل مشتت أكثر وأكثر أريحية وإيجازا.\nهدفي من عملها هو أولا عمل مخزون شخصي عن كل ما أتعلمه وأعرفه يتكون من منشورات قصيرة يمكن\nربطها والإحالة إليها بسهولة. بدأت مؤخرا بكتابة منشورات مؤرخة على شكل \"[يوميات](/curious/#%D9%8A%D9%88%D9%85%D9%8A%D8%A7%D8%AA%20%D9%81%D8%B6%D9%88%D9%84%D9%8A)\"\nمثل منشورات مواقع التواصل الاجتماعي.\n\nالويكي مبنية على برنامج TiddlyWiki المخصص لتدوين الملحوظات وتنظيم المعرفة.\nأكبر نقطة قوة لـTiddlyWiki هي ميزات ربط المنشورات وتخصيصها بحيث يكون كل منشور صغيرا لكن يمكن ربطه\nمع منشورات أخرى واستخدامه بشكل متكرر داخل منشورات أخرى وإجراء عمليات بحث على المنشورات حسب الموضوع\nوالمعلومات المتعلقة بكل منشور بسهولة.\n\nبدأت باستخدام TiddlyWiki قبل سنوات لتدوين يومياتي الشخصية، لكن معرفتي بميزات البرنامج القوية كانت (وما زالت) ضئيلة.\nأخطط لتعميق فهمي للبرنامج وتحسين الويكي (من ناحية المظهر والتنظيم).\n\n## إثراء المحتوى العربي حول طرق التعلم واستخدام التقنية لتعزيز التعلم\n\nمن أكبر اهتماماتي حاليا هي طرق التعلم كما قلت. هناك نقص واضح في المحتوى العربي حول الموضوع طبعا.\nبدأت مؤخرا بالمساهمة تدريجيا في ما أعرفه حول الموضوع. بحكم هووسي ببرنامج Anki واستخدامي له منذ سنوات،\nبدأت بترجمة البرنامج وما يتعلق به من دلائل استخدام ووثائق. أكملت أولا ترجمة برنامج الكمبيوتر وتطبيقات الجوال (أندرويد وأيفون).\nثم انتقلت إلى دليل الاستخدام و[ترجمته ليصبح أحدث وأكمل ترجمة](https://github.com/abdnh/anki-manual/)\nللدليل من بين الترجمات الموجودة للغات مختلفة.\nكما أساهم في [مجموعة صغيرة على التلجرام](https://t.me/Ankiarabic_QA) لمستخدمي أنكي العرب.\n\nعلى نطاق أوسع، هناك مقالات إنجليزية ممتعة حول موضوع الذاكرة أود ترجمتها أو على الأقل تلخيصها بالعربية.\nأبرزها مما أعرفه هي مقالة لمايكل نيلسن باسم \"تعزيز الذاكرة طويلة الأمد\" يمكن قراءة ترجمتي لها هنا:\n[تعزيز الذاكرة طويلة الأمد - مايكل نيلسن (مترجم)]({% post_url 2021-07-11-ltm %})\n\nأود أيضا أن أساهم في الكتابة في مواقع لها نفوذ أكبر من مدونتي هذه التي لا يقرأها أحد. أود المساهمة في ويكيبيديا العربية حول الموضوع.\n\nعلى نطاق أوسع أكثر، أريد التعمق والقراءة في الأبحاث العلمية حول الذاكرة وطرق التعلم وعمل تجاربي الخاصة لفهم ذاكرتي وتعزيز\nتعلمي الخاص.\n\n## المساهمة في المشاريع مفتوحة المصدر\n\nأحب المساهمة في مشاريع الآخرين البرمجية والتعلم منها. بدأت قبل سنتين بالمساهمة بشكل رئيسي\n[بتطوير أنكي](https://github.com/ankitects/anki) وإصلاح بعض الأعطال وإضافة الميزات البسيطة.\nكانت وما زالت هذه تجربة ممتعة. قراءة أكواد الآخرين ومحاولة فهمها ومناقشة التغييرات مع المطورين الآخرين\nفرصة ثرية للتعلم واكتساب الخبرة بسرعة.\n\n## إضافات Anki\n\nمن أكبر نقاط قوة Anki (بجانب جعل الذاكرة خيار لحد ما) هو كونه مفتوح المصدر وقابل للتخصيص كيفما تريد.\nالبرنامج يدعم نظام إضافات (add-ons) يمكن من خلالها تخصيص كل شيء تقريبا في البرنامج.\nهناك مجتمع نشط لحد ما من مطوري الإضافات ومستخدميها.\nبدأت بتعلم عمل إضافات بسيطة لاستخدامي الشخصي منذ سنوات، لكن مؤخرا تعمقت أكثر وبدأت أكتب إضافات أكثر تعقيدا وأشاركها\nمع الناس. بدأ الأمر عندما طلب مني شخص في مجموعة التلجرام الآنفة الذكر أن أعدل على إضافة [LPCG](https://ankiweb.net/shared/info/2084557901) المستخدمة لاستيراد الأبيات لكي أعربها وأضيف ميزات إضافية لها لاستيراد المنظومات.\nعدلت الإضافة ونشرتها وهي الآن تستخدم في المجموعة لعمل زرم بطاقات Anki ومشاركتها مع المستخدمين:\n[ARLPCG (مستورد المنظومات والقصائد)](https://ankiweb.net/shared/info/1642554134)\n\n![واجهة إضافة ARLPCG](https://raw.githubusercontent.com/abdnh/AnkiLPCG/ar/shot1.png)\n\nعملت بعدها على بعض الإضافات المفيدة للمستخدمين العرب خصوصا، منها:\n\n### [ARQImporter (مستورد الأسئلة العربية)](https://ankiweb.net/shared/info/1299710950)\n\nإضافة مشتقة من ARLPCG لاستيراد الأسئلة العربية المميزة من ملفات نصية مميزة برموز معينة.\n\n![واجهة إضافة ARQImporter](https://raw.githubusercontent.com/abdnh/ARQImporter/master/screenshots/dialog.jpg)\n\n### [ArMajor (نظام المذكرات الصوتي للعربية)](https://ankiweb.net/shared/info/616438440)\n\nنظام مذكرات مستوحى من كتاب [الأسماء كلها]({% post_url books/2021-02-05-alasmaaekolaha %}).\n\n![واجهة إضافة ArMajor](https://raw.githubusercontent.com/abdnh/armajor/master/shot-1.png)\n\n### [Dawwen Importer (مستورد دوّن)](https://ankiweb.net/shared/info/1670363972)\n\nمستورد لملحوظات تطبيق [دوّن](https://play.google.com/store/apps/details?id=com.dawwen).\n\n### [BiDi Tools](https://ankiweb.net/shared/info/281067366)\n\nإضافة للتعامل مع النصوص التي تكتب من اليمين إلى اليسار مثل العربية.\n\n![واجهة إضافة BiDi Tools في محرر أنكي](https://raw.githubusercontent.com/abdnh/anki-bidi-tools/master/demo/editor.png)\n\nنشرت بعدها عدة إضافات لتعلم اللغات خصوصا أذكر منها:\n\n### [Aglish](https://ankiweb.net/shared/info/38866997)\n\nإضافة لاستخدام خدمة [YouGlish](https://youglish.com/) داخل بطاقات أنكي.\nYouGlish هو موقع لتعلم لغات يوفر محرك بحث لمقاطع اليوتيوب التي تتوفر لها ملفات ترجمة (captions).\n\n![](/assets/images/aglish.png)\n\n### [Wiktionary](https://ankiweb.net/shared/info/2087444887)\n\n![واجهة إضافة Wiktionary](https://raw.githubusercontent.com/abdnh/anki-wiktionary/master/images/dialog.png)\n\nهذه الإضافة تساعد على ملء البطاقات بتعاريف المفردات والجمل باستخدم قواميس مشروع Wiktionary الضخمة. طورت الإضافة لعميل في موقع [Fiverr](https://www.fiverr.com/abd_nh/develop-an-anki-addon).\n\n### [TRDict](https://ankiweb.net/shared/info/351090164)\n\n![واجهة إضافة TRDict](https://raw.githubusercontent.com/abdnh/anki-trdict/master/shots/dialog.png)\n\nهذه الإضافة توفر قاموس وميزات مفيدة لمتعلمي اللغة التركية.\n\n### [AnkiApp Importer](https://ankiweb.net/shared/info/2072125761)\n\nهناك عدة تطبيقات تستغل اسم Anki الأصلي وتحاول جذب المستخدمين لها وتستغل عدم معرفة المستخدمين لجني المال منهم.\nهذه التطبيقات غالبا لا توفر ما يوفره أنكي من الميزات المتقدمة. أشهر مقلد لأنكي هو تطبيق يدعى AnkiApp\nخدع كثيرا من المستخدمين لكي يظنوا أنه أنكي الأصلي. [منتديات أنكي الرسمية](https://forums.ankiweb.net/)\nتعج بمنشورات حول مستخدمين يسألون حول AnkiApp ظنا منهم أنه تطبيق رسمي من مؤلف أنكي الأصلي.\nمؤخرا طلب مني أحد الأخوة من مجموعة التلجرام العربية أن أساعده على تصدير رزمه من هذا التطبيق. وجدت عندها\nأن التطبيق للأسف بدأ يطلب اشتراكا مدفوعا لكي يسمح للمستخدمين بتصدير رزمهم من التطبيق بسهولة.\nلكن لا شيء تقني لا يمكن كسر قيده، لذلك فقد نجحت في إيجاد طريقة بسيطة لاستخراج الرزم من بيانات تطبيق الكمبيوتر المحلية\nونشرت إضافة تساعد على استيراد رزم AnkiApp إلى Anki الأصلي.\n\n### [InContext](https://github.com/abdnh/anki-incontext)\n\n![واجهة إضافة InContext](/assets/images/incontext.png)\n\nهذه إضافة لتعلم اللغات توفر واجهة لجلب الجمل من عدة مصادر أونلاين وأوفلاين مع إمكانية دعم أي لغة.\nتوفر الإضافة خيار لإظهار جمل عشوائية في البطاقات أيضا.\nهذه الإضافة ما زالت في مراحل التطوير الأولى، ولدي خطط لإضافة ميزات وتحسينات كثيرة.\nهذه أكثر إضافة متحمس للعمل عليها حاليا لأن لدي هوس بجمع آلاف الجمل في اللغات التي أتعلمها وتكديسها.\n\n### إضافات أخرى\n\nنشرت وما زلت أنشر عديد من الإضافات الأخرى يمكن الاطلاع عليها هنا: <https://github.com/abdnh?tab=repositories&q=anki&type=&language=&sort=>\n\n## مشاريع برمجية أخرى\n\nلدي مشاريع أخرى صغيرة أغلبها ليس مفيدا لأحد غيري: <https://github.com/abdnh?tab=repositories&q=&type=source&language=&sort=>\n"
    },
    {
      "title": "مراجعات أفلام وثائقية",
      "date": "2021-04-20",
      "uuid": "6f61d2b6-cdaa-4b69-8514-7c3cbfe3bfcb",
      "lastModified": "2022-07-22",
      "tags": [],
      "id": "reviews/documentaries",
      "content": "\nسأكتب هنا بعض الأفكار والمراجعات عن أفلام وثائقية شاهدتها.\n\n## The Social Dilemma - المعضلة الاجتماعية (2020) {#the-social-dilemma}\n\nفلم وثائقي يتحدث عن أثر التكنولوجيا، وسائل التواصل الاجتماعي على وجه الخصوص، في المجتمع\nوالمشاكل التي خلقتها أو عززتها.\n\nالوثائقي هو مزيج بين مقابلات بين خبراء تكنولوجيا يلقون الضوء على هذه المشاكل (كثير منهم متورطون فيها)\nوجانب يجسد هذه المشاكل في قالب درامي.\n\nأكبر مشكلة يستعرضها الوثائقي هي تعزيز وسائل التواصل للتطرف والتحزب عن طريق توفير «فقاعة آمنة» للمستخدم\nبعيدا عن الآراء التي تظن عقول هذه الوسائل، خوارزميات الذكاء الاصطناعي، أنها لا تثير اهتمامه.\nهذه الخوارزميات مبرمجة لتحقيق أكبر قدر من الربح لأصحابها وليست لديها مفاهيم أخلاقية\nتردعها عن تصرفات تتلاعب بنفسية المستخدم، بل إنها قد تكون مبرمجة لاستغلال «ثغرات»\nفي نفسية البشر لتعزيز الإدمان على منصتها، من خلال مثلا فكرة الـfeed المخصص على ذوق المستخدم\nوميوله والذي ليس له نهاية مهما سحبت بجهازك (الذكي) إلى الأسفل،\nأو نتائج البحث في محركات البحث التي تتغير أيضا حسب الشخص، والتي قد تؤثر بمعتقداتك وتوجهها\nوقد ينتهي بك المطاف بتصديق نظريات مؤامرة لا أساس لها.\nأعجبني عرض الوثائقي لهذه الخوارزميات غير العاقلة كمجموعة أشخاص يعملون في الخفاء\nويفكرون بطرق لجذب شاب لقضاء أكبر قدر من الوقت على منصتهم.\nهذه الفقاعة التي تشكلها وسائل التواصل هي مولد للتطرف والتغيرات الجذرية على أرض الواقع وليست حبيسة العالم الافتراضي.\nأبرز مثال على هذا هو ادعاءات تأثير فيسبوك على نتائج انتخابات الولايات المتحدة سنة 2016\nمن خلال سماحها للأخبار الكاذبة بالانتشار.\nمن هذه الناحية، وسائل التواصل هي عبارة عن قوى قد يكون لها تأثير حكومات،\nأو أكثر من بعض النواحي. وهذا ما يستدعي ضرورة سن قوانين لتنظيم هذا العالم\nالافتراضي الفوضوي.\n\nمشكلة أخرى هي استغلال وسائل التواصل لغريزة الإنسان للتواصل مع بني جلدته،\nحيث لهذه الوسائل القدرة على تحويل هذه الغريزة إلى قلق اجتماعي يجعل الشخص مهتما\nلدرجة مَرَضية بآراء الآخرين، حتى لو كان هؤلاء الآخرين غرباء تماما لا يعرفهم على أرض الواقع.\nتتجسد هذه المشكلة بشكل أبرز في الشباب نظرا إلى التطور النفسي والاجتماعي الذي يمرون به في هذه المرحلة.\nيضرب الوثائقي مثالا بمعدلات إيذاء النفس والانتحار في الولايات المتحدة بعد مطلع العقد الثاني من هذا القرن\nتزامنا مع تزايد شعبية وسائل التواصل، حيث قد يتكون لدى الشباب توقعات غير واقعية\nعن مفاهيم مثل الجمال والإنجاز وغيرها نتيجة تعرضهم لضخ اجتماعي أكبر على هذه الوسائل.\n\nأضف إلى كل هذا إشعارات التطبيقات ورسائلها التي تتنافس على كسب انتباهك المحدود أصلا\nوتستغل فضول الاطلاع وتحصيل المعلومات لديك، ومراقبة تفاعل المستخدم مع المنصات\nوبيع معلوماتهم لأطراف أخرى لها أهداف منها تسويق منتجاتها.\n«زبائن وسائل التواصل هم المعلنون وليس المستخدمين؛ المستخدمون هم السلعة»\nعلى حد قول أحد الأشخاص الذي تمت مقابلتهم في الوثائقي.\n\nمع كل هذا، وسائل التواصل لها إيجابيات لا يمكن إنكارها طبعا، أوضحها هي تسهيل التواصل\nوكسر الحواجز بين الناس في مختلف بقاع الأرض. المشكلة هي ليست فعلا في مفهوم وسائل التواصل،\nبل في بعض التقنيات التي يتم توظيفها في كبرى هذه الوسائل والتي قد يكون لها آثار سيئة.\n"
    },
    {
      "title": "مراجعات أفلام ومسلسلات",
      "date": "2022-02-25",
      "description": "مراجعات لأفلام ومسلسلات شاهدتها",
      "uuid": "394cd1eb-8ac7-4084-ae66-957ca75e58b9",
      "lastModified": "2022-07-22",
      "tags": [],
      "id": "reviews/movies",
      "content": "\n## Mind Your Language\n\n\n[Mind Your Language](https://en.wikipedia.org/wiki/Mind_Your_Language) هو مسلسل كوميدي يروي قصة معلم لغة إنجليزية في بريطانية (جيرمي براون) وطلابه الأجانب من دول مختلفة والمواقف المضحكة التي تحصل معهم. بدأ عرض المسلسل سنة 1977.\n\nكوميدية المسلسل تعتمد غالبا على الضحك على إنجليزية الطلاب ومواقف سوء الفهم التي تنتج عنها. لكل شخصية طابعها الخاص وتصرفاتها المضحكة والنكت مضحكة غالبا لكنها أحيانا تُشعر ببعض التكرار، كما أن غباء الطلاب يصبح أحيانا لا يطاق.\n\nشخصيات الطلاب الأجانب غالبا مقولبة وتعتمد جل كوميدية المسلسل على كونهم أجانب، ما جعل بعض الناس يجد المسلسل عنصريا.\nفي الحقيقة تم إيقاف المسلسل بعد 3 أجزاء من قبل مخرجه لهذا السبب. شخصيا لم أشعر أن المسلسل عنصري في أغلب الأحيان لكن أتفهم لم قد يعتقد بعض الناس ذلك (بسبب إظهار الطلاب بغباء ممقوت أحيانا مثلا).\n\nحصل المسلسل على جزء رابع لاحقا سنة 1985 لكنه لا يتضمن كل الشخصيات الأصلية ويستحيل إيجاد حلقاته على الإنترنت (هناك إشاعات أن الاستديو المنتج فقد حلقاته في حريق لذلك لم تنزل أقراص DVD له). وجدت الحلقة الأولى فقط وشاهدت لقطات منها ولم تعجبني: هناك تكرار للأفكار ولم يعجبني تمثيل الشخصيات، خصوصا الجديدة.\n\nشاهدت المسلسل 3 مرات في آخر 5 سنوات. تعرفت عليه عندما بدأت أتعلم اللغة الإنجليزية وانتهيت من المشاهدة الثالثة مؤخرا.\n\n## كفرناحوم\n\nيحكي [الفلم](https://ar.wikipedia.org/wiki/%D9%83%D9%81%D8%B1%D9%86%D8%A7%D8%AD%D9%88%D9%85_(%D9%81%D9%8A%D9%84%D9%85))\nقصة الولد ذي الإحدي عشر عاما زين. زين من عائلة فقيرة في بيروت.\nيأخذنا الفلم مع يوميات زين ومعاناته مع أهله لكسب لقمة عيشهم.\n\nشاهدت الفلم بعد توصية صديق أخبرني أن الممثل بدور الولد، [زين الرافعي](https://ar.wikipedia.org/wiki/%D8%B2%D9%8A%D9%86_%D8%A7%D9%84%D8%B1%D8%A7%D9%81%D8%B9%D9%8A)،\nلاجئ سوري عاش في بيئة مشابهة من بيئة الفلم بعد أن هاجر من بلده إلى بيروت. توقعت بطبيعة الحال\nأن يكون محور الفلم معاناة اللاجئين وحياتهم لكن تبين لي أن زين في الفلم لبناني الأصل وليس سوريا\nوالفلم لا يتحدث فقط عن اللجوء وإنما يتناول مشاكل اجتماعية أخرى\nمثل زواج القاصرات والتجارة بالبشر والهجرة غير الشرعية.\n\nهل يجب أن أقول إن الفلم محزن؟ إنه محزن طبعا وفيه كثير من الواقعية:\nتصويره لظروف المعيشة التي يعيش فيها أهل زين وتفاعلهم، خصوصا تكلم الممثلين\nبكلام بذيء شائع في الحياة الواقعية لكني لم أره في فلم من قبل.\n\nلكنني أحسست بنقص وإحباط مكبوت عندما أنهيته. النهاية وطريقة تنفيذها وقصة المحكمة والرسالة بدت لي مفتعلة وجافة.\n\n### ذو صلة\n\n- [مراجعة للفلم في موقع الجزيرة](https://www.aljazeera.net/blogs/2019/3/28/%D9%85%D8%A7-%D9%82%D8%A7%D9%84%D9%87-%D9%81%D9%8A%D9%84%D9%85-%D9%83%D9%81%D8%B1%D9%86%D8%A7%D8%AD%D9%88%D9%85).\n"
    },
    {
      "title": "معرض صخر",
      "date": "2021-03-06",
      "tags": [
        "computer"
      ],
      "uuid": "852ad03-c049-452f-af08-2aeec0f6d036",
      "lastModified": "2022-07-24",
      "id": "sakhr-gallery",
      "content": "\nسأنشر هنا جولاتي مع برامج صخر كما قلت في [مقالة صخر]({% post_url 2021-03-06-sakhr %})،\nبالإضافة إلى مراجع وروابط على الإنترنت لكل ما يتعلق بصخر.\n\n---\n\n## برامج الأسرة و Microsoft Bob\n![واجهة برامج الأسرة](/assets/images/sakhr-osra-suite.png)\n\nواجهة برامج الأسرة ذكرتني ببرنامج [Microsoft Bob][microsoft-bob] من شركة مايكروسوفت.\n\n![واجهة مايكروسوفت بوب](/assets/images/microsoft-bob.png)\n\nللبرنامجين الفكرة نفسها: واجهة مبسطة على شكل غرفة بديلة لنظام التشغيل مع تشكيلة برامج منوعة ومرشد إلكتروني.\n\nصدر برنامج بوب سنة 1995، قبل برامج الأسرة. وأظن من المحتمل جدًا أن فكرة برامج الأسرة مأخوذة منه.\n\nالفرق الكبير بين البرنامجين هو أن سمعة بوب سيئة ويعد من أكثر منتجات مايكروسوف فشلًا.\nأنا لم أستخدم بوب من قبل، لكن بعد المطالعة عنه في الإنترنت تبين لي\nأن مستوى التفاعلية والتعقيد فيه أكبر بأضعاف مما في برامج الأسرة،\nوواضح مستوى الجهد المبذول في الإعداد والتسويق من قبل مايكروسوفت (متوقع من شركة عملاقة).\n\nمع كل ذلك البرنامج فشل. ربما لأنه ظهر لكثير من المستخدمين كبرنامج للأطفال فقط و\"استغباء\" للمستخدمين -مع أن مايكروسوفت سوقته على أنه للجميع-\nأو بسبب سعره المرتفع أو متطلبات التشغيل العالية. [^1] [^2] [^3]\n\nمع ذلك، أظن أن معظم الأطفال قد أحبوه بالفعل كما أحببنا نحن برامج الأسرة.\n\nمعلومة طريفة: مرشد برنامج بوب الافتراضي، الكلب المسمى Rover، عاود الظهور في أداة البحث في ويندوز إكس بي لمن يذكره.\n\n![كلب البحث في ويندوز إكس بي](/assets/images/windows-xp-rover-dog.jpg)\n\nمعلومة أطرف: تم تمضين نسخ مشفرة من برنامج بوب في الأقراص المضغوطة لتنصيب ويندوز إكس\nبي من قبل مطور في مايكروسوف. كان الهدف هو إبطاء محاولات قرصنة النظام وتوزيعه على الإنترنت\n(30 ميغابايت كانت كفيلة بفعل ذلك في ذلك الوقت)، والتمييز بين النسخ المختلفة للنظام وعدم السماح باستخدام مفاتيح تفعيل مخصصة لنسخ أخرى.\n\nالمطور الذي فعل هذا خرج مؤخرًا سنة 2020 بهذا السر. [^4] [^5] [^6]\n\nبوب كان مفيدًا لمايكروسوفت بعد موته أكثر مما كان في حياته على حد قول مطور آخر. [^7]\n\n## برنامج القرآن الكريم\n\n![واجهة بداية برنامج القرآن الكريم لصخر](/assets/images/sakhr/quran-1.png)\n\n![شاشة القراءة في برنامج القرآن الكريم لصخر](/assets/images/sakhr/quran-2.png)\n\nطورت شركة صخر أول برنامج قرآن كريم. ترأس المشروع العالم الفذ نبيل علي، وقد استُخدمت\nتقنيات معالجة لغوية حديثة فيه. للبرنامج عدة ميزات بالإضافة إلى عرض النص القرآني منها البحث المتقدم\nالمعتمد على الجذور، والبحث حسب الموضوع، وشرح المعاني، وتمرين على تحفيظ القرآن،\nومرجع لأسماء لكتب في علوم القرآن، إلخ.\n\nكمية الجهد المبذولة في صنع البرنامج رهيبة، خصوصا إذا أخذنا بعين الاعتبار زمنه.\n\nفيديو استعراضي للبرنامج تم تسجيله في محاكي: <https://www.youtube.com/watch?v=Ph0GvA13mfc>\n\n## روابط خارجية\n\nسأضع هنا روابط حول كل ما يخص صخر مما أجده على الإنترنت.\n\n- ويكيبيديا:\n  - [حاسوب صخر](https://ar.wikipedia.org/wiki/%D8%AD%D8%A7%D8%B3%D9%88%D8%A8_%D8%B5%D8%AE%D8%B1)\n  - [شركة صخر](https://ar.wikipedia.org/wiki/%D8%B5%D8%AE%D8%B1_(%D8%B4%D8%B1%D9%83%D8%A9))\n  - [محمد الشارخ](https://ar.wikipedia.org/wiki/%D9%85%D8%AD%D9%85%D8%AF_%D8%A7%D9%84%D8%B4%D8%A7%D8%B1%D8%AE)، مؤسس شركة صخر.\n  - [نبيل علي](https://ar.wikipedia.org/wiki/%D9%86%D8%A8%D9%8A%D9%84_%D8%B9%D9%84%D9%8A)، من العقول الكبيرة خلف صخر.\n- مقابلات ومحاضرة على منصة TED لمؤسس شركة صخر محمد الشارخ:\n  - <https://www.youtube.com/watch?v=aBFWu4H9Bjg>\n  - <https://www.youtube.com/watch?v=lkJL-vWq2LQ>\n  - <https://www.youtube.com/watch?v=XqkH6M2BPLE>\n- مقالات منوعة:\n  - [شركة صخر ، كيف كانت و الى أين انتهت ؟! - حسوب](https://io.hsoub.com/culture/26794-%D8%B4%D8%B1%D9%83%D8%A9-%D8%B5%D8%AE%D8%B1-%D9%83%D9%8A%D9%81-%D9%83%D8%A7%D9%86%D8%AA-%D9%88-%D8%A7%D9%84%D9%89-%D8%A3%D9%8A%D9%86-%D8%A7%D9%86%D8%AA%D9%87%D8%AA)\n  - [شركة “ضخر” العربية للبرمجيات … حقيقة تم تحويلُها إلى حُلم - بالعربية](https://bilarabiya.net/13055.html)\n  - [تعرف على المهندس المصري نبيل علي محمد وإسهاماته في المعالجة الآلية للغة العربية - إم آي تي تكنولوجي ريفيو](https://technologyreview.ae/%D8%A5%D8%B3%D9%87%D8%A7%D9%85%D8%A7%D8%AA-%D8%A7%D9%84%D9%85%D9%87%D9%86%D8%AF%D8%B3-%D8%A7%D9%84%D9%85%D8%B5%D8%B1%D9%8A-%D9%86%D8%A8%D9%8A%D9%84-%D8%B9%D9%84%D9%8A-%D9%85%D8%AD%D9%85%D8%AF/)\n  - [من هو الدكتور نبيل علي الذي تحتفل غوغل بميلاده الـ 82؟ - العربية](https://www.alarabiya.net/last-page/2020/01/03/%D9%85%D9%86-%D9%87%D9%88-%D8%A7%D9%84%D8%AF%D9%83%D8%AA%D9%88%D8%B1-%D9%86%D8%A8%D9%8A%D9%84-%D8%B9%D9%84%D9%8A-%D8%A7%D9%84%D8%B0%D9%8A-%D8%AA%D8%AD%D8%AA%D9%81%D9%84-%D8%AC%D9%88%D8%AC%D9%84-%D8%A8%D9%85%D9%8A%D9%84%D8%A7%D8%AF%D9%87-%D8%A7%D9%84%D9%80-82%D8%9F)\n  - [Game Gulf - The Magazine](https://the-magazine.org/11/game-gulf)\n  - [ممكن احد يعطينا معلومات عن شركة صخر واين هي اليوم - البوابة الرقمية ADSLGATE](https://www.adslgate.com/dsl/showpost.php?p=1830060)\n- روابط تحميل:\n  - برامج الأسرة:\n    - <https://www.aboharon.com/2017/04/windows-95-arabic.html>\n    - <https://www.4shared.com/rar/l1F71K2k/___online.html>\n  - برامج حاسوب صخر مع محاكي:\n    - <https://www.mediafire.com/file/73r8u8za51wx79b/Complete_Arabic_MSX_%2528Rare_Pack%2529.zip/file>\n    - روابط بديلة لمجموعة برامج منصة MSX عمومًا مع محاكي منفصل:\n      - <http://www.emulator-zone.com/doc.php/msx/bluemsx.html>\n      - <https://download.file-hunter.com/Games/MSX1/ROM/>\n      - <https://download.file-hunter.com/Games/MSX2/ROM/>\n- محتوى ثري على يوتيوب: [كمبيوتر صخر - يوتيوب](https://www.youtube.com/results?search_query=%D9%83%D9%85%D8%A8%D9%8A%D9%88%D8%AA%D8%B1+%D8%B5%D8%AE%D8%B1)\n\n\n[microsoft-bob]: https://en.wikipedia.org/wiki/Microsoft_Bob\n\n[^1]: <https://www.youtube.com/watch?v=RkU4WWEUj-Y>\n[^2]: <https://www.howtogeek.com/687748/why-i-loved-microsoft-bob-microsofts-strangest-creation/>\n[^3]: <https://www.technologizer.com/2010/03/29/microsoft-bob/>\n[^4]: <https://www.youtube.com/watch?v=rXHu9OmLd8Y>\n[^5]: <https://www.theregister.com/2020/11/25/xp_bob>\n[^6]: <https://www.technologizer.com/2010/03/29/windows-xp-a-free-copy-of-bob-in-every-box/>\n[^7]: <https://docs.microsoft.com/en-us/previous-versions/technet-magazine/cc565089(v=msdn.10)>\n"
    },
    {
      "title": "ذكريات من صخر",
      "date": "2021-03-06",
      "tags": [
        "computer"
      ],
      "uuid": "52f5da53-b111-4068-ba8f-ddd6be95d237",
      "lastModified": "2022-07-24",
      "id": "sakhr",
      "content": "\n![واجهة برامج الأسرة](/assets/images/sakhr-osra-suite.png)\n\nإذا كان \"مستوى النوستالجيا\" لديك قد ارتفع عند رؤية هذه الصورة فتحية لك، وحتى لو لم تحدث لك أي تغييرات جسدية فتحية لك أيضًا!\n\nهذه الصورة كفيلة بفتح شلال حنين إلى «الزمن الجميل» لمن يتعرف عليها.\nلكن ألق نظرة أخرى إلى هذه الصور أيضًا لتتدفق لديك شلالات الحنين تدفقًا (مبالغة).\n\n![واجهة لعبة اختبر معلوماتك](/assets/images/sakhr-tyk.png)\n\n\nهذه الصور من «برامج الأسرة»؛ مجموعة برامج نزلت حوالي سنة 1998 م.\nأُنتجت هذه البرامج من قبل شركة البرمجيات العربية [صخر][sakhr-wiki].\n\nبرامج الأسرة هي حزمة برامج  يمكن الوصول إليها من خلال واجهة مبسطة بديلة للنظام الأساسي على شكل غرفة.\nلمعظم هذه البرامج طابع تعليمي، وقد شكلت أدفئ ذكريات الطفولة لدى الكثيرين، منهم أنا:\n\n«لعبة الغواصة»، «اختبر معلوماتك»، «كلمات ومعاني»، والمضيف على شكل حاسوب الذي يرحب بك في بداية البرنامج ويرشدك...\n\nمع أنني لست من جيل التسعينيات حتى، إلا أنني كنت محظوظًا لكي أجرب برامج الأسرة في طفولتي.\nما زلت أذكر كيف كنت أذهب إلى خالتي لألعب ألعاب برامج الأسرة على حاسوبها،\nوالذي كان يشغل نظام Windows Me إذا كنت أذكر جيدًا.\n\nقادني مؤخرًا بحثي المتواصل في الإنترنت (أو التصفح المشتت أو \"البحبشة\" بمعنى أدق) لاسترجاع ذكريات برامج الأسرة،\nفذهبت أنقب عن رابط تنزيل بطبيعة الحال ووجدته بسرعة[^1]. كان هذا الجزء السهل،\nلنأتي الآن للجزء المثير للاهتمام: \n\nالبرامج نزلت لنظام ويندوز 95 غالبًا وقد لا تعمل على الأنظمة الحديثة مثل ويندوز 10.\nنسخة البرامج التي حملتها تحتوي على برنامج محاكاة ونسخة كاملة من ويندوز 95.\nاشتغل البرنامج وظهرت الواجهة لكن لم تعمل الفأرة لسبب أجهله (ربما مشكلة في المحاكي).\nعلى كل حال، وجدت الحل الخنفشاري المعقد وهو تنزيل نسخة ويندوز 95 من الإنترنت وتشغيلها\nببرنامج محاكاة مجرب مثل VirtualBox.\nبعد معاناة وسهر طويلين ومشاكل تقنية عدة (التفاصيل المثيرة في الأسفل) واجهتها خلال تنصيب نظام ديناصوري مثل ويندوز 95 -حتى لو كان على نظام محاكاة-، تمكنت أخيرًا من تشغيل البرنامج،\nوانفتح صدري بسماع المضيف يرحب بي...\nلعبت ألعابي المفضلة قليلًا واسترجعت معها ذكريات لطيفة.\n\nثم تذكرت أنني منذ ما يقل عن سنتين نزلت برامج الأسرة بالفعل واستطعت تشغيلها\nبدون صعوبة كثيرة، لكني لم استخدمها كثيرًا...\n\nعندما فكرت لمَ لم أواجه مثل هذه الصعوبات سابقًا تذكرت أن برامج الأسرة يمكن أن تعمل بالفعل\nعلى الأنظمة الحديثة، لكن لكونها برامج 16 بت فهي لا تعمل على أنظمة ال64 بت إلا باللجوء إلى طرق\nوتنزيل برامج. ممكن أن تعمل على أنظمة 32 بت بدون مشاكل، وكان من الممكن أن أنصب نظامًا نزل\nفي القرن الحالي مثل الأسطورة إكس بي بدل العودة إلى الماضي البعيد...\n\nنزلت نظام إكس بي 32 بت ونصبته في  VirtualBox وحاولت تشغيل البرامج فيه للتسلية فقط، وبالفعل كانت عملية سلسلة وسهلة.\n\nعلى كل حال، كان دافع هذه المغامرة بشكل رئيسي هو الفضول المحض وحب الاستكشاف.\nوبالحديث عن الاستكشاف، فقد قادتني برامج الأسرة لأن أقفز down the rabbit hole كما يقول المثل الإنكليزي، وأبحث عن شركة الصخر وتاريخها.\n\nهنا نأتي لمنتج آخر مهم جدًا لشركة صخر، وهو [حاسوب صخر][sakhr-computer].\nلم أكن أعمل بوجود هذا المخلوق من قبل وتعرفت عليه منذ أيام فقط.\nطبعت شعرت بالحسرة لأنني لم أحظَ بفرصة تكوين ذكريات طفولة معه :)\nلكني لم أكن من جيله ولم يكن متوفرًا في موطني أصلًا...\n\nكان حاسوب صخر مشروعًا مشتركًا لصخر مع شركة ياماها اليابانية في أوائل ثمانينيات القرن العشرين،\nوهو مبني على معمارية MSX المؤسسة من قبل مايكروسوفت، والتي نتج عنها حواسيب كثيرة\nكانت رائجة في مناطق مختلفة حول العالم لكنها سرعان ما أصبحت صفحة من التاريخ في التسعينات،\nوذهب معها حاسوب صخر...\n\nخلف حاسوب صخر أيضًا ذكريات ربما تكون أكبر من ذكريات برامج الأسرة عند الكثيرين.\nحتى ولو لم أكن محظوظًا بما فيه الكفاية لرؤية الحاسوب وجهًا لوجه، رغبت على كل حال في\nإيجاد طريقة لتشغيل برامجه. فكرت بخيارين:\n- الأول هو اختراع/إيجاد آلة زمن والسفر عبرها إلى عصر صخر.\n- إيجاد برنامج محاكاة.\n\nغني عن الذكر أنني طبقت الخيار الثاني، ليس لأنني أفضله، لكن رضوخًا للواقع.\n\nوبالفعل، لم أواجه صعوبة في إيجاد برنامج محاكاة وتشغيل برامج صخر بسهولة فاقت سهولة\nتشغيل برامج الأسرة[^2].\n\nلم أجرب كثيرًا من برامجه حتى الآن، حيث لفت نظري شيء في واجهة البداية\nجعلني أنسى تجريب البرامج...\n\n![واجهة كمبيوتر صخر](/assets/images/sakhr-computer-date.png)\n\nما الملفت للنظر في هذه الصورة؟\n\nدقق في التواريخ... \n\nالتاريخ الميلادي يطابق التاريخ الفعلي حينما التقطت هذه الصورة ما عدا أن السنة هي\n1921 وليس 2021 كما هو واضح.\n\nحالما رأيت هذا خطرت في بالي مشكلة معروفة جدًا لمن له بعض الخبرة بالبرمجة، وهي ما يسمى [بمشكلة عام 2000][y2k-ar] ([Year 2000 problem][y2k] أو Y2K اختصارًا).\n\nالمشكلة باختصار هي أن كثيرًا من البرامج في القرن الماضي اعتادت تخزين آخر منزلتين من السنة فقط لتوفير المساحة لأن كل بت كان ثمينًا في ذلك الوقت.\n\nاعتمد البرمجون على افتراض أن أول منزلتين هما دومًا 19 وعرضوا السنة كاملة في واجهات المستخدم بإضافة 19 ببساطة.\nربما لم يفكروا أن برامجهم ستبقى على قيد الحياة في القرن الواحد والعشرين.\n\nنسبة الخطأ في التاريخ الهجري هي 102 سنة وشهر تقريبًا. هنا أيضًا تظهر مشكلة عام 2000،\nلكن قد يكون هذا متوقعًا، حيث إن مصدر التاريخين واحد، وهو ساعة النظام الداخلية المخزنة كمنزلتين فقط.\n\nبخصوص السنتين الباقيتين، فهي لأن مقابل سنة 1921 في التقويم الهجري هي سنة 1339 فعلًا،\nوالنظام يحسب السنة الهجرية بافتراض أنه في القرن العشرين، لذلك فالمشكلة واحدة، وهي مشكلة عام 2000 كما تقدم.\n\nخُيِّل لي وأنا أبحث عن هذا الموضوع أننا لو أعدنا التاريخ إلى سنة 1980 م مثلًا\n(والتي تقابلها سنة 1406 ه)، أن البرنامج سيعرض السنة الهجرية كـ 1306!\n\nطبعًا كنت مخطئًا، فالبرنامج ذكي كفاية ليعرض 13 أو 14 حسب الوقت الفعلي (بالنسبة للقرن الماضي على الأقل).\n\nدفعتني \"غريزتي النيردية\" (أو التخريبية) لأن أبحث عن حيلة أخدع بها البرنامج ليظن\nأنه في زمن مختلف، مثل زمن نزوله (1986 م تقريبًا) لكي أنظر كيف سيتصرف ويعرض\nالتواريخ حسب تواريخ فعلية مختلفة.\n\nليس هناك آلة زمن للأسف، لكن بالطبع هناك برنامج لمحاكاة ذلك! إنه [RunAsDate] من مجموعة برامج\nNirSoft الأسطورية!\n\nهنا أطلقت العنان لنفسي وبدأت أجرب تواريخ مختلفة، وخرجت بنتائج بعضها متوقع وبعضها\nالآخر ما زال مبهمًا بالنسبة لي.\n\nأولًا، بدأت أختبر ما إذا كانت ساعة النظام الداخلية مخزنة حسب ما يسمى [توقيت يونكس][unix-epoch] (Unix time)،\nوالذي يعني عدد الثواني منذ سنة 1970 م. هذا النظام مستخدم في كثير من أنظمة يونكس الحديثة وغيرها.\n\nخرجت النتيجة سلبية، حيث عرض البرنامج سنة 1970 كـ 1937! وبدأت ألغاز جديدة...\n\nرحت أجرب تواريخ أخرى قبل سنة 1970 وبعدها خرجت إلى أن التاريخ مخزن حسب سنة 1980،\nلكن لا يبدو أن السنوات قبل هذه السنة يمكن تمثيلها بشكل صحيح في الحاسوب حسبما ظهر بعد\nتجربة سنة 1970 وسنوات أخرى عديدة، وهذه صحيح حتى لسنوات مستقبلية بعد 1980:\nسنة 2107 مثلًا تُعرض كـ 1930!\n\nوبعض الفواصل الزمنية سواء الماضية أم المستقبلية يرفض البرنامج العمل بها إطلاقًا! (جرب سنة 2039 م)\n\nهذه بعض التواريخ التي جربتها بهدف استخراج نمط مفهوم:\n\nالتاريخ الفعلي | تاريخ البرنامج\n------------:|-------------:\n2280         | 1907\n2180         | لا يعمل\n2110         | 1929\n2109         | 1928\n2108         | 1927\n2107         | 1930\n<span dir=\"ltr\">2039 <= x <= 2106</span>         | لا يعمل\n2038         | 1938\n2037         | 1937\n1995         | 1995\n1980         | 1980\n1979         | 1945\n1970         | 1937\n1960         | 1927\n1950         | 1917\n1940         | 1907\n1933         | 1900\n1932         | 1999\n1931         | 1998\n1930         | 1997\n1920         | 1987\n1916         | 1983\n1915         | 1982\n1913         | 1980\n1912         | 1945\n1910         | 1943\n1905         | 1928\n1903         | 1930\n1902         | لا يعمل\n1853         | لا يعمل\n\n\nكنت أتوقع أن أرى أشياء معتادة مثل [overflow][integer-overflow] حين يبلغ الرقم حدًا معينًا، لكن\nما رأيته هو أن رفع العدد بقيمة واحد قد يأتي بتغيرات غريبة كما ترون في التغير بين\nسنة 2107 وسنة 2108.\n\nذهبت بعدها أقرأ على الشبكة حول معمارية حاسوب صخر، خصوصًا كيف يخزن التاريخ،\nوخرجت بهذه المقالة المفيدة حول ما أظن أنه العداد نفسه المستخدم في حاسوب صخر:\n\n<https://www.msx.org/wiki/Clock_chip_/_RP-5C01>\n\nالمقالة تقول إن السنة مخزنة في بايت واحدة، 4 بتات لكل منزلة من المنزلتين.\nلكن ما زال سلوك البرنامج غير مفهوم بالنسبة لي.\n\nجربت تعديل قيمة السِجِل (register) الذي تخزن السنة فيه يدويًا من خلال المحاكي.\nمحاكي [blueMSX] يوفر [debugger] لتتبع سلوك الحاسوب وتعديل كل شيء تقريبًا،\nلكنني لم أتمكن من معرفة موقع السجل الذي يجب تعديله.\n\nعلى كل حال، كانت هذه طريقة مطولة لأقول إنني فشلت... ربما أعود لحل هذا اللغز يومًا ما.\n\n## بعض العقول خلف صخر\n\nأثناء بحثي في تاريخ الصخر -والذي لم أجد عنه الكثير للأسف- تعرفت بطبيعة الحال على أبرز الوجوه خلف مشروع صخر:\n- محمد الشارخ: مؤسس الشركة.\n- نبيل علي: عالم حاسوب ومفكر.\n\nالنقطة المشتركة الكبرى بينهما هي إيمانهما بضرورة تطوير اللغة العربية وأدوات لمعالجتها مواكبة لعصر المعلوماتية.\nوبالنظر إلى برامج صخر المتعلقة باللغة العربية، يمكنك القول بكل سهولة إن رؤيتهما نجحت وأنتجت أدوات\nمثل أول برنامج قرآن كريم وأدوات معالجة لغوية متقدمة.[^3]\n\nإذن أين صخر الآن؟\nالشركة ما زالت حية وتنتج أدوات عالية الجودة متعلقة باللغة العربية،\nلكن يبدو أن جل تركيزها اتجه إلى تسويق منتجاتها للعملاء الأجانب.\n\nإلا أن للشركة مشاريع موجهة للعرب، مثل [أرشيف المجلات الأدبية والثقافية][sakhr-archive]، و[مشروع المعجم العربي المعاصر][sakhr-lexicon]، و[مشاريع أخرى][alsharekh].\nمشروع المعجم خصوصًا أثار اهتمامي جدًا لأنني أعتقد أننا في حاجة لمثل هذه المشاريع،\nوأعجبني أنه فعلًا معجم معاصر، حيث يوفر واجهة إلكترونية سهلة الاستخدام\nمع ميزات مثل البحث عن أمثلة لاستخدام الكلمات والمترادفات والمتضادات والتراكيب.\nأرى هذه الميزات في أغلب المعاجم الإنجليزية المشهورة على الشبكة ويسرني توفرها في معجم عربي.\n\n## خاتمة\n\nكان هذا سردًا لمغامرتي مع صخر من جديد. أعرف أنها مقالة مملة مليئة بالتفاصيل التقنية،\nلكن قدراتي الأدبية ضعيفة.\n\nعلى كل حال، سأنشر صورًا وتعليقات حول مختلف برامج صخر أثناء تجربتها وأنشرها في مقالة منفصلة باسم [معرض صخر]({% post_url 2021-03-06-sakhr-gallery %}).\n\n\n[sakhr-wiki]: https://ar.wikipedia.org/wiki/%D8%B5%D8%AE%D8%B1_(%D8%B4%D8%B1%D9%83%D8%A9)\n\n[sakhr-computer]: https://ar.wikipedia.org/wiki/%D8%AD%D8%A7%D8%B3%D9%88%D8%A8_%D8%B5%D8%AE%D8%B1\n\n[y2k-ar]: https://ar.wikipedia.org/wiki/%D9%85%D8%B4%D9%83%D9%84%D8%A9_%D8%B9%D8%A7%D9%85_2000\n\n[y2k]: https://en.wikipedia.org/wiki/Year_2000_problem\n\n[RunAsDate]: https://www.nirsoft.net/utils/run_as_date.html\n\n[unix-epoch]: https://ar.wikipedia.org/wiki/%D8%AA%D9%88%D9%82%D9%8A%D8%AA_%D9%8A%D9%88%D9%86%D9%83%D8%B3\n\n[integer-overflow]: https://ar.wikipedia.org/wiki/%D8%B7%D9%81%D8%AD_%D8%B9%D8%AF%D8%AF_%D8%B5%D8%AD%D9%8A%D8%AD\n\n[blueMSX]: http://bluemsx.msxblue.com/index.htm\n\n[debugger]: https://ar.wikipedia.org/wiki/%D9%85%D8%B5%D8%AD%D8%AD\n\n[sakhr-archive]: https://archive.alsharekh.org/\n\n[sakhr-lexicon]: https://lexicon.alsharekh.org/\n\n[alsharekh]: https://alsharekh.org/\n\n[^1]: رابط تحميل مجموعة برامج الأسرة: <https://www.aboharon.com/2017/04/windows-95-arabic.html>\n\n[^2]: رابط تحميل برامج حاسوب صخر: <https://www.mediafire.com/file/uh9rln79hk7kfwq/msx.rar/file>\n\n[^3]: انظر [صفحة نبيل علي على ويكيبيديا](https://ar.wikipedia.org/wiki/%D9%86%D8%A8%D9%8A%D9%84_%D8%B9%D9%84%D9%8A)، و[محاضرة لمحمد الشارخ](https://www.youtube.com/watch?v=XqkH6M2BPLE).\n"
    },
    {
      "title": "خوارزمية «ساحة تحويل السكك الحديدية» لحساب العبارات الرياضية",
      "date": "2021-08-23",
      "tags": [
        "computer",
        "algorithms"
      ],
      "uuid": "621bd7c1-2890-48a6-8579-4b36196530ce",
      "lastModified": "2022-07-21",
      "id": "shunting-yard-algorithm",
      "content": "\r\nخوارزمية [ساحة تحويل السكك الحديدية](https://www.youtube.com/watch?v=CE-7Qptga7c) ([Shunting-yard algorithm](https://en.wikipedia.org/wiki/Shunting-yard_algorithm))\r\nهي خوارزمية يمكن استخدامها لتحليل العبارات الرياضية المكتوبة بالصيغة المعتادة المعروفة (مثل \"5 + 3\")،\r\nوالتي تدعى [ترميزا ضمنيا](https://ar.wikipedia.org/wiki/%D8%AA%D8%B1%D9%85%D9%8A%D8%B2_%D8%B6%D9%85%D9%86%D9%8A) ([Infix notation](https://en.wikipedia.org/wiki/Infix_notation))،\r\nوتحويلها إلى عبارات مكتوبة بصيغة مثل <span dir=\"ltr\">\"5 3 +\"</span>\r\nحيث يكتب رمز كل عملية بعد [معاملاتها](https://ar.wikipedia.org/wiki/%D9%85%D8%B9%D8%A7%D9%85%D9%84_%D8%AD%D8%B3%D8%A7%D8%A8%D9%8A) (الأعداد) التي تعمل عليها.\r\nتدعى هذه الصيغة الأخيرة ترميز بولنديا معكوسا ([Reverse Polish notation](https://en.wikipedia.org/wiki/Reverse_Polish_notation))\r\n\r\nتعمل الخوارزمية بتوظيف بنية بيانات مشهورة وبسيطة وهي [المكدس](https://ar.wikipedia.org/wiki/%D9%85%D9%83%D8%AF%D8%B3_(%D8%A8%D9%86%D9%8A%D8%A9_%D8%A8%D9%8A%D8%A7%D9%86%D8%A7%D8%AA)) (stack)،\r\nحيث تخزن مكدسين (مكدس \"عمليات\" ومكدس \"مخرجات\") وتحلل كل عملية ومعاملاتها وتضيفها إلى واحد من المكدسين بترتيب يراعي قواعد\r\nأولوية العمليات المعروفة في الرياضيات[^1]. ينتج لدينا بعدها مكدس واحد غير فارغ (وهو مكدس المخرجات)\r\nيمكن ببساطة إخراج العمليات منه بترتيب *من يدخل أخيراً يخرج أولاً* (Last-In-First-Out)‏\r\nوإخراج معاملات كل عملية وإجراء العملية ثم إدخال النتيجة إلى المكدس مجددا واستخدامها كمعامل للعمليات المتبقية،\r\nليبقى لدينا في النهاية عدد واحد في مكدس المخرجات (بافتراض أن العبارة ليس فيها أي أخطاء) هو نتيجة العبارة الرياضية كلها.\r\nكما يمكننا إنتاج عبارة جديدة بالصيغة البولندية المعكوسة من هذا المكدس بدون حساب النتيجة،\r\nإذا كان ما يهمنا هو تحويل العبارة فقط وليس حساب نتيجتها.\r\n\r\n## أمثلة\r\n\r\nتعمل الخوارزمية على مكدسين اثنين كما قلنا: لندعُ الأول مكدس العمليات (operations)، والثاني مكدس المخرجات (output).\r\nلنأخذ العبارة التالية البسيطة كمثال عن كيفية عمل الخوارزمية: \"<code dir=\"ltr\">3 + 7</code>\".\r\n\r\n1) نصادف أولا الرقم 3 ونضيفه إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations: \r\noutput: 3\r\n{% endhighlight %}\r\n2) ثم تأتي عملية الجمع فنضيفها إلى مكدس العمليات.\r\n{% highlight plaintext %}\r\noperations: +\r\noutput: 3\r\n{% endhighlight %}\r\n3) أخيرا يأتي الرقم 7 فنضيفه إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations: +\r\noutput: 3 7\r\n{% endhighlight %}\r\n4) انتهينا من قراءة العبارة. الآن نخرج كل العمليات من مكدس العمليات بترتيب LIFO كما هو مبدأ عمل المكدس\r\n  ونضيفها إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations:\r\noutput: 3 7 +\r\n{% endhighlight %}\r\n5) تنتج لدينا العبارة التالية: \"<code dir=\"ltr\">3 7 +</code>\"\r\n\r\nلاحظ أننا أضفنا كل المعاملات (الأرقام) إلى مكدس المخرجات فور مصادفتنا لها،\r\nبينما أضفنا عملية الجمع إلى مكدس العمليات ثم نقلناها إلى مكدس المخرجات بعد الانتهاء من قراءة\r\nالعبارة كلها. يمكننا بعدها إخراج كل عملية ومعاملاتها من مكدس المخرجات وحساب النتيجة وإدخال النتيجة\r\nإلى المكدس مجددا لكي تشارك في حساب العمليات المتبقية (هنا ليس لدينا غير عملية واحدة).\r\n\r\n-----\r\nكان هذا مثالا بسيطا. لنأخذ مثالا أكثر تعقيدا بقليل: \"<code dir=\"ltr\">7 * 2 + 3</code>\".\r\n\r\n1) نضيف العدد 7 إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations: \r\noutput: 7\r\n{% endhighlight %}\r\n2) نضيف العملية * إلى مكدس العمليات.\r\n{% highlight plaintext %}\r\noperations: *\r\noutput: 7\r\n{% endhighlight %}\r\n3) نضيف العدد 2 إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations: *\r\noutput: 7 2\r\n{% endhighlight %}\r\n4) نصل لعملية الجمع. في العادة سنضيفها إلى مكدس العمليات، لكن لأن هناك عملية قبلها\r\n  لها أولوية أعلى (عملية الضرب)، فيجب نقل عملية الضرب إلى مكدس المخرجات أولا ثم فعل ذلك للحفاظ على ترتيب العمليات الصحيح.\r\n{% highlight plaintext %}\r\noperations: +\r\noutput: 7 2 *\r\n{% endhighlight %}\r\n5) نضيف بعدها العدد 3 إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations: +\r\noutput: 7 2 * 3\r\n{% endhighlight %}\r\n6) انتهينا من قراءة العبارة. ننقل كل العمليات المتبقية من مكدس العمليات إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations:\r\noutput: 7 2 * 3 +\r\n{% endhighlight %}\r\n\r\nكيف يمكننا حساب نتيجة العبارة الآن؟ ببساطة نخرج آخر عنصر من مكدس المخرجات (والذي\r\nيجب أن يكون عملية وليس عددا إذا كانت العبارة صحيحة) ونخرج أعدادا من المعاملات الموجودة\r\nبعده في المكدس حسب عدد المعاملات التي تأخذها العملية (ستكون معلومات كل عملية من\r\nأولوية وعدد معاملات مخزنةً مسبقا لدينا) ثم نجري العملية.\r\nفي مثالنا هذا سنخرج عملية الجمع والعدد 3 بعدها، لكن عملية الجمع تأخذ معاملين والعنصر\r\nبعد 3 ليس عددا بل عملية الضرب، فما العمل هنا؟ ما سنفعله هنا هو حساب العملية الأخرى\r\nالتي صادفناها (الضرب) بالطريقة نفسها واستخدام نتيجتها كمعامل للجمع بجانب العدد 3.\r\nبهذا الشكل نكون قد أجرينا العمليات بترتيب صحيح. بعد حساب عملية الضرب يصبح المكدس\r\nبهذا الشكل:\r\n{% highlight plaintext %}\r\noperations:\r\noutput: 14 3 +\r\n{% endhighlight %}\r\nنجري الآن عملية الجمع لنحصل على 17 كناتج نهائي للعبارة.\r\n\r\n-----\r\nلنأخذ عبارة شبيهة لكن هذه المرة مع أقواس لنرى كيف تتعامل معها الخوارزمية: \"<code dir=\"ltr\">7 * (2 + 3)</code>\".\r\n\r\n1) نضيف العدد 7 إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations: \r\noutput: 7\r\n{% endhighlight %}\r\n2) نضيف العملية * إلى مكدس العمليات.\r\n{% highlight plaintext %}\r\noperations: *\r\noutput: 7\r\n{% endhighlight %}\r\n3) نضيف القوس الأيسر \")\" إلى مكدس العمليات:\r\n{% highlight plaintext %}\r\noperations: * (\r\noutput: 7\r\n{% endhighlight %}\r\n4) نضيف العدد 2 إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations: * (\r\noutput: 7 2\r\n{% endhighlight %}\r\n5) نأتي لعملية الجمع. في المثال السابق نظرنا إلى آخر عملية في مكدس العمليات (الضرب) وقررنا \r\nأن ننقلها إلى مكدس المخرجات لأن لها أولوية أعلى من الجمع. هذه المرة نصادف القوس الأيسر، فما العمل؟\r\nفي هذه الحالة، نضيف العملية الحالية (الجمع) إلى مكدس العمليات ونستمر بقراءة العبارة ببساطة.\r\n{% highlight plaintext %}\r\noperations: * ( +\r\noutput: 7 2\r\n{% endhighlight %}\r\n6) نضيف العدد 3 إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations: * ( +\r\noutput: 7 2 3\r\n{% endhighlight %}\r\n8) نصادف القوس الأيمن \"(\". لا نضيفه لأي من المكدسات، بل نبدأ بإخراج عمليات من مكدس\r\nالعمليات وننقلها إلى مكدس المخرجات حتى نصادف قوسا أيسر \")\" أو يصبح مكدس العمليات فارغا\r\nتماما بدون أن نجد قوسا أيسر (في هذه الحالة هناك قوس ناقص يمكننا إعلام المستخدم عنه).\r\nبفرض أننا وجدنا قوسا أيسر، نخرجه من مكدس العمليات ونتخلص منه.\r\n{% highlight plaintext %}\r\noperations: *\r\noutput: 7 2 3 +\r\n{% endhighlight %}\r\n9) انتهينا من قراءة العبارة. ننقل كل العمليات المتبقية من مكدس العمليات إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations:\r\noutput: 7 2 3 + *\r\n{% endhighlight %}\r\n\r\nإذا نردنا حساب النتيجة فسنتبع الخطوات التالية:\r\n\r\n1) نبدأ بعملية الضرب ونجد أنها تعتمد على عملية قبلها وهي عملية الجمع.\r\n<div dir=\"ltr\">7 <span style=\"text-decoration: underline;\">2 3 +</span> *</div>\r\n\r\n2) نحسب عملية الجمع (\"<code dir=\"ltr\">2 3 +</code>\") لنحصل على العبارة التالية:\r\n<div dir=\"ltr\"><span style=\"text-decoration: underline;\">7</span> <span style=\"text-decoration: underline;\">5</span> *</div>\r\n\r\n3) حصلنا على معاملات عملية الضرب العددية. نجري الآن العملية لنحصل على 35 كناتج نهائي.\r\n\r\n-----\r\nلنأخذ مثالا آخر يوضح فكرة مهمة قد يسهو عنها من يريد تطبيق الخوارزمية (مثلي): \"<code dir=\"ltr\">5 - 2 - 2</code>\"\r\n\r\n1) نضيف العدد 5 إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations:\r\noutput: 5\r\n{% endhighlight %}\r\n2) نضيف عملية الطرح إلى مكدس العمليات.\r\n{% highlight plaintext %}\r\noperations: -\r\noutput: 5\r\n{% endhighlight %}\r\n3) نضيف العدد 2 إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations: -\r\noutput: 5 2\r\n{% endhighlight %}\r\n4) نأتي لعملية الطرح الثانية. ننظر لآخر عملية في مكدس العمليات ونجد العملية نفسها، لذلك فأولويات العمليتين متساويتان طبعا.\r\nما العمل الآن؟ هل (1) نضيف العملية الحالية إلى مكدس العمليات أم (2) يجب أولا أن ننقل العملية السابقة\r\nمن مكدس العمليات إلى مكدس المخرجات ثم نفعل ذلك؟\r\nفكر بما سيحدث في كلا الحالتين وجرب رسم حالة المكدسين كما نفعل هنا على ورقة قبل الاستمرار بالقراءة.\r\n\r\nدعنا نجرب كلا الخيارين ونرى:\r\n\r\nإذا اخترنا (1) فسننتهي بالعبارة البولندية المعكوسة \"<code dir=\"ltr\">5 2 2 - -</code>\".\r\n\r\nإذا اخترنا (2) فستنتج العبارة \"<code dir=\"ltr\">5 2 - 2 -</code>\".\r\n\r\nناتج (1) هو 5 بينما ناتج (2) هو 1. من البديهي أن الخيار (2) هو الصحيح حسب قواعد الرياضيات المعتادة.\r\n\r\nعبارة \"<code dir=\"ltr\">5 - 2 - 2</code>\" في الحقيقة يتم تحليلها كأنها كتبت \"<code dir=\"ltr\">(5 - 2) - 2</code>\".\r\n\r\nهناك عمليات مثل الطرح والقسمة تعارف الناس على حسابها بهذا الشكل، حيث يتم تجميع عوامل كل عملية بدءًا من اليسار،\r\nبينما هناك عمليات تُحسَب من اليمين (كما سنرى لاحقا). يعرف مفهوم اتجاه إجراء العمليات المتطابقة\r\nباسم «ترابط العمليات» ([operator associativity](https://en.wikipedia.org/wiki/Operator_associativity))\r\nفي لغات البرمجة. تدعى عمليات مثل الطرح والقسمة left-associative operators،\r\nبينما يقال لعمليات تُجمَّع من اليمين إلى اليسار إنها right-associative operators.\r\n\r\nستصبح المكدسات بهذا الشكل بعد أن تعرفنا على فكرة ترابط العمليات ونقلنا عملية الطرح السابقة\r\nمن مكدس العمليات إلى مكدس المخرجات ثم أضفنا عملية الطرح الثانية الحالية إلى مكدس العمليات:\r\n{% highlight plaintext %}\r\noperations: -\r\noutput: 5 2 -\r\n{% endhighlight %}\r\n\r\nلنستمر بتحليل العبارة:\r\n\r\n5) نضيف العدد 2 إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations: -\r\noutput: 5 2 - 2\r\n{% endhighlight %}\r\n\r\n6) انتهينا من قراءة العبارة. ننقل كل العمليات من مكدس العمليات إلى مكدس المخرجات لنحصل على:\r\n{% highlight plaintext %}\r\noperations:\r\noutput: 5 2 - 2 -\r\n{% endhighlight %}\r\n\r\n-----\r\nلنأخذ مثالا آخر يوضح فكرة ترابط العمليات أكثر: \"<code dir=\"ltr\">2^2^3</code>\"\r\n(يدل `^` هنا على عملية [الرفع إلى أس](https://ar.wikipedia.org/wiki/%D8%B1%D9%81%D8%B9_(%D8%B1%D9%8A%D8%A7%D8%B6%D9%8A%D8%A7%D8%AA)))\r\n\r\n1) نضيف العدد 2 إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations:\r\noutput: 2\r\n{% endhighlight %}\r\n2) نضيف العملية ^ إلى مكدس العمليات.\r\n{% highlight plaintext %}\r\noperations: ^\r\noutput: 2\r\n{% endhighlight %}\r\n3) نضيف العدد 2 إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations: ^\r\noutput: 2 2\r\n{% endhighlight %}\r\n4) نأتي لعملية الرفع إلى أس الثانية. ننظر لآخر عملية في مكدس العمليات ونجد العملية نفسها، لذلك فأولويات العمليتين متساويتان.\r\nفي المثال السابق نقلنا آخر عملية في مكدس العمليات إلى مكدس المخرجات لأن عملية الطرح left-associative،\r\nلكن هل عملية الرفع إلى أس كذلك؟ غالبا لا، عملية الرفع إلى أس تعمل من اليمين إلى اليسار، أي <span dir=\"ltr\">right-associative</span>.[^2]\r\nهذا يعني أن عبارة \"<code dir=\"ltr\">2^2^3</code>\" يتم تحليلها كـ \"<code dir=\"ltr\">2^(2^3)</code>\".\r\nلذلك سنضيف العملية الحالية إلى مكدس العمليات ونستمر ببساطة.\r\n{% highlight plaintext %}\r\noperations: ^ ^\r\noutput: 2 2\r\n{% endhighlight %}\r\n5) نضيف العدد 3 إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations: ^ ^\r\noutput: 2 2 3\r\n{% endhighlight %}\r\n6) انتهينا من قراءة العبارة. ننقل كل العمليات من مكدس العمليات إلى مكدس المخرجات.\r\n{% highlight plaintext %}\r\noperations:\r\noutput: 2 2 3 ^ ^\r\n{% endhighlight %}\r\n\r\nنتجت لدينا العبارة البولندية المعكوسة \"<code dir=\"ltr\">2 2 3 ^ ^</code>\" والتي ناتجها هو 256،\r\nبينما لو عاملنا عملية الرفع إلى أس على أنها left-associative فستنتج العبارة \"<code dir=\"ltr\">2 2 ^ 3 ^</code>\"\r\nوالتي ناتجها هو 64.\r\n\r\n## استعراض تفاعلي للخوارزمية\r\n\r\nاستخدم هذا البرنامج التفاعلي المضمن لفهم الخوارزمية أكثر . جرب إدخال عبارة رياضية ما والضغط على «تشغيل»\r\nلكي يحسبه البرنامج، ثم اضغط «إيقاف» واستخدم خياري «التقدم بخطوة» و«الرجوع بخطوة» لفحص عمل الخوارزمية خطوة بخطوة.\r\n\r\n{::nomarkdown}\r\n<iframe src=\"https://www.abdnh.net/shunting-yard-algorithm-demo/?lang=ar\"></iframe>\r\n{:/}\r\n\r\nاضغط على هذا الرابط إذا كانت نافذة البرنامج لا تظهر كليا أو هناك مشكلة في عرضها: <https://www.abdnh.net/shunting-yard-algorithm-demo/?lang=ar>\r\n\r\n## خطوات عمل الخوارزمية\r\n\r\nبعد أن نظرنا إلى عدة أمثلة، يمكننا استنتاج خطوات عمل الخوارزمية وكتابتها بشكل شبه منهجي على\r\nالنحو التالي:\r\n\r\n1) نقرأ حدا من حدود العبارة الرياضية المدخلة إذا كان ما يزال هناك حدود.\r\n\r\n2) إذا كان الحد عددا نضيفه إلى مكدس المخرجات\r\n\r\n3) إذا كان الحد عملية غير الأقواس (لنقل لها O<sub>1</sub>)، نبدأ بنقل كل عملية O<sub>2</sub> من مكدس العمليات\r\n  إلى مكدس المخرجات ما دامت (1) ليست أقواسا **و** (2) أولويتها أعلى من أولوية O<sub>1</sub> **أو**\r\n  للعمليتين أولويات متساوية **و** عملية O<sub>1</sub> هي left-associative، ثم ندخل O<sub>1</sub>\r\n  إلى مكدس العمليات. يمكن التعبير عن الشرط بال[سودوكود](https://ar.wikipedia.org/wiki/%D8%B3%D9%88%D8%AF%D9%88%D9%83%D9%88%D8%AF):\r\n{% highlight plaintext %}\r\n(o2 is not a parenthesis) AND ((o2.precedence > o1.precedence) OR (o2.precedence == o1.precedence && o1 is left-associative))\r\n{% endhighlight %}\r\n\r\n4) إذا كان الحد قوسا أيسر \")\"، نضيفه إلى مكدس العمليات.\r\n\r\n5) إذا كان الحد قوسا أيمن \"(\"،نبدأ بنقل عمليات من مكدس العمليات إلى مكدس المخرجات ما\r\n  دامت ليست أقواسا يسرى، ثم نخرج القوس الأيسر من مكدس العمليات وتخلص منه. إذا لم يوجد\r\n  قوس أيسر فهناك خطأ في العبارة.\r\n\r\n6) بعد الانتهاء من قراءة كل حدود العبارة، ننقل كل العمليات من مكدس العمليات إلى مكدس المخرجات.\r\n\r\nينتج لدينا في مكدس المخرجات عبارة رياضية بالصيغة البولندية المعكوسة بعد هذه العملية.\r\nإذا كان هدفنا هو حساب ناتج العملية وليس إنتاج عبارة بصيغة مختلفة، فبدل عملية نقل العمليات\r\nإلى مكدس المخرجات المتكررة في عدة خطوات (3، 5، 6)، يمكننا ببساطة إخراج عوامل كل\r\nعملية من هذه العمليات وحساب ناتجها وإضافته إلى مكدس المخرجات.\r\n\r\n\r\n## تطبيق للخوارزمية\r\n\r\nلتطبيق للخوارزمية بلغة C، انظر هذه المكتبة التي كتبتها: <https://github.com/abdnh/math-eval>\r\n\r\n## وصلات خارجية\r\n\r\nسأضع هنا وصلات إنترنت للاستزادة أكثر حول الموضوع:\r\n\r\n- فيديوهات يوتيوب على قناة Computerphile:\r\n  - [Reverse Polish Notation and The Stack](https://www.youtube.com/watch?v=7ha78yWRDlE)\r\n  - [Reverse Polish Grows on Trees](https://www.youtube.com/watch?v=TrfcJCulsF4)\r\n\r\n[^1]: انظر [ويكيبيديا](https://ar.wikipedia.org/wiki/%D8%AA%D8%B1%D8%AA%D9%8A%D8%A8_%D8%A7%D9%84%D8%B9%D9%85%D9%84%D9%8A%D8%A7%D8%AA_%D8%A7%D9%84%D8%AD%D8%B3%D8%A7%D8%A8%D9%8A%D8%A9#%D8%AA%D8%B1%D8%AA%D9%8A%D8%A8_%D9%85%D8%B3%D8%AA%D9%88%D9%89_%D8%A7%D9%84%D8%B9%D9%85%D9%84%D9%8A%D8%A7%D8%AA) حول ترتيب العمليات.\r\n\r\n[^2]: ليس هناك في الحقيقة إجماع حول هذه القاعدة لكن يبدو أن الحساب من اليمين (right-associative) هو الشائع بين لغات البرمجة. انظر <https://codeplea.com/exponentiation-associativity-options> لمزيد من التفاصيل.\r\n"
    },
    {
      "title": "كيف تصبح هاكرا حقيقيا: شاهد أنمياتك المفضلة من سطر الأوامر",
      "date": "2022-01-13",
      "tags": [
        "computer",
        "anime"
      ],
      "uuid": "76663eb0-0c1f-40d6-b13a-cec1b59f04c7",
      "lastModified": "2022-07-22",
      "id": "terminal-video",
      "content": "\nحسنا، لقد رميت ويندوز في سلة المهملات وانتقلت إلى لينكس بعد عدة محاولات باءت بالفشل\nلأن تعريف الواي فاي اللعين يأبى إلا أن لا يعمل. لكنه يعمل الآن، وأخيرا!\nوكأي مستخدم لينكس ونيرد أصيل، فقد تعلمت استخدام سطر الأوامر وبدأت تستخدمه لكل\nأعمالك الحاسوبية... ما عدا مشاهدة أنمياتك المفضلة (احتمال أنك مستخدم لينكس ومتابع أنمي في الوقت نفسه يقارب 99%).\nلكنك تشعر بالذنب والخوف من أن تُتهم بأنك شخص عادي (أو normie) بسبب ذلك.\n\nلا تقلق! سأشرح لك في هذه المقالة كيف يمكنك مشاهدة شخصيات الموي المفضلة لديك\nبدون مغادرة الطرفية!\n\n## المتطلبات\n\nنحتاج البرامج التالية لتنفيذ هدفنا النبيل:\n- مكتبة [libsixel](https://github.com/saitoha/libsixel) لدعم صيغة رسوميات [Sixel](https://en.wikipedia.org/wiki/Sixel)\n(وهي ما سيمكننا من عرض الفيديو في الطرفية).\n- مشغل وسائط [mpv](https://mpv.io/).\n- محاكي الطرفية [mlterm](http://mlterm.sourceforge.net/).\n\nسأشرح كيفية التنصيب للتوزيعات المبنية على ديبيان، لكن يمكنك طبعا تطبيق تعليمات مشابهة في أي توزيعة.\n\n## التنصيب على توزيعات ديبيان\n\n- نصب libsixel باستخدام الأمر التالي:\n{% highlight plaintext %}\nsudo apt install libsixel-dev\n{% endhighlight %}\n- نصب mlterm باستخدام\n{% highlight plaintext %}\nsudo apt install mlterm\n{% endhighlight %}\n\nجئنا للجزء الصعب: مشغل mpv لا يأتي عادة مع دعم لصيغة Sixel، لذلك لن تعمل النسخة المنصبة بمدير الحزم APT غالبا.\nالحل هو أن نبني نسختنا الخاصة من البرنامج من الشفرة المصدرية مع تفعيل دعم Sixel.\nلبناء البرنامج اتبع الخطوات التالية:\n- نزل كود mpv باستخدام git في مجلد ما:\n{% highlight plaintext %}\ngit clone https://github.com/mpv-player/mpv\n{% endhighlight %}\n- يدعم mpv كل من أداتي بناء meson و waf. سنستخدم هنا meson، لذلك نصبه باستخدام الأمر التالي[^1]:\n{% highlight plaintext %}\npip3 install --user meson\n{% endhighlight %}\nيبدو أن إصدار meson الموجود في APT لا يعمل مع mpv في وقت كتابة هذه الأسطر لأنه قديم بعض الشيء.\n- ابنِ mpv ونصبه باستخدام الأوامر التالية[^2]:\n{% highlight plaintext %}\nmeson build -D sixel=enabled\nmeson compile -C build\nmeson install -C build\n{% endhighlight %}\nإذا صادفت أي أخطاء حول مكاتب متطلبة ناقصة، جرب هذا الأمر لتنزيلها:\n{% highlight plaintext %}\n sudo apt build-dep mpv\n{% endhighlight %}\nأو ابحث في الإنترنت حول كيفية تنصيب المكتبة الناقصة.\n\nانتهينا من تفاصيل التنصيب المملة وحان وقت المتعة!\n\n- افتح طرفية mlterm بتشغيل الأمر `mlterm` من طرفيتك المفضلة.\n- اذهب إلى مجلد فيه فيديوهات الأنمي المفضل لديك باستخدام `cd`.\n- نفذ الأمر التالي مع تغيير اسم الفيديو `anime.mp4`:\n{% highlight plaintext %}\nmpv --vo=sixel --profile=sw-fast --really-quiet anime.mp4\n{% endhighlight %}\n- يمكنك أيضا تغيير حجم نافذة الفيديو باستخدم خيارات `--vo-sixel-width=<width>, --vo-sixel-height=<height>`‏[^3]:\n{% highlight plaintext %}\nmpv --vo=sixel --profile=sw-fast --really-quiet anime.mp4 --vo-sixel-width=800 --vo-sixel-height=600\n{% endhighlight %}\n- استمتع بمشاهدة الأنمي!\n\n:img{src=\"mlterm-linux.png\" caption=\"مشاهدة الأنمي من سطر الأوامر في لينكس\"}\n\n## التنصيب على ويندوز\n\nقبل أن تتهمني بالخيانة العظمى وتغلق الصفحة، تريث قليلا. إنما أشرح الطريقة على ويندوز\nفقط لكي أقنع المساكين مستخدمي ويندوز بروعة سطر الأوامر وأجعلهم يتنقلون إلى لينكس.[^4]\n\nخطوات التنصيب على ويندوز كالتالي:\n- بجانب [المتطلبات الأساسية](#المتطلبات) تحتاج أيضا إلى تثبيت حزمة [MSYS2](https://www.msys2.org/).\nاذهب إلى <https://www.msys2.org/#installation> ونزل البرنامج.\n- نزل mlterm من خلال الموقع الرسمي (نسخة msys2): <http://mlterm.sourceforge.net/bin.html>\n- انسخ مجلدات \"bin\", \"etc\", \"lib\" و \"libexec\" في الملف المضغوط الذي نزلته (mlterm-msys2-YYYYMMDD.zip)\n  إلى مجلد `c:\\msys64\\usr` (أو المجلد الذي نصبت فيه MSYS2)، حيث تكون ملفات كل مجلد داخل المجلد ذي الاسم نفسه في\n  `c:\\msys64\\usr`.\n- اتبع تعليمات بناء mpv من المصدر الموجودة في وثائق البرنامج هنا: <https://github.com/mpv-player/mpv/blob/master/DOCS/compile-windows.md#native-compilation-with-msys2>\n  مع فارق أنه في خطوة أمر `waf configure` عليك أيضا تفعيل دعم Sixel بإضافة الخيار\n  `--enable-sixel` للأمر الأساسي.\n- افتح طرفية mlterm بتشغيل الأمر `mlterm` من طرفية MSYS2.\n- يمكنك الآن تشغيل الأنمي المفضل بأمر مثل التالي (انظر تعليمات لينكس حول الخيارات):\n{% highlight plaintext %}\nmpv --vo=sixel --profile=sw-fast --really-quiet anime.mp4\n{% endhighlight %}\n- يبدو أن واجهة mpv الرسومية الافتراضية لا تعمل مع وضع Sixel في ويندوز، لذلك قد تحتاج لاستخدام بعض الخيارات\n  قبل تشغيل الفيديو لكي تختار ملف الترجمة أو الصوت (إذا كان الفيديو يتضمن أكثر من ترجمة أو صوت). يمكن استخدام خيارات `--aid` و `--sid` لتحقيق ذلك:\n{% highlight plaintext %}\nmpv --vo=sixel --aid=2 --sid=3 anime.mp4\n{% endhighlight %}\n\n:img{src=\"mlterm-windows.png\" caption=\"مشاهدة الأنمي من سطر الأوامر في ويندوز\"}\n\n\n## خاتمة\n\nبقيت مشكلة قد تعيق مسريتك الطرفية وهي سؤال هل عليك مغادرة الطرفية لكي تحمل فيديوهات الأنمي قبل مشاهدتها في الطرفية؟\nالجواب هو لحسن الحظ لا! أداة [ani-cli](https://github.com/pystardust/ani-cli) تسمح لك بتحميل الأنمي من راحة طرفيتك!\n\nأرجو أن يكون هذا الشرح مفيدا. مشاهدة ممتعة!\n\n[^1]: <https://mesonbuild.com/Getting-meson.html#installing-meson-with-pip>\n\n[^2]: <https://github.com/mpv-player/mpv#meson>\n\n[^3]: انظر <https://mpv.io/manual/master/#video-output-drivers-sixel> لقائمة الخيارات المتعلقة بـ Sixel.\n\n[^4]: اعتراف خطير: كاتب هذه المقالة كتب المقالة في ويندوز 10.\n"
    },
    {
      "title": "ويكي TiddlyWiki للملحوظات",
      "date": "2021-05-16",
      "tags": [
        "computer"
      ],
      "uuid": "fc245433-6a14-4191-9c00-aa67ff1179f4",
      "lastModified": "2022-07-21",
      "id": "tiddlywiki-blog",
      "content": "\nأنشأت \"ويكي شخصية\" مخصصة لتدوين أي فكرة مشتتة تخطر ببالي لا تناسب مقالة كاملة أو تدوين شروحات قصيرة لأفكار تهمني على شكل ويكي:\n[الويكي](curious/index.html)\n"
    }
  ],
  "users": [
    {
      "username": "admin",
      "password": "$2b$10$UUxBh6Rv95qhj2EpKzYHA.oFzLYGM06/1CkvYdmInT4dSPlyZ5pgG",
      "admin": true
    }
  ]
}